#Область СобытияФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("ИмяОбработки") Тогда
		ИмяОбработки = Параметры.ИмяОбработки;
	КонецЕсли;
	Если Параметры.Свойство("AccessToken") Тогда
		AccessToken = Параметры.AccessToken;
	КонецЕсли;
	Если Параметры.Свойство("RefreshToken") Тогда
		RefreshToken = Параметры.RefreshToken;
	КонецЕсли;
	Если Параметры.Свойство("ВерсияНастроекОбработки") Тогда
		ВерсияНастроекОбработки = Параметры.ВерсияНастроекОбработки;
	КонецЕсли;
	Если Параметры.Свойство("ИспользоватьПодписание") Тогда
		ИспользоватьПодписание = Параметры.ИспользоватьПодписание;
	КонецЕсли;
	Если Параметры.Свойство("ОтпечатокСертификатаBase64") Тогда
		ОтпечатокСертификатаBase64 = Параметры.ОтпечатокСертификатаBase64;
	КонецЕсли;
	Если Параметры.Свойство("ПарольДоступаКЗакрытомуКлючу") Тогда
		ПарольДоступаКЗакрытомуКлючу = Параметры.ПарольДоступаКЗакрытомуКлючу;
	КонецЕсли;
	Если Параметры.Свойство("ТипСубъектаПодписанта") Тогда
		ТипСубъектаПодписанта = Параметры.ТипСубъектаПодписанта;
	КонецЕсли;
	Если Параметры.Свойство("МчдGUIDПодписанта") Тогда
		МчдGUIDПодписанта = Параметры.МчдGUIDПодписанта;
	КонецЕсли;
	Если Параметры.Свойство("ДатаНачалаДействияМЧД") Тогда
		ДатаНачалаДействияМЧД = Параметры.ДатаНачалаДействияМЧД;
	КонецЕсли;	
	Если Параметры.Свойство("ДолжностьФизлица") Тогда
		ДолжностьФизлица = Параметры.ДолжностьФизлица;
	КонецЕсли;
	Если Параметры.Свойство("АдресВременногоХранилищаКэш") Тогда
		АдресВременногоХранилищаКэш = Параметры.АдресВременногоХранилищаКэш;
	КонецЕсли;
	Если Параметры.Свойство("Организация") Тогда
		Организация = Параметры.Организация;
		ОрганизацияПриИзмененииНаСервере();
	КонецЕсли;
	
	ОпределитьИспользованиеТестовогоКонтура();
	
	УстановитьПараметрСвойстваИдентификатораДинспискаКонтрагентов();
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ВедущийФрагментАдресаKeycloak = ?(Объект.ЭтоТестоваяОбработка = Истина, "oauth-test", "oauth");
	realmФрагментАдресаKeycloak = ?(Объект.ЭтоТестоваяОбработка = Истина, "playground", "production");
	
КонецПроцедуры

&НаКлиенте
Процедура ОрганизацияПриИзменении(Элемент)
	
	ОрганизацияПриИзмененииНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура ОрганизацияПриИзмененииНаСервере()
	
	// Отобразим текущий идентификатор в БД, при наличии.
	ИдентификаторОрганизацииВБД = ПолучитьИдентификаторЭДОИз1СПоСсылке(Организация);
	
КонецПроцедуры

&НаКлиенте
Процедура КонтрагентПриИзменении(Элемент)
	
	Если Элементы.СписокКонтрагентов.ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;	
	
	Если Контрагент = Элементы.СписокКонтрагентов.ТекущиеДанные.Ссылка Тогда
		Возврат;
	КонецЕсли;	
	
	ИдентификаторыЭДО.Очистить();
	
	Контрагент = Элементы.СписокКонтрагентов.ТекущиеДанные.Ссылка;
	
	Если НЕ Контрагент.Пустая() Тогда
		КонтрагентПриИзмененииНаСервере();
	Иначе
		ИдентификаторКонтагентаВБД = "";
	КонецЕсли;
	
	НайтиКонтрагентаВЭДО();
	
КонецПроцедуры

&НаСервере
Процедура КонтрагентПриИзмененииНаСервере()
			
	ИННКонтрагента = Контрагент.ИНН; 
	КППКонтрагента = Контрагент.КПП;
	// Отобразим текущий идентификатор в БД, при наличии.
	ИдентификаторКонтагентаВБД = ПолучитьИдентификаторЭДОИз1СПоСсылке(Контрагент);
	
КонецПроцедуры

&НаКлиенте
Процедура ИдентификаторыЭДОВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	ИдентификаторАбонента	= Элемент.ТекущиеДанные.ИдентификаторКонтрагента;
	КППАбонента				= Элемент.ТекущиеДанные.КПП;
	
	Если НЕ ИдентификаторАбонента = "" Тогда
		Если КППАбонента = КППКонтрагента Тогда
			Оповещение = Новый ОписаниеОповещения("ПослеЗакрытияВопросаСохраненияИдентификатораКонтрагента", ЭтотОбъект, ИдентификаторАбонента);			
			ПоказатьВопрос(Оповещение, "Текущий идентификатор контрагента: "+ИдентификаторКонтагентаВБД+Символы.ПС+"Выбранный идентификатор контрагента: "+ИдентификаторАбонента, РежимДиалогаВопрос.ДаНет, , КодВозвратаДиалога.Да, "Обновить идентификатор контрагента "+Контрагент+"?");  	
		Иначе
			Оповещение = Новый ОписаниеОповещения("ПослеЗакрытияВопросаОНесоответствииКППКонтрагента", ЭтотОбъект, ИдентификаторАбонента);			
			ПоказатьВопрос(Оповещение, "КПП выбраного абонента не совпадает с КПП выбраного контрагента.", РежимДиалогаВопрос.ДаНет, , КодВозвратаДиалога.Да, "Вы уверены?");  	
		КонецЕсли;	
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ИдентификаторыЭДОПриАктивизацииСтроки(Элемент)

	Если ЗначениеЗаполнено(Элементы.ПроизвольныйИдентификатор.ТекстРедактирования) Тогда
		Возврат;
	КонецЕсли;	
	
	Если Элемент.ТекущиеДанные = Неопределено Тогда
		Элементы.ОтправитьПриглашение.Доступность = Ложь;
		Возврат;
	КонецЕсли;
	
	Если	Лев(Элемент.ТекущиеДанные.ИдентификаторКонтрагента, 3) = "2LD"
		ИЛИ Лев(Элемент.ТекущиеДанные.ИдентификаторКонтрагента, 3) = "2BK"
		ИЛИ Лев(Элемент.ТекущиеДанные.ИдентификаторКонтрагента, 3) = "2BE" 
		ИЛИ Лев(Элемент.ТекущиеДанные.ИдентификаторКонтрагента, 3) = "2AL"
		ИЛИ Лев(Элемент.ТекущиеДанные.ИдентификаторКонтрагента, 3) = "2BM"
		ИЛИ Лев(Элемент.ТекущиеДанные.ИдентификаторКонтрагента, 3) = "2AE"
		ИЛИ Лев(Элемент.ТекущиеДанные.ИдентификаторКонтрагента, 3) = "2AK"
		ИЛИ Лев(Элемент.ТекущиеДанные.ИдентификаторКонтрагента, 3) = "2LT"
		ИЛИ Лев(Элемент.ТекущиеДанные.ИдентификаторКонтрагента, 3) = "2AH"
		ИЛИ Лев(Элемент.ТекущиеДанные.ИдентификаторКонтрагента, 3) = "2EE"
		ИЛИ Лев(Элемент.ТекущиеДанные.ИдентификаторКонтрагента, 3) = "2LJ"
		ИЛИ Лев(Элемент.ТекущиеДанные.ИдентификаторКонтрагента, 3) = "2LG"
		ИЛИ Лев(Элемент.ТекущиеДанные.ИдентификаторКонтрагента, 3) = "2JM"
		ИЛИ Лев(Элемент.ТекущиеДанные.ИдентификаторКонтрагента, 3) = "2HX" Тогда
		
		//Если НЕ СтрНайти(Элемент.ТекущиеДанные.СтатусПриглашения, "Отправка возможна.") = 0 Тогда
			Элементы.ОтправитьПриглашение.Доступность = Истина;
		//Иначе
		//	Элементы.ОтправитьПриглашение.Доступность = Ложь;
		//КонецЕсли;	
		
	ИначеЕсли Элемент.ТекущиеДанные.СтатусПриглашения = "Перейти на форму заявки" Тогда
		
		Элементы.ОтправитьПриглашение.Доступность = Истина;	
		
	Иначе
		
		Элементы.ОтправитьПриглашение.Доступность = Ложь;
		
	КонецЕсли;

КонецПроцедуры

&НаКлиенте 
Процедура ПослеЗакрытияВопросаСохраненияИдентификатораКонтрагента(РезультатВыбора, ИдентификаторАбонента) Экспорт

	Если РезультатВыбора = КодВозвратаДиалога.Да Тогда
		
		МассивКонтрагентов = Новый Массив;
		ДанныеПоКонтрагенту = Новый Структура;
		ДанныеПоКонтрагенту.Вставить("Ссылка", Контрагент);
		ДанныеПоКонтрагенту.Вставить("ИНН", СокрЛП(Элементы.ИННКонтрагента.ТекстРедактирования));
		ДанныеПоКонтрагенту.Вставить("КПП", СокрЛП(Элементы.КППКонтрагента.ТекстРедактирования));
		ДанныеПоКонтрагенту.Вставить("Идентификатор", ИдентификаторАбонента);
		МассивКонтрагентов.Добавить(ДанныеПоКонтрагенту);
		
		ОбновитьИдентификаторыУчастниковЭДОНаСервере(МассивКонтрагентов);
		
		ИдентификаторКонтагентаВБД = ИдентификаторАбонента;
		
	КонецЕсли;	
	
КонецПроцедуры

&НаКлиенте 
Процедура ПослеЗакрытияВопросаОНесоответствииКППКонтрагента(РезультатВыбора, ИдентификаторАбонента) Экспорт

	Если РезультатВыбора = КодВозвратаДиалога.Да Тогда
		
		Оповещение = Новый ОписаниеОповещения("ПослеЗакрытияВопросаСохраненияИдентификатораКонтрагента", ЭтотОбъект, ИдентификаторАбонента);			
		ПоказатьВопрос(Оповещение, "Текущий идентификатор контрагента: "+ИдентификаторКонтагентаВБД+Символы.ПС+"Выбранный идентификатор контрагента: "+ИдентификаторАбонента, РежимДиалогаВопрос.ДаНет, , КодВозвратаДиалога.Да, "Обновить идентификатор контрагента "+Контрагент+"?");  	
		
	КонецЕсли;	
	
КонецПроцедуры

&НаКлиенте
Процедура ПроизвольныйИдентификаторИзменениеТекстаРедактирования(Элемент, Текст, СтандартнаяОбработка)
	
	ОбработатьИзменениеНабораИдентификаторов(Текст);	
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработатьИзменениеНабораИдентификаторов(Текст)
	
	Если СтрДлина(Текст) = 0 Тогда
		Элементы.ИдентификаторыЭДО.Доступность = Истина;
		Элементы.ОтправитьПриглашение.Доступность = Ложь;
		Элементы.ДекорацияНадписьЗаявка.Видимость = Ложь;
	Иначе
		Элементы.ИдентификаторыЭДО.Доступность = Ложь;
	КонецЕсли;	
	
	Если СтрДлина(Текст) >= 3 Тогда
		
		ДанныеОператора = ПолучитьПредставлениеИАвтороуминг(Лев(Текст, 3));
		
		Если ДанныеОператора = Неопределено тогда
			ПроизвольныйИдентификаторПоддерживается = Ложь;
			Элементы.ДекорацияНадписьОператорПроизвольногоИдентификатора.Заголовок = "";
			Элементы.ОтправитьПриглашение.Доступность = Ложь;
			Элементы.ДекорацияНадписьЗаявка.Видимость = Ложь;	
		Иначе
			ПроизвольныйИдентификаторПоддерживается = Истина;
			Элементы.ДекорацияНадписьОператорПроизвольногоИдентификатора.Заголовок = ДанныеОператора.Представление + " Приглашение не требуется";
			Если НЕ Лев(Текст, 3) = "2VO" тогда
				Элементы.ОтправитьПриглашение.Доступность = Истина;
			Иначе
				Элементы.ОтправитьПриглашение.Доступность = Ложь;
			КонецЕсли;
			
			Если ДанныеОператора.Автороуминг = "+" тогда
				Элементы.ДекорацияНадписьЗаявка.Видимость = Ложь;
			Иначе
                Элементы.ДекорацияНадписьЗаявка.Видимость = Истина;
			КонецЕсли;
			
		КонецЕсли;
	Иначе       
		ПроизвольныйИдентификаторПоддерживается = Ложь;
		Элементы.ДекорацияНадписьОператорПроизвольногоИдентификатора.Заголовок = "";
		Элементы.ОтправитьПриглашение.Доступность = Ложь;
		Элементы.ДекорацияНадписьЗаявка.Видимость = Ложь;
	КонецЕсли;	
	
КонецПроцедуры 

//Возвращаемое значение:
// Структура, ключ - Представление, значение - Автороуминг (булево)
&НаСервере
Функция ПолучитьПредставлениеИАвтороуминг(ИДОператора)
	
	СтруктураВозврата = Новый Структура;
		
	ОбработкаОбъект = РеквизитФормыВЗначение("Объект");
	
	Макет = ОбработкаОбъект.ПолучитьМакет("СлужебныеДанные"); 
	
	Построитель = Новый ПостроительЗапроса;
	Построитель.ИсточникДанных = Новый ОписаниеИсточникаДанных(Макет.Область());
    Построитель.ДобавлениеПредставлений = ТипДобавленияПредставлений.НеДобавлять;
    Построитель.ЗаполнитьНастройки();
    Построитель.Выполнить();
	
	ТЗ = Построитель.Результат.Выгрузить(); 
	ОтборСтрок = Новый Структура;
	
	ОтборСтрок.Вставить("Идентификатор", ИДОператора);
	
	НайденныеСтроки = ТЗ.НайтиСтроки(ОтборСтрок);
	
	Если НЕ НайденныеСтроки.Количество() = 0 тогда
		СтруктураВозврата.Вставить("Идентификатор", НайденныеСтроки[0].Идентификатор);
		СтруктураВозврата.Вставить("Представление", НайденныеСтроки[0].Представление);
		СтруктураВозврата.Вставить("Автороуминг", НайденныеСтроки[0].Автороуминг);
	Иначе
	    СтруктураВозврата = Неопределено;
	КонецЕсли;
	
	Возврат СтруктураВозврата;
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыФункции

&НаКлиенте
Процедура НайтиКонтрагентаВЭДО()
	
	ИдентификаторыЭДО.Очистить();
	Элементы.ДекорацияНадписьКонтрагентНеОбнаружен.Видимость = Ложь;
	
	Если НЕ Контрагент.Пустая() И ЗначениеЗаполнено(ИННКонтрагента) Тогда
		ЗаполнитьСписокПриглашений();
	КонецЕсли;	      
	
	ОчиститьПроизвольныйИдентификатор();
	Элементы.ПроизвольныйИдентификатор.ОбновитьТекстРедактирования();
	ОбработатьИзменениеНабораИдентификаторов(ПроизвольныйИдентификатор);
	
КонецПроцедуры

&НаСервере
Функция ПолучитьСтруктуруХранения1С() Экспорт
	
	ИмяМетаданных = "Конфигурация";
	Кэш = ПолучитьИзВременногоХранилища(АдресВременногоХранилищаКэш);    
	
	Если Кэш.НастройкиОбъект[Кэш.ПрефиксКонфигурации+ИмяМетаданных] = Неопределено Тогда				
		ИнициализацияКэш(Истина);
		Кэш = ПолучитьИзВременногоХранилища(АдресВременногоХранилищаКэш);		
	КонецЕсли;
	
	Настройка = Кэш.НастройкиОбъект[Кэш.ПрефиксКонфигурации+ИмяМетаданных].ХранениеИнформации1С;
	
	СтрокаВызоваСвойствоИдентификатор 			= Настройка.ОФД_ЭДО_ИдентификаторДокумента.ТипОбъектаМетаданных + "." + 
	Настройка.ОФД_ЭДО_ИдентификаторДокумента.Путь + ".НайтиПоНаименованию(" + Символ(034) + 
	Настройка.ОФД_ЭДО_ИдентификаторДокумента.Наименование + Символ(034) + ")";
	
	СтрокаВызоваСвойствоСтатус					= Настройка.ОФД_ЭДО_СтатусДокумента.ТипОбъектаМетаданных + "." + 
	Настройка.ОФД_ЭДО_СтатусДокумента.Путь + ".НайтиПоНаименованию(" + Символ(034) + 
	Настройка.ОФД_ЭДО_СтатусДокумента.Наименование + Символ(034) + ")";
	
	СтрокаВызоваСвойствоИдентификаторУчастника	= Настройка.ОФД_ЭДО_ИдентификаторУчастникаЭДО.ТипОбъектаМетаданных + "." + 
	Настройка.ОФД_ЭДО_ИдентификаторУчастникаЭДО.Путь + ".НайтиПоНаименованию(" + Символ(034) + 
	Настройка.ОФД_ЭДО_ИдентификаторУчастникаЭДО.Наименование + Символ(034) + ")";
	
	СвойствоИдентификатор 				= Вычислить(СтрокаВызоваСвойствоИдентификатор);									
	СвойствоСтатус						= Вычислить(СтрокаВызоваСвойствоСтатус);
	СвойствоИдентификаторУчастника		= Вычислить(СтрокаВызоваСвойствоИдентификаторУчастника);
	
	СтруктураХранения1С = Новый Структура;
	СтруктураХранения1С.Вставить("СвойствоИдентификатор",			СвойствоИдентификатор);
	СтруктураХранения1С.Вставить("СвойствоСтатус",					СвойствоСтатус);
	СтруктураХранения1С.Вставить("СвойствоИдентификаторУчастника",	СвойствоИдентификаторУчастника);
	СтруктураХранения1С.Вставить("НаименованиеРегистра",			Настройка.Путь);
	
	Возврат СтруктураХранения1С;
	
КонецФункции

&НаСервере
Процедура ИнициализацияКэш(Откат = Ложь)
	
	// Инициализируем Кэш 
	//МодульОбъектаОбработки = РеквизитФормыВЗначение("Объект");
	Кэш = ЗагрузитьКэш(Откат);
	//ЗначениеВРеквизитФормы(МодульОбъектаОбработки, "Объект"); 
	СохранитьКэш(Кэш);
	// Инициализируем Кэш 
	
КонецПроцедуры

// Функция загрузки Кэш
// Если значение реквизита формы "АдресВременногоХранилищаКэш" заполнено, то берем Кэш из временного хранилища (ШтатныйЗапуск())
&НаСервере
Функция ЗагрузитьКэш(Откат = Ложь)       
	
	Если ЗначениеЗаполнено(ЭтаФорма.АдресВременногоХранилищаКэш) и Не Откат Тогда
		
		Возврат ПолучитьИзВременногоХранилища(ЭтаФорма.АдресВременногоХранилищаКэш);
		
	Иначе
		
		МодульОбъектаОбработки = РеквизитФормыВЗначение("Объект");
		Кэш = МодульОбъектаОбработки.Инициализация(Откат);
		ЗначениеВРеквизитФормы(МодульОбъектаОбработки, "Объект"); 
		
		Возврат Кэш;
		
	КонецЕсли;
	
КонецФункции

// Функция сохранения Кэш в процессе работы
// В текущий Кэш записываем только требуемые для выгрузки настройки, остальные динамически подргружаем по мере необходимости
&НаСервере
Процедура СохранитьКэш(Кэш)
	
	// Удаляем предыдущее значение Кэш из временного хранилища
	Если ЗначениеЗаполнено(ЭтаФорма.АдресВременногоХранилищаКэш) Тогда
		//УдалитьИзВременногоХранилища(ЭтаФорма.АдресВременногоХранилищаКэш);
		Адрес = ЭтаФорма.АдресВременногоХранилищаКэш;
	Иначе
		Адрес = ЭтаФорма.УникальныйИдентификатор;
	КонецЕсли;
	
	// Записываем новое значение Кэш во временное хранилище
	ЭтаФорма.АдресВременногоХранилищаКэш = ПоместитьВоВременноеХранилище(Кэш, Адрес);	
	
КонецПроцедуры

&НаКлиенте
Процедура СохранитьПараметрыАвторизацииИПодписанияОрганизации(Организация, AccessTokenОрганизации, RefreshTokenОрганизации, ИспользоватьПодписание, ОтпечатокСертификатаBase64Организации, ПарольДоступаКЗакрытомуКлючуОрганизации, ТипСубъектаОрганизации, МчдGUIDОрганизации, ДатаНачалаДействияМЧДОрганизации, ДолжностьФизлицаОрганизации)

	ПараметрыАвторизацииИПодписанияОрганизации = Новый Структура;
	
	ПараметрыАвторизацииИПодписанияОрганизации.Вставить("AccessToken", AccessTokenОрганизации);
	ПараметрыАвторизацииИПодписанияОрганизации.Вставить("RefreshToken", RefreshTokenОрганизации);
	ПараметрыАвторизацииИПодписанияОрганизации.Вставить("ИспользуетсяПодписание", ИспользоватьПодписание);
	
	ПараметрыПодписания = Новый Структура;
	 
	ПараметрыПодписания.Вставить("ОтпечатокСертификатаBase64", ОтпечатокСертификатаBase64Организации);
	ПараметрыПодписания.Вставить("ПарольДоступаКЗакрытомуКлючу", ПарольДоступаКЗакрытомуКлючуОрганизации);
	Менеджер = ПолучитьМенеджерКриптографии();
	Сертификат  = ПолучитьЭЦППоОтпечатку(Менеджер, Base64Значение(ОтпечатокСертификатаBase64Организации));
	Если ТипЗнч(Сертификат) = Тип("СертификатКриптографии") Тогда 
		ПараметрыПодписания.Вставить("Субъект", Сертификат.Субъект);
	Иначе
		ПараметрыПодписания.Вставить("Субъект", Неопределено);
	КонецЕсли;
	ПараметрыПодписания.Вставить("ТипСубъекта", ТипСубъектаОрганизации);
	ПараметрыПодписания.Вставить("МчдGUID", МчдGUIDОрганизации);
	ПараметрыПодписания.Вставить("ДатаНачалаДействияМЧД", ДатаНачалаДействияМЧДОрганизации);
	ПараметрыПодписания.Вставить("ДолжностьФизлица", ?(ЗначениеЗаполнено(ДолжностьФизлицаОрганизации), ДолжностьФизлицаОрганизации, Неопределено));
	
	ПараметрыАвторизацииИПодписанияОрганизации.Вставить("ПараметрыПодписания", ПараметрыПодписания);
	
	ОбновитьПараметрыАвторизацииИПодписанияОрганизации(Организация, ПараметрыАвторизацииИПодписанияОрганизации);	
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьПараметрыАвторизацииИПодписанияОрганизации(Организация, ПараметрыАвторизацииИПодписанияОрганизации)
	
	Интеграция = ПолучитьИнтеграциюНаСервере(ВерсияНастроекОбработки);
	
	Если НЕ Интеграция.Свойство("ПараметрыАвторизацииИПодписания") Тогда
		Интеграция.Вставить("ПараметрыАвторизацииИПодписания", Новый Соответствие);
	КонецЕсли;
		
	Интеграция.ПараметрыАвторизацииИПодписания.Вставить(Организация, ПараметрыАвторизацииИПодписанияОрганизации);	
	
	СохранитьИнтеграциюНаСервере(Интеграция);
	
КонецПроцедуры

// Функция получает параметры интеграции из хранилища общих настроек
// Параметры интеграции хранятся относительно текущего пользователя
&НаСервереБезКонтекста
Функция ПолучитьИнтеграциюНаСервере(ВерсияНастроекОбработки) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	СписокЗначений = ХранилищеОбщихНастроек.ПолучитьСписок("ОФД_ЭДО_НастройкиОбработки", ПолучитьТекущегоПользователя());
	Интеграция = СписокЗначений.НайтиПоЗначению("Интеграция");
	
	// Информация об интеграции уже есть в хранилище значений 
	Если ТипЗнч(Интеграция) = Тип("ЭлементСпискаЗначений") Тогда
		
		Возврат ХранилищеОбщихНастроек.Загрузить("ОФД_ЭДО_НастройкиОбработки", 	// Ключ объекта
		"Интеграция",															// Ключ настройки 
		"Информация о способе интеграции обработки ОФД ЭДО.", 					// описание настройки
		ПолучитьТекущегоПользователя()); 										// Пользователь
		
	Иначе 
		// Это первый запуск, возвращаем пустую структуру
		Интеграция = Новый Структура;
		Интеграция.Вставить("СпособИнтеграции");
		Интеграция.Вставить("КаталогОбмена");
		Интеграция.Вставить("ИспользоватьКриптографию");
		Интеграция.Вставить("ПараметрыАвторизацииИПодписания", Новый Соответствие);
		Интеграция.Вставить("ВерсияНастроек", ВерсияНастроекОбработки);
		Интеграция.Вставить("МассоваяВыгрузка", Новый Структура);
		
		Возврат Интеграция;
		
	КонецЕсли; 	
	
	УстановитьПривилегированныйРежим(Ложь);
	
КонецФункции

// Функция сохраняет параметры интеграции в хранилище общих настроек
// Параметры интеграции хранятся относительно текущего пользователя
&НаСервереБезКонтекста
Процедура СохранитьИнтеграциюНаСервере(Интеграция) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	ХранилищеОбщихНастроек.Сохранить("ОФД_ЭДО_НастройкиОбработки", 								// Ключ объекта
	"Интеграция",											// Ключ настройки 
	Интеграция,												// Настройка
	"Информация о способе интеграции обработки ОФД ЭДО.", 	// описание настройки
	ПолучитьТекущегоПользователя()); 						// Пользователь     
	
	УстановитьПривилегированныйРежим(Ложь);	
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьСписокПриглашений()
	
	ПараметрыЗапроса = ПолучитьШаблонПараметровЗапроса();
	
	ПараметрыЗапроса.Параметры.Вставить("<inn>", СокрЛП(ИННКонтрагента));	
	
	ИнформацияОКонтрагенте = ВыполнитьЗапросAPI("API_ИнформацияОКонтрагенте", ПараметрыЗапроса);
	
	Если Не ИнформацияОКонтрагенте.Ошибка Тогда
		
		// Контрагент найден
		ЗаполнитьСписокИдентификаторов(ИнформацияОКонтрагенте);	
		
	Иначе
		
		Сообщение = Новый СообщениеПользователю();
		Сообщение.Текст = "Не удалось получить информацию о контрагенте из системы ОФД ЭДО."+Символы.ПС+"Описание ошибки:"+Символы.ПС+ИнформацияОКонтрагенте.Описание;
		Сообщение.Сообщить();
		
	КонецЕсли;
	
	Если ЗначениеЗаполнено(СокрЛП(КППКонтрагента)) Тогда
		ПараметрыЗапроса.Параметры.Вставить("<kpp>", СокрЛП(КППКонтрагента));
	КонецЕсли;
	
	ИнформацияОКонтрагентеПоДаннымФНС = ВыполнитьЗапросAPI("API_ИнформацияОКонтрагентеПоДаннымФНС", ПараметрыЗапроса);
	
	Если Не ИнформацияОКонтрагентеПоДаннымФНС.Ошибка Тогда
		
		// Контрагент найден
		ЗаполнитьСписокИдентификаторов(ИнформацияОКонтрагентеПоДаннымФНС);
		
	КонецЕсли;	
	
	Если ИдентификаторыЭДО.Количество() = 0 Тогда
		Элементы.ДекорацияНадписьКонтрагентНеОбнаружен.Видимость = Истина;	
	КонецЕсли;
	
КонецПроцедуры
&НаКлиенте
Процедура ЗаполнитьСписокИдентификаторов(РезультатЗапроса)
	
	ИнформацияОКонтрагенте = РезультатЗапроса; 
	
	Если ТипЗнч(ИнформацияОКонтрагенте.Результат) = Тип("Массив") и ИнформацияОКонтрагенте.Результат.Количество() <> 0 Тогда
		Для Каждого ЭлементРезультата из ИнформацияОКонтрагенте.Результат Цикл
			ИдентификаторАбонента = ЭлементРезультата.gid;
			
			Если ЭлементРезультата.details.Свойство("kpp") Тогда
				КППАбонента = ЭлементРезультата.details.kpp;
			Иначе	
				КППАбонента = "";
			КонецЕсли;	
			
			ПараметрыПоиска = Новый Структура;
			ПараметрыПоиска.Вставить("ИдентификаторКонтрагента", ИдентификаторАбонента);
			СуществующиеСтроки = ИдентификаторыЭДО.НайтиСтроки(ПараметрыПоиска);
			Если НЕ СуществующиеСтроки.Количество() = 0 Тогда
				Продолжить;
			КонецЕсли;	
						
			НоваяСтрокаИдентификатора = ИдентификаторыЭДО.Добавить();
			НоваяСтрокаИдентификатора.КПП = КППАбонента;
			НоваяСтрокаИдентификатора.ИдентификаторКонтрагента = ИдентификаторАбонента;
			
			Если Лев(ИдентификаторАбонента, 3) = "2VO" Тогда
				НоваяСтрокаИдентификатора.Оператор = "Платформа ЭДО";
				НоваяСтрокаИдентификатора.СтатусПриглашения = "Не требуется.";
			ИначеЕсли Лев(ИдентификаторАбонента, 3) = "EVR" Тогда
				НоваяСтрокаИдентификатора.Оператор = "Платформа ЭДО тест";
				НоваяСтрокаИдентификатора.СтатусПриглашения = "Не требуется.";
			Иначе
				
				ДанныеОператора = ПолучитьПредставлениеИАвтороуминг(Лев(ИдентификаторАбонента, 3)); 
				
				Если НЕ ДанныеОператора = Неопределено Тогда 
					НоваяСтрокаИдентификатора.Оператор = ДанныеОператора.Представление;
					Если НЕ ДанныеОператора.Автороуминг = "+" Тогда
						НоваяСтрокаИдентификатора.СтатусПриглашения = "Перейти на форму заявки";
					Иначе
						НоваяСтрокаИдентификатора.СтатусПриглашения = ПолучитьСостояниеПриглашения(ИдентификаторОрганизацииВБД, ИдентификаторАбонента);
					КонецЕсли;
				Иначе
					НоваяСтрокаИдентификатора.Оператор = "Неизвестный оператор";
					НоваяСтрокаИдентификатора.СтатусПриглашения = "Перейти на форму заявки";
					
				КонецЕсли;
				
			КонецЕсли;
			
		КонецЦикла;	
	КонецЕсли;	
	
КонецПроцедуры 

&НаСервере
Процедура ОчиститьПроизвольныйИдентификатор()
	
	ПроизвольныйИдентификатор = "";	
	
КонецПроцедуры

&НаКлиенте
Функция СкопироватьКоллекцию(ВходящаяКоллекция)
	
	Если ТипЗнч(ВходящаяКоллекция) = Тип("Структура") Тогда
		НоваяКоллекция = Новый Структура;
	ИначеЕсли ТипЗнч(ВходящаяКоллекция) = Тип("Соответствие") Тогда
		НоваяКоллекция = Новый Соответствие;
	КонецЕсли;
	
	Для Каждого ЭлементКоллекции из ВходящаяКоллекция Цикл
		
		Если ТипЗнч(ЭлементКоллекции.Значение) = Тип("Структура") ИЛИ ТипЗнч(ЭлементКоллекции.Значение) = Тип("Соответствие") Тогда				
			Значение = СкопироватьКоллекцию(ЭлементКоллекции.Значение);			
			НоваяКоллекция.Вставить(ЭлементКоллекции.Ключ, Значение);	
		Иначе
			НоваяКоллекция.Вставить(ЭлементКоллекции.Ключ, ЭлементКоллекции.Значение);
		КонецЕсли;
		
    КонецЦикла;
	
	Возврат НоваяКоллекция;
	
КонецФункции

&НаСервереБезКонтекста
Функция ПолучитьТекущегоПользователя()
	
	Возврат Неопределено;
	
	Если НЕ Метаданные.ОбщиеМодули.Найти("ПользователиИнформационнойБазы") = Неопределено Тогда
		ТекущийПользователь = ПользователиИнформационнойБазы.ТекущийПользователь();
	Иначе
		ТекущийПользователь = ПользователиКлиентСервер.ТекущийПользователь();
	КонецЕсли;	
	
	Возврат ТекущийПользователь;
	
КонецФункции

&НаСервере
Процедура УстановитьПараметрСвойстваИдентификатораДинспискаКонтрагентов()
	
	Кэш = ЗагрузитьКэш();
	
	МодульОбъектаОбработки = РеквизитФормыВЗначение("Объект");
	Настройка = МодульОбъектаОбработки.ПолучитьОбъектНастройкиПоИмениМетаданных("Конфигурация", Кэш);
	
	//ЭтаФорма.СписокКонтрагентов.Параметры
	
	ПутьКЗначениюПараметраВ1С = Настройка.ХранениеИнформации1С["ОФД_ЭДО_ИдентификаторУчастникаЭДО"];
	ЗапросПараметра = Новый Запрос;
	ЗапросПараметра.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
	                        |	ИсточникЗначенияПараметра.Ссылка
	                        |ИЗ
	                        |	"+ПутьКЗначениюПараметраВ1С.ИмяОбъектаМетаданных+"."+ПутьКЗначениюПараметраВ1С.Путь+" КАК ИсточникЗначенияПараметра
	                        |ГДЕ
	                        |	ИсточникЗначенияПараметра.Наименование = """+ПутьКЗначениюПараметраВ1С.Наименование+""""
							+?(ПутьКЗначениюПараметраВ1С.ТипОбъектаМетаданных = "Справочники" ИЛИ ПутьКЗначениюПараметраВ1С.ТипОбъектаМетаданных = "Документы" ИЛИ ПутьКЗначениюПараметраВ1С.ТипОбъектаМетаданных = "Обработки" ИЛИ ПутьКЗначениюПараметраВ1С.ТипОбъектаМетаданных = "ПланыВидовХарактеристик", Символы.ПС+"И ИсточникЗначенияПараметра.ПометкаУдаления = Ложь", "");
	ЗначениеПараметра = ЗапросПараметра.Выполнить().Выгрузить()[0].Ссылка;
	
	ЭтаФорма.СписокКонтрагентов.Параметры.УстановитьЗначениеПараметра("СвойствоИдентификаторАбонента", ЗначениеПараметра);
	
КонецПроцедуры	

&НаСервере
Процедура ОпределитьИспользованиеТестовогоКонтура()

	Объект.ЭтоТестоваяОбработка = ХранилищеОбщихНастроек.Загрузить("ОФД_ЭДО_НастройкиОбработки", 	// Ключ объекта
				"ЭтоТестовыйКонтур",																// Ключ настройки 
				"Служебный параметр, определяющий соединение с тестовым контуром", 					// описание настройки
				ПолучитьТекущегоПользователя());
				
				
	Если Объект.ЭтоТестоваяОбработка = Неопределено тогда
		
		Объект.ЭтоТестоваяОбработка = Ложь;
		
	КонецЕсли; 
		
КонецПроцедуры


#КонецОбласти

#Область КнопкаПолучитьИдентификаторОрганизации

&НаКлиенте
Процедура ПолучитьИдентификаторОрганизации(Команда)
	
	ИдентификаторАбонента = "";
	Элементы.ДекорацияНадписьОрганизацияНеОбнаружена.Видимость = Ложь;
	
	ПараметрыЗапроса = ПолучитьШаблонПараметровЗапроса();
	
	ПараметрыЗапроса.Параметры.Вставить("<inn>", СокрЛП(Элементы.ИННОрганизации.ТекстРедактирования));
	Если ЗначениеЗаполнено(СокрЛП(Элементы.КППОрганизации.ТекстРедактирования)) Тогда
		ПараметрыЗапроса.Параметры.Вставить("<kpp>", СокрЛП(Элементы.КППОрганизации.ТекстРедактирования));
	КонецЕсли;	
	
	ИнформацияОбОрганизации = ВыполнитьЗапросAPI("API_ИнформацияОКонтрагенте", ПараметрыЗапроса);
	
	Если Не ИнформацияОбОрганизации.Ошибка Тогда
		
		// Такого контрагента нет в системе ЭДО
		Если ИнформацияОбОрганизации.КодСостояния = 0 Тогда
			Элементы.ДекорацияНадписьОрганизацияНеОбнаружена.Видимость = Истина;
		КонецЕсли;
		
		// Контрагент найден
		Если ТипЗнч(ИнформацияОбОрганизации.Результат) = Тип("Массив") и ИнформацияОбОрганизации.Результат.Количество() <> 0 Тогда
			Для Каждого ЭлементРезультата из ИнформацияОбОрганизации.Результат Цикл
				Если Лев(ЭлементРезультата.gid, 3) = "2VO" ИЛИ Лев(ЭлементРезультата.gid, 3) = "EVR" Тогда
					// Найден идентификатор
					ИдентификаторАбонента = ЭлементРезультата.gid;
					Прервать;
				Иначе	
					Продолжить;
				КонецЕсли;
			КонецЦикла;
			
			Если ИдентификаторАбонента = "" Тогда
				Элементы.ДекорацияНадписьОрганизацияНеОбнаружена.Видимость = Истина;
			Иначе	
				Оповещение = Новый ОписаниеОповещения("ПослеЗакрытияВопросаСохраненияИдентификатораОрганизации", ЭтотОбъект, ИдентификаторАбонента);			
				ПоказатьВопрос(Оповещение, "Текущий идентификатор организации: "+ИдентификаторОрганизацииВБД+Символы.ПС+"Новый идентификатор организации: "+ИдентификаторАбонента, РежимДиалогаВопрос.ДаНет, , КодВозвратаДиалога.Да, "Обновить идентификатор организации "+Организация+"?");  	
			КонецЕсли;	
			
		Иначе
			Элементы.ДекорацияНадписьОрганизацияНеОбнаружена.Видимость = Истина;
		КонецЕсли;
		
	Иначе
		
		Сообщение = Новый СообщениеПользователю();
		Сообщение.Текст = "Не удалось получить информацию об абоненте из системы ЭДО."+Символы.ПС+"Описание ошибки:"+Символы.ПС+ИнформацияОбОрганизации.Описание;
		Сообщение.Сообщить();	
		
	КонецЕсли;

КонецПроцедуры

&НаКлиенте 
Процедура ПослеЗакрытияВопросаСохраненияИдентификатораОрганизации(РезультатВыбора, ИдентификаторАбонента) Экспорт

	Если РезультатВыбора = КодВозвратаДиалога.Да Тогда
		
		МассивОрганизаций = Новый Массив;
		ДанныеПоОрганизации = Новый Структура;
		ДанныеПоОрганизации.Вставить("Ссылка", Организация);
		ДанныеПоОрганизации.Вставить("ИНН", СокрЛП(Элементы.ИННОрганизации.ТекстРедактирования));
		ДанныеПоОрганизации.Вставить("КПП", СокрЛП(Элементы.КППОрганизации.ТекстРедактирования));
		ДанныеПоОрганизации.Вставить("Идентификатор", ИдентификаторАбонента);
		МассивОрганизаций.Добавить(ДанныеПоОрганизации);
		
		ОбновитьИдентификаторыУчастниковЭДОНаСервере(МассивОрганизаций);
		
		ИдентификаторОрганизацииВБД = ИдентификаторАбонента;
		
	КонецЕсли;	
	
КонецПроцедуры	
	
#КонецОбласти

#Область КнопкаМассоваяРассылкаПриглашенийВЭДО

&НаКлиенте
Процедура ОткрытьФормуМассовойРассылкиПриглашенийВЭДО(Команда)
	
	ПараметрыОткрытияФормы = Новый Структура();                           
	ПараметрыОткрытияФормы.Вставить("Организация", Организация);
	ПараметрыОткрытияФормы.Вставить("AccessToken", AccessToken);
	ПараметрыОткрытияФормы.Вставить("RefreshToken", RefreshToken);
	ПараметрыОткрытияФормы.Вставить("ИспользоватьПодписание", ИспользоватьПодписание);
	ПараметрыОткрытияФормы.Вставить("ВерсияНастроекОбработки", ВерсияНастроекОбработки);
	ПараметрыОткрытияФормы.Вставить("ОтпечатокСертификатаBase64", ОтпечатокСертификатаBase64);
	ПараметрыОткрытияФормы.Вставить("ПарольДоступаКЗакрытомуКлючу", ПарольДоступаКЗакрытомуКлючу);
	ПараметрыОткрытияФормы.Вставить("ТипСубъектаПодписанта", ТипСубъектаПодписанта);
	ПараметрыОткрытияФормы.Вставить("МчдGUIDПодписанта", МчдGUIDПодписанта);
	ПараметрыОткрытияФормы.Вставить("ДатаНачалаДействияМЧД", ДатаНачалаДействияМЧД);
	ПараметрыОткрытияФормы.Вставить("ДолжностьФизлица", ДолжностьФизлица);
	ПараметрыОткрытияФормы.Вставить("АдресВременногоХранилищаКэш", АдресВременногоХранилищаКэш);;
	ОткрытьФорму(ИмяОбработки + ".Форма.ФормаМассовойРассылкиПриглашенийВЭДО", ПараметрыОткрытияФормы, ЭтаФорма, , , , , РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

#КонецОбласти

#Область КнопкаМассовогоСопоставленияКонтрагентов

&НаКлиенте
Процедура ОткрытьФормуМассовогоСопоставленияКонтрагентов(Команда)
	
	ПараметрыОткрытияФормы = Новый Структура();   
	ПараметрыОткрытияФормы.Вставить("ИмяОбработки", ИмяОбработки);
	ПараметрыОткрытияФормы.Вставить("Организация", Организация);
	ПараметрыОткрытияФормы.Вставить("ИдентификаторОрганизацииВБД", ИдентификаторОрганизацииВБД);
	ПараметрыОткрытияФормы.Вставить("AccessToken", AccessToken);
	ПараметрыОткрытияФормы.Вставить("RefreshToken", RefreshToken);
	ПараметрыОткрытияФормы.Вставить("ИспользоватьПодписание", ИспользоватьПодписание);
	ПараметрыОткрытияФормы.Вставить("ВерсияНастроекОбработки", ВерсияНастроекОбработки);
	ПараметрыОткрытияФормы.Вставить("ОтпечатокСертификатаBase64", ОтпечатокСертификатаBase64);
	ПараметрыОткрытияФормы.Вставить("ПарольДоступаКЗакрытомуКлючу", ПарольДоступаКЗакрытомуКлючу);
	ПараметрыОткрытияФормы.Вставить("ТипСубъектаПодписанта", ТипСубъектаПодписанта);
	ПараметрыОткрытияФормы.Вставить("МчдGUIDПодписанта", МчдGUIDПодписанта);
	ПараметрыОткрытияФормы.Вставить("ДатаНачалаДействияМЧД", ДатаНачалаДействияМЧД);
	ПараметрыОткрытияФормы.Вставить("ДолжностьФизлица", ДолжностьФизлица);
	ПараметрыОткрытияФормы.Вставить("АдресВременногоХранилищаКэш", АдресВременногоХранилищаКэш);;
	ОткрытьФорму(ИмяОбработки + ".Форма.ФормаМассовогоСопоставленияКонтрагентов", ПараметрыОткрытияФормы, ЭтаФорма, , , , , РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

#КонецОбласти

#Область ОтправитьПриглашение

&НаКлиенте
Процедура ОтправитьПриглашение(Команда)
	
	Если НЕ ЗначениеЗаполнено(Элементы.ПроизвольныйИдентификатор.ТекстРедактирования) Тогда
	
		Если Элементы.ИдентификаторыЭДО.ТекущиеДанные.СтатусПриглашения = "Не отправлялось" ИЛИ Элементы.ИдентификаторыЭДО.ТекущиеДанные.СтатусПриглашения =  "Не отправлялось. Отправка возможна." ИЛИ НЕ СтрНайти(Элементы.ИдентификаторыЭДО.ТекущиеДанные.СтатусПриглашения, "Отправка возможна") = 0 ИЛИ НЕ СтрНайти(Элементы.ИдентификаторыЭДО.ТекущиеДанные.СтатусПриглашения, "Отправка приглашения возможна") = 0 Тогда
			
			ПриглашениеБылоОтправлено = ОтправитьПриглашениеКЭДО(ИдентификаторОрганизацииВБД, Элементы.ИдентификаторыЭДО.ТекущиеДанные.ИдентификаторКонтрагента);
			
			Если ПриглашениеБылоОтправлено Тогда
				ИдентификаторыЭДО.Очистить();
				ЗаполнитьСписокПриглашений();
			КонецЕсли;	
			
		ИначеЕсли Элементы.ИдентификаторыЭДО.ТекущиеДанные.СтатусПриглашения = "Перейти на форму заявки" Тогда
			
			ЗапуститьПриложение("https://docs.google.com/forms/d/e/1FAIpQLSe7n6yoCZx9B4wQOXPrN1AmbI9k3dksnoSEfrzyLV0jbVnK_A/viewform"); 
		
		Иначе
			
			// Ничего.
		
		КонецЕсли;
	
	Иначе
		
		Если ПроизвольныйИдентификаторПоддерживается Тогда
			
			// Проверим, не было ли отправлено приглашение ранее.
			СтатусПриглашения = ПолучитьСостояниеПриглашения(ИдентификаторОрганизацииВБД, ПроизвольныйИдентификатор);
			
			Если СтатусПриглашения = "Не отправлялось" ИЛИ СтатусПриглашения = "Не отправлялось. Отправка возможна." ИЛИ НЕ СтрНайти(СтатусПриглашения, "Отправка возможна") = 0 ИЛИ НЕ СтрНайти(СтатусПриглашения, "Отправка приглашения возможна") = 0 Тогда
				// Ну тогда отправим.
				ПриглашениеБылоОтправлено = ОтправитьПриглашениеКЭДО(ИдентификаторОрганизацииВБД, ПроизвольныйИдентификатор);
			ИначеЕсли СтрНайти(СтатусПриглашения, "Ошибка") = 0 Тогда
				Сообщение = Новый СообщениеПользователю();
				Сообщение.Текст = "Приглашение этому абоненту уже было отправлено ранее. Текущий статус приглашения - """+СтатусПриглашения+""".";
				Сообщение.Сообщить();
			Иначе
				Сообщение = Новый СообщениеПользователю();
				Сообщение.Текст = СтатусПриглашения;
				Сообщение.Сообщить();
			КонецЕсли;	
			
		Иначе
			
			ЗапуститьПриложение("https://docs.google.com/forms/d/e/1FAIpQLSe7n6yoCZx9B4wQOXPrN1AmbI9k3dksnoSEfrzyLV0jbVnK_A/viewform");
			
		КонецЕсли;	
		
	КонецЕсли;	
		
КонецПроцедуры

#КонецОбласти

#Область ИнтеграцияAPI

&НаКлиенте
Функция ПолучитьСостояниеПриглашения(ИдентификаорОтправителя, ИдентификаторПолучателя)
	
	СостояниеПриглашения = "Не отправлялось. Отправка возможна.";
	
	ПараметрыЗапроса = ПолучитьШаблонПараметровЗапроса();
	
	ПараметрыЗапроса.Параметры.Вставить("<sender_gid>", ИдентификаорОтправителя);
	ПараметрыЗапроса.Параметры.Вставить("<gids>", ИдентификаторПолучателя);
	
	СтатусРоумингаЭДО = ВыполнитьЗапросAPI("API_ПолучитьСтатусРоумингаЭДО", ПараметрыЗапроса);
	
	Если НЕ СтатусРоумингаЭДО.Ошибка Тогда
		
		Если НЕ СтатусРоумингаЭДО.Результат = Неопределено Тогда
			
			Для Каждого Результат Из СтатусРоумингаЭДО.Результат Цикл
				Если Результат.state.status = "ESTABLISHED" Тогда
					// Роуминг работает, отправка возможна.
					СостояниеПриглашения = "Роуминг работает. Приглашение не требуется.";
					Продолжить;
				ИначеЕсли Результат.state.status = "AWAIT_APPROVAL" Тогда
					// Для установки связи требуется наличие приглашения от второй стороны.
					СостояниеПриглашения = "Было отправлено. Ответ еще не получен.";
					Продолжить;
				ИначеЕсли Результат.state.status = "BROKEN" Тогда
					// Приглашение было обработано со стороны оператора-получателя.
					СостояниеПриглашения = "Связь по роумингу была отменена. Отправка приглашения возможна.";
					Продолжить;	
				КонецЕсли;	
			КонецЦикла; 
			
			Возврат СостояниеПриглашения;
			
		КонецЕсли;
		
	Иначе
				
		СостояниеПриглашения = "Ошибка получения данных о состоянии роуминга ЭДО.";
		Возврат СостояниеПриглашения;
			
	КонецЕсли;	
	
	ПараметрыЗапроса = ПолучитьШаблонПараметровЗапроса();
	
	ПараметрыЗапроса.Параметры.Вставить("<sender_gid>", ИдентификаорОтправителя);
	ПараметрыЗапроса.Параметры.Вставить("<recipient_gid>", ИдентификаторПолучателя);
	
	СтатусПриглашения = ВыполнитьЗапросAPI("API_ПолучитьСтатусПриглашенияКЭДО", ПараметрыЗапроса);
	
	Если НЕ СтатусПриглашения.Ошибка Тогда
		
		Если НЕ СтатусПриглашения.Результат = Неопределено Тогда
			
			Для Каждого Результат Из СтатусПриглашения.Результат Цикл
				Если Результат.type = "BREAK" Тогда
					// Приглашение было отклонено со стороны оператора-получателя.
					СостояниеПриглашения = "Отклонено. Отправка возможна.";
					Продолжить;
				ИначеЕсли НЕ Результат.type = "REQUEST" Тогда
					// Приглашение было обработано со стороны оператора-получателя.
					СостояниеПриглашения = "Было отправлено. Ответ еще не получен.";
					Продолжить;
				Иначе
					Если Результат.status = "SENDING" Тогда
						// В процессе отправки.	
						СостояниеПриглашения = "Было отправлено. Обрабатывается оператором получателя.";
						Продолжить;
					ИначеЕсли Результат.status = "SENT" Тогда
						// Отправлено.
						СтатусПриглашения = "Было доставлено. Ответ еще не получен.";
						Продолжить;
					ИначеЕсли Результат.status = "FAILED" Тогда
						// Произошла ошибка в процессе отправки.
						СостояниеПриглашения = "Ошибка отправки. Отправка возможна.";
						Продолжить;
					Иначе
						Продолжить;
					КонецЕсли;		
					Прервать;
				КонецЕсли;	
			КонецЦикла;	
			
		КонецЕсли;
		
	Иначе	
				
		СостояниеПриглашения = "Ошибка получения данных о пригашениях к ЭДО.";
		
	КонецЕсли;
	
	Возврат СостояниеПриглашения;
	
КонецФункции	

&НаКлиенте
Функция ОтправитьПриглашениеКЭДО(ИдентификаорОтправителя, ИдентификаторПолучателя)
	
	ПриглашениеБылоОтправлено = Ложь;
	
	ПараметрыЗапроса = ПолучитьШаблонПараметровЗапроса();
	
	ПараметрыЗапроса.Параметры.Вставить("<sender_gid>", ИдентификаорОтправителя);
	ПараметрыЗапроса.Параметры.Вставить("<recipient_gid>", ИдентификаторПолучателя);
	
	ОтправкаПриглашения = ВыполнитьЗапросAPI("API_ОтправитьАбонентуПриглашениеКЭДО", ПараметрыЗапроса);
	
	Если НЕ ОтправкаПриглашения.Ошибка Тогда
		
		Если ОтправкаПриглашения.КодСостояния = 204 Тогда
			ПриглашениеБылоОтправлено = Истина;
			Сообщение = Новый СообщениеПользователю();
			Сообщение.Текст = "Приглашение было успешно отправлено.";
			Сообщение.Сообщить();
		КонецЕсли;	
		
	Иначе	
		
		Сообщение = Новый СообщениеПользователю();
		Сообщение.Текст = "Не удалось сформировать приглашение в системе ЭДО."+Символы.ПС+"Описание ошибки:"+Символы.ПС+ОтправкаПриглашения.Описание;
		Сообщение.Сообщить();
				
	КонецЕсли;
	
	Возврат ПриглашениеБылоОтправлено;
	
КонецФункции

// Функция возвращает результат любой функции обращения к API. Обращение к функциям напрямую возможно.
// Основная особенность функции - автоматический релогин, если метод требует авторизацию и первый ответ на запрос вернул ошибку 401.
// Автоматический релогин возможен только в том случае, если пользователь зарегистрировал свой сертификат в ЛК ЭДО.
&НаКлиенте
Функция ВыполнитьЗапросAPI(ИмяФункцииЗапроса, ВходящиеПараметрыЗапроса) Экспорт
	
	РезультатЗапроса = ПолучитьШаблонСтруктурыОтвета();
	РезультатЗапроса.Ошибка = Истина;
	
	ПараметрыЗапроса = СкопироватьКоллекцию(ВходящиеПараметрыЗапроса);
	
	Выполнить("РезультатЗапроса = "+ИмяФункцииЗапроса+"(ПараметрыЗапроса);");
	
	Если РезультатЗапроса.КодСостояния = 401 ИЛИ РезультатЗапроса.КодСостояния = 500 Тогда
		
		// Ошибка авторизации.
		// Попытка обновить токен по сертификату.
		Если ИспользоватьПодписание = Истина И НЕ ЗначениеЗаполнено(RefreshToken) Тогда
			
			Если ПараметрыЗапроса.Свойство("Заголовки") И НЕ ПараметрыЗапроса.Заголовки.Получить("Authorization") = Неопределено Тогда	
				НовыйТокен = ПолучитьТокенПоОтпечаткуСертификата(Base64Значение(ОтпечатокСертификатаBase64), ПарольДоступаКЗакрытомуКлючу);
				Если НЕ НовыйТокен = Неопределено Тогда
					ПараметрыЗапроса = СкопироватьКоллекцию(ВходящиеПараметрыЗапроса);
					ПараметрыЗапроса.Заголовки.Вставить("Authorization", "Bearer "+ НовыйТокен);
					Выполнить("РезультатЗапроса = "+ИмяФункцииЗапроса+"(ПараметрыЗапроса);");
					Если РезультатЗапроса.КодСостояния = 200 Тогда
						AccessToken = НовыйТокен;
						RefreshToken = "";
						СохранитьПараметрыАвторизацииИПодписанияОрганизации(Организация, AccessToken, RefreshToken, ИспользоватьПодписание, ОтпечатокСертификатаBase64, ПарольДоступаКЗакрытомуКлючу, ТипСубъектаПодписанта, МчдGUIDПодписанта, ДатаНачалаДействияМЧД, ДолжностьФизлица);
					КонецЕсли;	
				КонецЕсли;	
			КонецЕсли;
			
		ИначеЕсли ЗначениеЗаполнено(AccessToken) И ЗначениеЗаполнено(RefreshToken) Тогда 	
			
			FreshTokens = RefreshTokens(RefreshToken);
			Если НЕ FreshTokens = Неопределено Тогда
				НовыйAccessToken = FreshTokens.access_token;
				НовыйRefreshToken = FreshTokens.refresh_token;
				AccessToken = НовыйAccessToken;
				RefreshToken = НовыйRefreshToken;
				ПараметрыЗапроса = СкопироватьКоллекцию(ВходящиеПараметрыЗапроса);
				ПараметрыЗапроса.Заголовки.Вставить("Authorization", "Bearer "+ AccessToken);
				Выполнить("РезультатЗапроса = "+ИмяФункцииЗапроса+"(ПараметрыЗапроса);");
				Если РезультатЗапроса.КодСостояния = 200 Тогда	
					СохранитьПараметрыАвторизацииИПодписанияОрганизации(Организация, AccessToken, RefreshToken, ИспользоватьПодписание, ОтпечатокСертификатаBase64, ПарольДоступаКЗакрытомуКлючу, ТипСубъектаПодписанта, МчдGUIDПодписанта, ДатаНачалаДействияМЧД, ДолжностьФизлица);
				КонецЕсли;	
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли;	
	
	Возврат РезультатЗапроса;
	
КонецФункции

// Функция подготавливает шаблон параметров запроса
&НаКлиенте
Функция ПолучитьШаблонПараметровЗапроса() Экспорт
	
	Структура = Новый Структура;
	
	Структура.Вставить("Соединение", 	ПолучитьСоединение());
	Структура.Вставить("Заголовки", 	ПолучитьЗаголовки());
	Структура.Вставить("Параметры", 	Новый Соответствие);
	
	Возврат Структура;
	
КонецФункции

&НаКлиенте
Функция ПолучитьЗаголовки()
	
	Заголовки = Новый Соответствие;
	//Заголовки.Вставить("accept", "application/json;charset=UTF-8");
	Заголовки.Вставить("accept", "*/*");
	Заголовки.Вставить("Authorization", "Bearer "+ AccessToken);
	
	Возврат Заголовки;
	
КонецФункции

&НаКлиенте
Функция ПолучитьСоединение_Устаревшее() // Удалить
	
	СертификатКлиентаWin 	= Новый СертификатКлиентаWindows(СпособВыбораСертификатаWindows.Выбирать);
	СертификатУЦWin 		= Неопределено; //Новый СертификатыУдостоверяющихЦентровWindows();
	
	ssl = Новый ЗащищенноеСоединениеOpenSSL(СертификатКлиентаWin, СертификатУЦWin); 		
	
	Если Объект.ЭтоТестоваяОбработка Тогда		
		// Тест
		Соединение  =  Новый HTTPСоединение("edo-test.platformaofd.ru", //сервер
		443, 	//порт
		,		//логин
		,		//пароль
		,		//прокси
		20,		//таймаут
		ssl,);	//защищенное HTTPS соединение 			
	Иначе	
		// Бой
		Соединение  =  Новый HTTPСоединение("edo.platformaofd.ru", //сервер
		443,	//порт
		,		//логин
		,		//пароль
		,		//прокси
		20,		//таймаут
		ssl,);	//защищенное HTTPS соединение
	КонецЕсли; 	
	
	Возврат Соединение;
	
КонецФункции

&НаКлиенте
Функция ПолучитьСоединение()
	
	СертификатКлиентаWin 	= Новый СертификатКлиентаWindows(СпособВыбораСертификатаWindows.Выбирать);
	СертификатУЦWin 		= Неопределено; //Новый СертификатыУдостоверяющихЦентровWindows();
	
	ssl = Новый ЗащищенноеСоединениеOpenSSL(СертификатКлиентаWin, СертификатУЦWin); 		
	
	Если Объект.ЭтоТестоваяОбработка Тогда		
		// Тест
		Соединение  =  Новый HTTPСоединение("api-test.platformaofd.ru", //сервер
		443, 	//порт
		,		//логин
		,		//пароль
		,		//прокси
		20,		//таймаут
		ssl,);	//защищенное HTTPS соединение 			
	Иначе	
		// Бой
		Соединение  =  Новый HTTPСоединение("api.platformaofd.ru", //сервер
		443,	//порт
		,		//логин
		,		//пароль
		,		//прокси
		20,		//таймаут
		ssl,);	//защищенное HTTPS соединение
	КонецЕсли;
		
	Возврат Соединение;
	
КонецФункции

// Функция заполняет параметры запроса в строке запроса
&НаКлиенте
Функция ЗаполнитьПараметрыВЗапросе(СтрокаЗапроса, Параметры) Экспорт
	
	Для Каждого Параметр из Параметры Цикл
		
		Если НЕ СтрНайти(СтрокаЗапроса, Параметр.Ключ) = 0 Тогда
			СтрокаЗапроса = СтрЗаменить(СтрокаЗапроса, Параметр.Ключ, Параметр.Значение);
			Параметры.Удалить(Параметр.Ключ);
		КонецЕсли;
		
	КонецЦикла;	
	
	Возврат СтрокаЗапроса;
	
КонецФункции

// Функция подготавливает шаблон структуры ответа
&НаКлиенте
Функция ПолучитьШаблонСтруктурыОтвета()
	
	Структура = Новый Структура();
	
	Структура.Вставить("Результат", 	Неопределено);
	Структура.Вставить("Ошибка", 		Ложь);
	Структура.Вставить("Описание", 		""); 
	Структура.Вставить("КодСостояния",	"");
	
	Возврат Структура;
	
КонецФункции // ПолучитьШаблонСтруктурыОтвета()

// Функция обрабатывает ответ запроса по коду состояния
&НаКлиенте
Функция ОбработатьОтвет(Ответ, СтруктураОтвета, ЭтоФайл = Ложь) Экспорт 
	
	СтруктураОтвета.КодСостояния = Ответ.КодСостояния;
	ОтветОбработан = Ложь;
	Тело = Ответ.ПолучитьТелоКакСтроку();	
	
	ТекущаяДата = Строка(ТекущаяДата());
	
	Если СтруктураОтвета.КодСостояния = 200 Тогда
		
		Если Тело = "[]" или Тело = "" Тогда
			СтруктураОтвета.Описание 		= ТекущаяДата + " Пустой ответ.";
		Иначе 
			Если НЕ ЭтоФайл Тогда
				ЧтениеJSON = Новый ЧтениеJSON();
				ЧтениеJSON.УстановитьСтроку(Тело);
				СтруктураОтвета.Результат = ПрочитатьJSON(ЧтениеJSON);			
				ЧтениеJSON.Закрыть(); 
			Иначе
				ДвоичныеДанныеФайла = Ответ.ПолучитьТелоКакДвоичныеДанные();
				СтруктураОтвета.Результат = ДвоичныеДанныеФайла;
				СтруктураОтвета.Вставить("Тип", Ответ.Заголовки.Получить("Content-Type"));
			КонецЕсли;	
		КонецЕсли;
		
		Возврат СтруктураОтвета;
		
	КонецЕсли;
	
	
	Если СтруктураОтвета.КодСостояния = 201 Тогда 
		
		Если Тело = "[]" Тогда
			СтруктураОтвета.Описание 		= ТекущаяДата + " Вроде норм, но че-то непонятно.";
			СтруктураОтвета.КодСостояния 	= 0;
		Иначе 
			ЧтениеJSON = Новый ЧтениеJSON();
			ЧтениеJSON.УстановитьСтроку(Тело);
			СтруктураОтвета.Результат = ПрочитатьJSON(ЧтениеJSON);			
			ЧтениеJSON.Закрыть();  
		КонецЕсли;
		
		Возврат СтруктураОтвета;	
		
	КонецЕсли;
	
	
	Если СтруктураОтвета.КодСостояния = 400 Тогда
		СтруктураОтвета.Ошибка 		= Истина;
		СтруктураОтвета.Описание 	= ТекущаяДата + " Error 400. Ошибка выгружаемых данных." + ?(ЗначениеЗаполнено(Тело), " ("+Тело+")", ""); 	
		Возврат СтруктураОтвета; 	
	КонецЕсли;
	
	Если СтруктураОтвета.КодСостояния = 401 Тогда
		СтруктураОтвета.Ошибка 		= Истина;
		СтруктураОтвета.Описание 	= ТекущаяДата + " Error 401. Ошибка авторизации. Проверье авторизацию в разделе настройки и повторите запрос позднее." + ?(ЗначениеЗаполнено(Тело), " ("+Тело+")", "");		
		Возврат СтруктураОтвета;	
	КонецЕсли;	
	
	Если СтруктураОтвета.КодСостояния = 403 Тогда
		СтруктураОтвета.Ошибка 		= Истина;
		СтруктураОтвета.Описание 	= ТекущаяДата +" Error 403." + ?(ЗначениеЗаполнено(Тело), " ("+Тело+")", "");	
		Возврат СтруктураОтвета; 
	КонецЕсли; 	
	
	Если СтруктураОтвета.КодСостояния = 404 Тогда
		СтруктураОтвета.Ошибка 		= Истина;
		СтруктураОтвета.Описание 	= ТекущаяДата +" Error 404." + ?(ЗначениеЗаполнено(Тело), " ("+Тело+")", "");		
		Возврат СтруктураОтвета;		
	КонецЕсли;
	
	Если СтруктураОтвета.КодСостояния = 500 Тогда
		СтруктураОтвета.Ошибка 		= Истина;
		СтруктураОтвета.Описание 	= ТекущаяДата +" Error 500. Сервис недоступен. Повторите запрос позднее." + ?(ЗначениеЗаполнено(Тело), " ("+Тело+")", ""); 		
		Возврат СтруктураОтвета; 		
	КонецЕсли;
	
	Если СтруктураОтвета.КодСостояния = 204 Тогда
		СтруктураОтвета.Ошибка 		= Ложь;
		СтруктураОтвета.Описание 	= ТекущаяДата +" Успешно."; 		
		Возврат СтруктураОтвета; 		
	КонецЕсли;
	
	СтруктураОтвета.Ошибка 		= Истина;
	СтруктураОтвета.Описание 	= ТекущаяДата + " Error " + СтруктураОтвета.КодСостояния + ". Неизвестная ошибка сервиса." + ?(ЗначениеЗаполнено(Тело), " ("+Тело+")", "");      			
	Возврат СтруктураОтвета;
	
КонецФункции

// subscribers/le
&НаКлиенте
Функция API_ИнформацияОКонтрагенте(Знач ПараметрыЗапроса) Экспорт
	
	СтрокаЗапроса = "/edm-subscriber/public/api/v3/subscribers";
	
	Счетчик = 1;
	Для Каждого ПараметрЗапроса из ПараметрыЗапроса.Параметры Цикл
		Если НЕ ПараметрЗапроса.Значение = Неопределено И НЕ ПараметрЗапроса.Значение = Null И НЕ ПараметрЗапроса.Значение = "null" И НЕ ПараметрЗапроса.Значение = "Null" Тогда
			СтрокаЗапроса = СтрокаЗапроса + ?(Счетчик = 1, "?", ?(Счетчик = ПараметрыЗапроса.Количество(), "", "&")) + СтрЗаменить(СтрЗаменить(ПараметрЗапроса.Ключ, ">", ""), "<", "") + "=" +ПараметрЗапроса.Ключ;
		КонецЕсли;	
		Счетчик = Счетчик+1;
	КонецЦикла;
	
	СтрокаЗапроса = ЗаполнитьПараметрыВЗапросе(СтрокаЗапроса, ПараметрыЗапроса.Параметры);
	
	СтруктураОтвета = ПолучитьШаблонСтруктурыОтвета();
	
	Запрос = Новый HTTPЗапрос(СтрокаЗапроса, ПараметрыЗапроса.Заголовки);    	
	
	Ответ = ПараметрыЗапроса.Соединение.Получить(Запрос);
	СтруктураОтвета = ОбработатьОтвет(Ответ, СтруктураОтвета);
	
	Возврат СтруктураОтвета;     
	
КонецФункции

// shared-subscribers
&НаКлиенте
Функция API_ИнформацияОКонтрагентеПоДаннымФНС(Знач ПараметрыЗапроса) Экспорт
	
	СтрокаЗапроса = "/edm-subscriber/public/api/v3/shared-subscribers";
	
	Счетчик = 1;
	Для Каждого ПараметрЗапроса из ПараметрыЗапроса.Параметры Цикл
		Если НЕ ПараметрЗапроса.Значение = Неопределено И НЕ ПараметрЗапроса.Значение = Null И НЕ ПараметрЗапроса.Значение = "null" И НЕ ПараметрЗапроса.Значение = "Null" Тогда
			СтрокаЗапроса = СтрокаЗапроса + ?(Счетчик = 1, "?", ?(Счетчик = ПараметрыЗапроса.Количество(), "", "&")) + СтрЗаменить(СтрЗаменить(ПараметрЗапроса.Ключ, ">", ""), "<", "") + "=" +ПараметрЗапроса.Ключ;
		КонецЕсли;	
		Счетчик = Счетчик+1;
	КонецЦикла;
	
	СтрокаЗапроса = ЗаполнитьПараметрыВЗапросе(СтрокаЗапроса, ПараметрыЗапроса.Параметры);
	
	СтруктураОтвета = ПолучитьШаблонСтруктурыОтвета();
	
	Запрос = Новый HTTPЗапрос(СтрокаЗапроса, ПараметрыЗапроса.Заголовки);    	
	
	Ответ = ПараметрыЗапроса.Соединение.Получить(Запрос);
	СтруктураОтвета = ОбработатьОтвет(Ответ, СтруктураОтвета);
	
	Возврат СтруктураОтвета;     
	
КонецФункции

// /subscribers/{sender_gid}/contacts?{recipient_gids} 
&НаКлиенте
Функция API_ПолучитьСтатусРоумингаЭДО(Знач ПараметрыЗапроса) Экспорт
	
	СтрокаЗапроса = "/edm-roaming/public/api/v3/subscribers/<sender_gid>/contacts"; 
		
	СтрокаЗапроса = ЗаполнитьПараметрыВЗапросе(СтрокаЗапроса, ПараметрыЗапроса.Параметры);   
	
	Счетчик = 1;
	Для Каждого ПараметрЗапроса из ПараметрыЗапроса.Параметры Цикл
		Если НЕ ПараметрЗапроса.Значение = Неопределено И НЕ ПараметрЗапроса.Значение = Null И НЕ ПараметрЗапроса.Значение = "null" И НЕ ПараметрЗапроса.Значение = "Null" Тогда
			СтрокаЗапроса = СтрокаЗапроса + ?(Счетчик = 1, "?", ?(Счетчик = ПараметрыЗапроса.Количество(), "", "&")) + СтрЗаменить(СтрЗаменить(ПараметрЗапроса.Ключ, ">", ""), "<", "") + "=" +ПараметрЗапроса.Ключ;
		КонецЕсли;	
		Счетчик = Счетчик+1;
	КонецЦикла;
	
	СтрокаЗапроса = ЗаполнитьПараметрыВЗапросе(СтрокаЗапроса, ПараметрыЗапроса.Параметры); 
	
	ПараметрыЗапроса.Заголовки.Вставить("accept", "application/json");
	
	СтруктураОтвета = ПолучитьШаблонСтруктурыОтвета();
	
	Запрос = Новый HTTPЗапрос(СтрокаЗапроса, ПараметрыЗапроса.Заголовки); 
	
	Ответ = ПараметрыЗапроса.Соединение.ВызватьHTTPМетод("GET", Запрос);
	СтруктураОтвета = ОбработатьОтвет(Ответ, СтруктураОтвета);
	
	Возврат СтруктураОтвета;
	
КонецФункции

// /subscribers/{sender_gid}/invitations/{recipient_gid} 
&НаКлиенте
Функция API_ПолучитьСтатусПриглашенияКЭДО(Знач ПараметрыЗапроса) Экспорт
	
	СтрокаЗапроса = "/edm-subscriber/public/api/v3/subscribers/<sender_gid>/invitations/<recipient_gid>";
	СтрокаЗапроса = ЗаполнитьПараметрыВЗапросе(СтрокаЗапроса, ПараметрыЗапроса.Параметры);
	ПараметрыЗапроса.Заголовки.Вставить("accept", "application/json");
	
	СтруктураОтвета = ПолучитьШаблонСтруктурыОтвета();
	
	Запрос = Новый HTTPЗапрос(СтрокаЗапроса, ПараметрыЗапроса.Заголовки); 
	
	Ответ = ПараметрыЗапроса.Соединение.ВызватьHTTPМетод("GET", Запрос);;
	СтруктураОтвета = ОбработатьОтвет(Ответ, СтруктураОтвета);
	
	Возврат СтруктураОтвета;
	
КонецФункции	

//  /subscriber/public/api/v3/subscribers/{sender_gid}/invitations/{recipient_gid} 
&НаКлиенте
Функция API_ОтправитьАбонентуПриглашениеКЭДО(Знач ПараметрыЗапроса) Экспорт
	
	СтрокаЗапроса = "/edm-subscriber/public/api/v3/subscribers/<sender_gid>/invitations/<recipient_gid>";
	СтрокаЗапроса = ЗаполнитьПараметрыВЗапросе(СтрокаЗапроса, ПараметрыЗапроса.Параметры);
	ПараметрыЗапроса.Заголовки.Вставить("accept", "application/json");
	
	СтруктураОтвета = ПолучитьШаблонСтруктурыОтвета();
	
	Запрос = Новый HTTPЗапрос(СтрокаЗапроса, ПараметрыЗапроса.Заголовки); 
	
	Ответ = ПараметрыЗапроса.Соединение.ВызватьHTTPМетод("PUT", Запрос);;
	СтруктураОтвета = ОбработатьОтвет(Ответ, СтруктураОтвета);
	
	Возврат СтруктураОтвета;
	
КонецФункции

// security/.../oauth/token
&НаКлиенте
Функция API_ПолучитьТокенАвторизацииПоСертификату(Знач ПараметрыЗапроса) Экспорт
	
	ЗаголовкиЗапроса = Новый Соответствие;
	ЗаголовкиЗапроса.Вставить("Content-Type", "application/x-www-form-urlencoded");
	ЗаголовкиЗапроса.Вставить("x-client-id", ПараметрыЗапроса.Параметры.Получить("ИдентификаторКлиента"));
	ЗаголовкиЗапроса.Вставить("Content-Encoding", "utf-8");
	ПараметрыЗапроса.Заголовки = ЗаголовкиЗапроса;
	
	СтрокаЗапроса = "/edm-security/public/api/v3/oauth/token";
	
	СтруктураОтвета = ПолучитьШаблонСтруктурыОтвета();
	
	Запрос = Новый HTTPЗапрос(СтрокаЗапроса, ПараметрыЗапроса.Заголовки); 
	Запрос.УстановитьТелоИзСтроки(ПараметрыЗапроса.Параметры["<Тело>"], КодировкаТекста.UTF8, ИспользованиеByteOrderMark.НеИспользовать);
	
	Ответ = ПараметрыЗапроса.Соединение.ВызватьHTTPМетод("POST", Запрос);
	СтруктураОтвета = ОбработатьОтвет(Ответ, СтруктураОтвета);
	
	Возврат СтруктураОтвета;
	
КонецФункции

#КонецОбласти

#Область Криптография

&НаКлиенте
Функция ПолучитьМенеджерКриптографии(ТипМенеджераКриптографии = 80) Экспорт 
	
	// Возврат Новый МенеджерКриптографии("", "", 75);      // Старый
	Возврат Новый МенеджерКриптографии("", "", ТипМенеджераКриптографии);  		// Новый	
	
КонецФункции

&НаКлиенте
Функция ПолучитьЭЦППоОтпечатку(Менеджер, Отпечаток) Экспорт
	
	Хранилище = Менеджер.ПолучитьХранилищеСертификатов(ТипХранилищаСертификатовКриптографии.ПерсональныеСертификаты);			
	Возврат Хранилище.НайтиПоОтпечатку(Отпечаток);  	
	
КонецФункции

&НаКлиенте
Функция ПолучитьТокенПоОтпечаткуСертификата(Отпечаток, ПарольДоступаКЗакрытомуКлючуСертификата = "") Экспорт
	
	СистемнаяИнформация = Новый СистемнаяИнформация;
	
	Менеджер = ПолучитьМенеджерКриптографии();
	Менеджер.ПарольДоступаКЗакрытомуКлючу = ПарольДоступаКЗакрытомуКлючуСертификата;
	ЭЦП = ПолучитьЭЦППоОтпечатку(Менеджер, Отпечаток);
	
	ПараметрыЗапроса = ПолучитьШаблонПараметровЗапроса(); 
		
	ЗаписьJSON = Новый ЗаписьJSON();
	
	ТекущаяДатаВUnixTime = Формат(УниверсальноеВремя(ТекущаяДата())- Дата(1970,1,1), "ЧГ=0"); 
	
	ЗаписьJSON.УстановитьСтроку();	    
	ЗаписьJSON.ЗаписатьНачалоОбъекта();
	ЗаписьJSON.ЗаписатьИмяСвойства("ts");
	ЗаписьJSON.ЗаписатьЗначение(ТекущаяДатаВUnixTime); 
	ЗаписьJSON.ЗаписатьИмяСвойства("nonce");
	ЗаписьJSON.ЗаписатьЗначение(Строка(Новый УникальныйИдентификатор()));  
	ЗаписьJSON.ЗаписатьКонецОбъекта();
	СтрокаJSON = ЗаписьJSON.Закрыть();
	
	Поток = Новый ПотокВПамяти;
	Текст = Новый ЗаписьТекста(Поток, КодировкаТекста.UTF8) ;
	Текст.Записать(СтрокаJSON);
	Текст.Закрыть();
	ДвоичныеДанные = Поток.ЗакрытьИПолучитьДвоичныеДанные();
	
	Отказ = Ложь;
	ОписаниеОшибки = "";
	Подпись = Менеджер.Подписать(ДвоичныеДанные, ЭЦП);
	РезультатПодписанияДвоичныеДанные = ПрисоединитьПодпись(Подпись, ДвоичныеДанные, Отказ, ОписаниеОшибки);
		
	ЭлектроннаяПодписьCMSBase64 = Base64Строка(РезультатПодписанияДвоичныеДанные);
	ЭлектроннаяПодписьCMSBase64 = СтрЗаменить(ЭлектроннаяПодписьCMSBase64, Символы.ПС, "");
	ЭлектроннаяПодписьCMSBase64 = СтрЗаменить(ЭлектроннаяПодписьCMSBase64, Символы.ВК, "");
	ЭлектроннаяПодписьCMSвDERвURL = КодироватьBase64СтрокуВСтрокуURLНаСервере(ЭлектроннаяПодписьCMSBase64);
	
	ПараметрыЗапроса.Параметры.Вставить("<Тело>", "grant_type=signature&signature="+ЭлектроннаяПодписьCMSвDERвURL);
	ПараметрыЗапроса.Параметры.Вставить("ИдентификаторКлиента", СистемнаяИнформация.ИдентификаторКлиента);
	
	РезультатЗапросаТокенаПоСертификату = API_ПолучитьТокенАвторизацииПоСертификату(ПараметрыЗапроса);
	
	Если НЕ РезультатЗапросаТокенаПоСертификату.Ошибка Тогда
		
		Возврат РезультатЗапросаТокенаПоСертификату.Результат.access_token;	
		
	Иначе
		
		Возврат Неопределено;
	
	КонецЕсли;
	
КонецФункции

&НаСервереБезКонтекста
Функция КодироватьBase64СтрокуВСтрокуURLНаСервере(ЭлектроннаяПодписьBase64)

	Возврат КодироватьСтроку(ЭлектроннаяПодписьBase64, СпособКодированияСтроки.КодировкаURL);
	
КонецФункции

#Область ПолучениеПрисоединеннойПодписи
// Менеджер криптографии в 1С не умеет делать присоединённые подписи.
// Выхода два: подписывать через COM-объект КриптоПро или воспользоваться сторонним решением.
// Стороннее решение: https://infostart.ru/public/1493281/, за авторством Сивина Алексея.

&НаКлиенте
Функция РазмерКонтейтера(Элемент)
	Результат = Элемент.Длина + 2;

	Если Элемент.Длина<=127 Тогда
		
	ИначеЕсли Элемент.Длина<=255 Тогда
		Результат = Результат + 1;
	ИначеЕсли Элемент.Длина<=65535 Тогда
		Результат = Результат + 2;
	ИначеЕсли Элемент.Длина<=16777215 Тогда
		Результат = Результат + 3;
	ИначеЕсли Элемент.Длина<=4294967295 Тогда
		Результат = Результат + 4;
	ИначеЕсли Элемент.Длина<=1099511627776 Тогда
		Результат = Результат + 5;
	КонецЕсли;

	Возврат Результат;
КонецФункции

&НаКлиенте
Процедура ЗаписатьЭлемент(Элемент,Поток,ТолькоЗаголовок);
	ВремБуфер = Новый БуферДвоичныхДанных(8);

	ВремБуфер[0] = Элемент.ПервыйБайт;
	Поток.Записать(ВремБуфер,0,1);
	
	Если Элемент.Длина<=127 Тогда
		ВремБуфер[0] = Элемент.Длина;
		Поток.Записать(ВремБуфер,0,1);
	Иначе
		Если Элемент.Длина<=255 Тогда
			К = 1;
		ИначеЕсли Элемент.Длина<=65535 Тогда
			К = 2;
		ИначеЕсли Элемент.Длина<=16777215 Тогда
			К = 3;
		ИначеЕсли Элемент.Длина<=4294967295 Тогда
			К = 4;
		ИначеЕсли Элемент.Длина<=1099511627776 Тогда
			К = 5;
		КонецЕсли;
		ВремБуфер[0] = К+128;
		Поток.Записать(ВремБуфер,0,1);

		ВремБуфер.ЗаписатьЦелое64(0,Элемент.Длина,ПорядокБайтов.BigEndian);
		Поток.Записать(ВремБуфер,8-К,К);		
	КонецЕсли;
	
	Если ТолькоЗаголовок<>Истина Тогда
		Поток.Записать(Элемент.Буфер,0,Элемент.Буфер.Размер);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Функция ПрочитатьЭлемент(Буфер,Позиция,Отказ,ОписаниеОшибки)
	
	Результат = Новый Структура;
	
	Если Позиция>=Буфер.Размер Тогда
		Отказ = Истина;
		ОписаниеОшибки = "Ошибка чтения подписи В0001";
		Возврат Неопределено;
	КонецЕсли;
	
	Результат.Вставить("ПервыйБайт",Буфер[Позиция]); Позиция = Позиция + 1;

	Длина = 0;
	Если Позиция>=Буфер.Размер Тогда
		Отказ = Истина;
		ОписаниеОшибки = "Ошибка чтения подписи В0002";
		Возврат Неопределено;
	КонецЕсли;

	Байт = Буфер[Позиция]; Позиция = Позиция + 1;

	Если Байт<=127 Тогда
		Длина = Байт;
	ИначеЕсли Байт=128 Тогда
		Отказ = Истина;
		ОписаниеОшибки = "Ошибка чтения подписи В0003";
		Возврат Неопределено;
	Иначе
		К = Байт-128;

		ВремБуфер = Новый БуферДвоичныхДанных(8);
		ВремБуфер.ЗаписатьЦелое64(0,0);

		М = Новый Массив;
		Для х=1 По К Цикл

			Если Позиция>=Буфер.Размер Тогда
				Отказ = Истина;
				ОписаниеОшибки = "Ошибка чтения подписи В0004";
				Возврат Неопределено;
			КонецЕсли;
			
			ВремБуфер[7-К+х] = Буфер[Позиция];
			Позиция = Позиция + 1;
		КонецЦикла;
		
		Длина = ВремБуфер.ПрочитатьЦелое64(0,ПорядокБайтов.BigEndian);
	КонецЕсли;
	
	Если (Позиция+Длина)>Буфер.Размер Тогда
		Отказ = Истина;
		ОписаниеОшибки = "Ошибка чтения подписи В0005";
		Возврат Неопределено;
	КонецЕсли;

	Результат.Вставить("Длина",Длина);
	Результат.Вставить("Буфер",Буфер.Прочитать(Позиция,Длина));
	Позиция = Позиция + Длина;
	
	Возврат Результат;
КонецФункции

&НаКлиенте
Функция ПрисоединитьПодпись(Подпись,ДвоичныеДанные,Отказ,ОписаниеОшибки) Экспорт

	//Разбираем
	ЧтениеДанных = Новый ЧтениеДанных(Подпись);
	Буфер = ЧтениеДанных.ПрочитатьВБуферДвоичныхДанных();
	
	ПозицияА = 0;
	А1 = ПрочитатьЭлемент(Буфер,ПозицияА,Отказ,ОписаниеОшибки);
	Если Отказ Тогда
		Возврат Неопределено;
	КонецЕсли;

	Если А1.ПервыйБайт<>48 Тогда //SEQUENCE
		Отказ = Истина;
		ОписаниеОшибки = "Ошибка чтения подписи А0001";
		Возврат Неопределено;
	КонецЕсли;
	
	Если ПозицияА<>Буфер.Размер Тогда
		Отказ = Истина;
		ОписаниеОшибки = "Ошибка чтения подписи А0002";
		Возврат Неопределено;
	КонецЕсли;
	
	ПозицияБ = 0;
	Б1 = ПрочитатьЭлемент(А1.Буфер,ПозицияБ,Отказ,ОписаниеОшибки);
	Если Отказ Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Если Б1.ПервыйБайт<>6 Тогда //OBJECT IDENTIFIER
		Отказ = Истина;
		ОписаниеОшибки = "Ошибка чтения подписи А0003";
		Возврат Неопределено;
	КонецЕсли;

	Если ПолучитьBase64СтрокуИзБуфераДвоичныхДанных(Б1.Буфер)<>"KoZIhvcNAQcC" Тогда //1.2.840.113549.1.7.2
		Отказ = Истина;
		ОписаниеОшибки = "Ошибка чтения подписи А0004";
		Возврат Неопределено;
	КонецЕсли;
	
	Б2 = ПрочитатьЭлемент(А1.Буфер,ПозицияБ,Отказ,ОписаниеОшибки);
	Если Отказ Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Если ПозицияБ<>А1.Буфер.Размер Тогда
		Отказ = Истина;
		ОписаниеОшибки = "Ошибка чтения подписи А0005";
		Возврат Неопределено;
	КонецЕсли;
	
	ПозицияВ = 0;
	В1 = ПрочитатьЭлемент(Б2.Буфер,ПозицияВ,Отказ,ОписаниеОшибки);
	Если Отказ Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Если В1.ПервыйБайт<>48 Тогда //SEQUENCE
		Отказ = Истина;
		ОписаниеОшибки = "Ошибка чтения подписи А0006";
		Возврат Неопределено;
	КонецЕсли;
	
	Если ПозицияВ<>Б2.Буфер.Размер Тогда
		Отказ = Истина;
		ОписаниеОшибки = "Ошибка чтения подписи А0007";
		Возврат Неопределено;
	КонецЕсли;
	
	ПозицияГ = 0;
	Г1 = ПрочитатьЭлемент(В1.Буфер,ПозицияГ,Отказ,ОписаниеОшибки);
	Если Отказ Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Если Г1.ПервыйБайт<>2 Тогда //INTEGER
		Отказ = Истина;
		ОписаниеОшибки = "Ошибка чтения подписи А0008";
		Возврат Неопределено;
	КонецЕсли;
	
	Г2 = ПрочитатьЭлемент(В1.Буфер,ПозицияГ,Отказ,ОписаниеОшибки);
	Если Отказ Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Если Г2.ПервыйБайт<>49 Тогда //SET
		Отказ = Истина;
		ОписаниеОшибки = "Ошибка чтения подписи А0009";
		Возврат Неопределено;
	КонецЕсли;
	
	Г3 = ПрочитатьЭлемент(В1.Буфер,ПозицияГ,Отказ,ОписаниеОшибки);
	Если Отказ Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Если Г3.ПервыйБайт<>48 Тогда //SEQUENCE
		Отказ = Истина;
		ОписаниеОшибки = "Ошибка чтения подписи А0010";
		Возврат Неопределено;
	КонецЕсли;
	
	ПозицияД = 0;
	Д1 = ПрочитатьЭлемент(Г3.Буфер,ПозицияД,Отказ,ОписаниеОшибки);
	Если Отказ Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Если Д1.ПервыйБайт<>6 Тогда //OBJECT IDENTIFIER
		Отказ = Истина;
		ОписаниеОшибки = "Ошибка чтения подписи А0011";
		Возврат Неопределено;
	КонецЕсли;

	Если ПолучитьBase64СтрокуИзБуфераДвоичныхДанных(Д1.Буфер)<>"KoZIhvcNAQcB" Тогда //1.2.840.113549.1.7.1
		Отказ = Истина;
		ОписаниеОшибки = "Ошибка чтения подписи А0012";
		Возврат Неопределено;
	КонецЕсли;
	
	Если ПозицияД<>Г3.Буфер.Размер Тогда
		Отказ = Истина;
		ОписаниеОшибки = "Ошибка чтения подписи А0013";
		Возврат Неопределено;
	КонецЕсли;

	Г4 = ПрочитатьЭлемент(В1.Буфер,ПозицияГ,Отказ,ОписаниеОшибки);
	Если Отказ Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Г5 = ПрочитатьЭлемент(В1.Буфер,ПозицияГ,Отказ,ОписаниеОшибки);
	Если Отказ Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Если ПозицияГ<>В1.Буфер.Размер Тогда
		Отказ = Истина;
		ОписаниеОшибки = "Ошибка чтения подписи А0014";
		Возврат Неопределено;
	КонецЕсли;
	
	//Собираем
	
	//Создаем новые элементы Д2 И Е1
	ЧТ = Новый ЧтениеДанных(ДвоичныеДанные);
	Е1 = Новый Структура;
	Е1.Вставить("ПервыйБайт",4);
	Е1.Вставить("Буфер", ЧТ.ПрочитатьВБуферДвоичныхДанных());	
	Е1.Вставить("Длина",Е1.Буфер.Размер);

	Д2 = Новый Структура;
	Д2.Вставить("ПервыйБайт",160);
	Д2.Вставить("Длина",РазмерКонтейтера(Е1));
	
	Г3.Длина = РазмерКонтейтера(Д1)+РазмерКонтейтера(Д2);
	В1.Длина = РазмерКонтейтера(Г1)+РазмерКонтейтера(Г2)+РазмерКонтейтера(Г3)+РазмерКонтейтера(Г4)+РазмерКонтейтера(Г5);
	Б2.Длина = РазмерКонтейтера(В1);
	А1.Длина = РазмерКонтейтера(Б1)+РазмерКонтейтера(Б2);
	
	Поток = Новый ПотокВПамяти();
	
	ЗаписатьЭлемент(А1,Поток,Истина);
	ЗаписатьЭлемент(Б1,Поток,Ложь);
	ЗаписатьЭлемент(Б2,Поток,Истина);
	ЗаписатьЭлемент(В1,Поток,Истина);
	ЗаписатьЭлемент(Г1,Поток,Ложь);
	ЗаписатьЭлемент(Г2,Поток,Ложь);
	ЗаписатьЭлемент(Г3,Поток,Истина);
	ЗаписатьЭлемент(Д1,Поток,Ложь);
	ЗаписатьЭлемент(Д2,Поток,Истина);
	ЗаписатьЭлемент(Е1,Поток,Ложь);
	ЗаписатьЭлемент(Г4,Поток,Ложь);
	ЗаписатьЭлемент(Г5,Поток,Ложь);

	Возврат Поток.ЗакрытьИПолучитьДвоичныеДанные();
КонецФункции

#КонецОбласти

#КонецОбласти

#Область Интеграция1С

&НаСервере
Функция ПолучитьИдентификаторЭДОИз1СПоСсылке(Ссылка) Экспорт
	
	СтруктураХранения1С = ПолучитьСтруктуруХранения1С();
	СвойствоИдентификатор = СтруктураХранения1С.СвойствоИдентификаторУчастника;
	
	Если СвойствоИдентификатор = Неопределено Тогда
		Сообщение = Новый СообщениеПользователю();
		Сообщение.Текст = "Не удалось определить дополнительное свойство для хранения идентификатора участника ЭДО. Отправка невозморжна.";
		Сообщение.Сообщить();
		Возврат Неопределено;
	КонецЕсли;
		
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
	|	ДополнительныеСведения.Значение КАК Идентификатор
	|ИЗ
	|	РегистрСведений."+СтруктураХранения1С.НаименованиеРегистра+ " КАК ДополнительныеСведения
	|ГДЕ
	|	ДополнительныеСведения.Свойство.Наименование = &НаименованиеСвойства
	|	И ДополнительныеСведения.Объект = &Ссылка";	
	Запрос.УстановитьПараметр("НаименованиеСвойства", СвойствоИдентификатор.Наименование);
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	Результат = Запрос.Выполнить();
	Если НЕ Результат.Пустой() Тогда
		Результат = Результат.Выбрать();
		Результат.Следующий();
		Возврат Результат.Идентификатор;
	Иначе
		Возврат "";
	КонецЕсли;	
		
КонецФункции

// Процедура для записи обновленных идентификаторов участников ЭДО
&НаСервере
Процедура ОбновитьИдентификаторыУчастниковЭДОНаСервере(СписокУчастников)
	
	Адрес = ЭтаФорма.АдресВременногоХранилищаКэш;
	
	ИмяМетаданных = "Конфигурация";
	Кэш = ПолучитьИзВременногоХранилища(Адрес);    
	
	Если Кэш.НастройкиОбъект[Кэш.ПрефиксКонфигурации+ИмяМетаданных] = Неопределено Тогда				
		ИнициализацияКэш(Истина);
		Кэш = ПолучитьИзВременногоХранилища(Адрес);		
	КонецЕсли;
	
	Настройка = Кэш.НастройкиОбъект[Кэш.ПрефиксКонфигурации+ИмяМетаданных].ХранениеИнформации1С;
	
	СтрокаВызоваСвойство 	= 	Настройка.ОФД_ЭДО_ИдентификаторУчастникаЭДО.ТипОбъектаМетаданных + "." + 
	Настройка.ОФД_ЭДО_ИдентификаторУчастникаЭДО.Путь + ".НайтиПоНаименованию(" + Символ(034) + 
	Настройка.ОФД_ЭДО_ИдентификаторУчастникаЭДО.Наименование + Символ(034) + ")";
	
	СвойствоСсылка = Вычислить(СтрокаВызоваСвойство);
	Если ЗначениеЗаполнено(СвойствоСсылка) Тогда
		
		Для Каждого Участник из СписокУчастников Цикл
			
			// Если контрагент не найден в ЭДО, то оставляем идентификатор, созданный вручную
			Если Участник.Идентификатор = "" Тогда  				
				Продолжить;				
			КонецЕсли;    			
			
			РегистрСведений 	= РегистрыСведений[Настройка.Путь];
			МенеджерЗаписи 		= РегистрСведений.СоздатьМенеджерЗаписи();
			
			МенеджерЗаписи.Объект	= Участник.Ссылка;
			МенеджерЗаписи.Свойство	= СвойствоСсылка;
			МенеджерЗаписи.Прочитать();
			
			Если МенеджерЗаписи.Выбран() Тогда
				
				Если МенеджерЗаписи.Значение <> Участник.Идентификатор Тогда
					МенеджерЗаписи.Значение = Участник.Идентификатор;				
					МенеджерЗаписи.Записать();
				КонецЕсли;
				
			Иначе
				
				МенеджерЗаписи.Объект	= Участник.Ссылка;
				МенеджерЗаписи.Свойство	= СвойствоСсылка;
				МенеджерЗаписи.Значение = Участник.Идентификатор;				
				МенеджерЗаписи.Записать();
				
			КонецЕсли;
			
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = "Идентификатор участника "+Участник.Ссылка+"("+Участник.ИНН+"/"+?(НЕ Участник.КПП = "", Участник.КПП, "без КПП")+") обновлен: "+Участник.Идентификатор;
			Сообщение.Сообщить();
			
		КонецЦикла;	
	Иначе 
		
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Возникла ошибка при обновлении идентификаторов контрагентов/организаций - не найдено свойство для хранения идентификаторов в 1С";
		Сообщение.Сообщить();
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область KeycloakВзаимодействие

&НаКлиенте
Функция RefreshTokens(RefreshToken)
	
	scope = "openid+groups+organization%3Aorg+upid+organization%3Aorg.write+profile+email";
	
	//scope = "openid+profile+email";
	
	СтрокаПараметров = "grant_type=refresh_token&client_id=1c-sso&refresh_token="+RefreshToken+"&scope="+scope;
		
	headers = Новый Соответствие;
	headers.Вставить("Content-Type", "application/x-www-form-urlencoded");
	
	HTTPСоединение = Новый HTTPСоединение(""+ВедущийФрагментАдресаKeycloak+".platformaofd.ru", 443 ,,,, 15, Новый ЗащищенноеСоединениеOpenSSL);
	СтрокаЗапроса = "realms/"+realmФрагментАдресаKeycloak+"/protocol/openid-connect/token";
	
	Запрос = Новый HTTPЗапрос(СтрокаЗапроса, headers);
	
	Запрос.УстановитьТелоИзСтроки(СтрокаПараметров, КодировкаТекста.UTF8, ИспользованиеByteOrderMark.НеИспользовать);
	
	HTTPОтвет = HTTPСоединение.ОтправитьДляОбработки(Запрос);
	
	Если HTTPОтвет.КодСостояния = 200 Тогда
		Ответ = HTTPОтвет.ПолучитьТелоКакСтроку();
		Ответ = СтрЗаменить(Ответ, "not-before-policy", "not_before_policy");
		ЧтениеJSON = новый ЧтениеJSON();
		ЧтениеJSON.УстановитьСтроку(Ответ);
		Tokens = ПрочитатьJSON(ЧтениеJSON, Ложь);
		Возврат Tokens;
	 Иначе
		Сообщить("Произошла ошибка обращения к серверу," + "Токен не получен" +
				Символы.ПС + "Статус ответа сервера: " + HTTPОтвет.КодСостояния);
		Возврат Неопределено;
	КонецЕсли;
	
КонецФункции

#КонецОбласти
