#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	СписокНастроек = ХранилищеОбщихНастроек.Загрузить("ОФД_ЭДО_ПриоритетИдентификаторов",
	"СписокПриоритетов",
	"Список приоритетности операторов ЭДО",
	ПолучитьТекущегоПользователя());
	
	Если СписокНастроек = Неопределено тогда
		СписокНастроек = СписокПриоритетаПоУмолчанию();
	КонецЕсли;
	
	Для каждого Строка из СписокНастроек цикл
		
		ПриоритетИдентификаторов.Добавить(Строка.Значение, Строка.Представление);
		
	КонецЦикла;

КонецПроцедуры

#Область ОбработчикиСобытийСписка

&НаКлиенте
Процедура ПриоритетИдентификаторовПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	
	ПараметрыОткрытияФормы = Новый Структура;
	ПараметрыОткрытияФормы.Вставить("ЭтоСозданиеЭлемента", Истина);
	ПараметрыОткрытияФормы.Вставить("ТекущийЭлемент", Элемент);
	
	Оповещение = Новый ОписаниеОповещения("ДобавитьЭлементСписка", ЭтаФорма);
	ОткрытьФорму("ВнешняяОбработка.ОФД_ЭДО.Форма.ФормаДобавленияОператора",,ЭтаФорма,,,,Оповещение, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца); 
	
	Отказ = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьЭлементСписка(ПараметрыЗакрытия, ДопПараметрыЗакрытия) Экспорт
 	
	Если НЕ ПараметрыЗакрытия = Неопределено тогда
		Если ПараметрыЗакрытия.Идентификатор <> "" И ПараметрыЗакрытия.Представление <> "" тогда
			ПриоритетИдентификаторов.Добавить(ПараметрыЗакрытия.Идентификатор, ПараметрыЗакрытия.Представление);
		КонецЕсли;
	КонецЕсли
	
КонецПроцедуры


#КонецОбласти

#КонецОбласти


#Область КнопкаЗакрытьССохранением

&НаСервере
Процедура ЗакрытьССохранениемСервер()

	СписокДляСохранения = Новый СписокЗначений;
	
	Для каждого Элемент из ПриоритетИдентификаторов цикл	
		СписокДляСохранения.Добавить(Элемент.Значение, Элемент.Представление);
	КонецЦикла;
	
	ХранилищеОбщихНастроек.Сохранить("ОФД_ЭДО_ПриоритетИдентификаторов",
	"СписокПриоритетов",
	СписокДляСохранения,
	"Список приоритетности операторов ЭДО",
	ПолучитьТекущегоПользователя());
	
КонецПроцедуры

&НаКлиенте
Процедура ЗакрытьССохранением(Команда)
	
	ЗакрытьССохранениемСервер();
	ЭтаФорма.Закрыть();
	
КонецПроцедуры

#КонецОбласти

#Область КнопкаВосстановитьПоУмолчанию
//Добавить диалог подтверждения
&НаСервере
Процедура ВосстановитьПоУмолчаниюНаСервере()
	
	СписокПриоритета = СписокПриоритетаПоУмолчанию();
	
	ПриоритетИдентификаторов.Очистить();
	
	Для каждого Строка из СписокПриоритета цикл
		ПриоритетИдентификаторов.Добавить(Строка.Значение, Строка.Представление);
	КонецЦикла
	
КонецПроцедуры

&НаКлиенте
Процедура ВосстановитьПоУмолчанию(Команда)
	ВосстановитьПоУмолчаниюНаСервере();
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Функция СписокПриоритетаПоУмолчанию()
	
	ПриоритетИдентификаторовСписок = Новый СписокЗначений;
		
	ОбработкаОбъект = РеквизитФормыВЗначение("Объект");
	
	Макет = ОбработкаОбъект.ПолучитьМакет("СлужебныеДанные"); 
	
	Построитель = Новый ПостроительЗапроса;
	Построитель.ИсточникДанных = Новый ОписаниеИсточникаДанных(Макет.Область());
    Построитель.ДобавлениеПредставлений = ТипДобавленияПредставлений.НеДобавлять;
    Построитель.ЗаполнитьНастройки();
    Построитель.Выполнить();
	
	ТЗ = Построитель.Результат.Выгрузить(); 
	
	Для каждого Строка из ТЗ цикл
		ПриоритетИдентификаторовСписок.Добавить(Строка.Идентификатор, Строка.Представление);
	КонецЦикла;
	
	Возврат ПриоритетИдентификаторовСписок;
	
КонецФункции	

&НаСервереБезКонтекста
Функция ПолучитьТекущегоПользователя()
	
	Возврат Неопределено;
	
	Если НЕ Метаданные.ОбщиеМодули.Найти("ПользователиИнформационнойБазы") = Неопределено Тогда
		ТекущийПользователь = ПользователиИнформационнойБазы.ТекущийПользователь();
	Иначе
		ТекущийПользователь = ПользователиКлиентСервер.ТекущийПользователь();
	КонецЕсли;	
	
	Возврат ТекущийПользователь;
	
КонецФункции

#КонецОбласти
