&НаКлиенте
Перем АвторизацияУспешна;

#Область СобытияФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	Если Параметры.Свойство("Организация") Тогда
		Организация = Параметры.Организация;
	КонецЕсли;
	Если Параметры.Свойство("ПорядковыйНомерГруппы") Тогда
		ПорядковыйНомерГруппы = Параметры.ПорядковыйНомерГруппы;
	КонецЕсли;
	
	ОпределитьИспользованиеТестовогоКонтура();
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)

	ВедущийФрагментАдресаKeycloak = ?(Объект.ЭтоТестоваяОбработка = Истина, "oauth-test", "oauth");
	realmФрагментАдресаKeycloak = ?(Объект.ЭтоТестоваяОбработка = Истина, "playground", "production");
	
	ЗаполнитьТекущегоПользователя();
	
	Адрес = АдресСтраницыАутентификации();
	
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии(ЗавершениеРаботы)
	
	СтруктураПараметров = Новый Структура;
	СтруктураПараметров.Вставить("АвторизацияУспешна", АвторизацияУспешна);
	СтруктураПараметров.Вставить("Организация", Организация);
	СтруктураПараметров.Вставить("ПорядковыйНомерГруппы", ПорядковыйНомерГруппы);
	СтруктураПараметров.Вставить("AccessToken", AccessToken);
	СтруктураПараметров.Вставить("RefreshToken", RefreshToken);
	
	ОповеститьОВыборе(СтруктураПараметров);
	
КонецПроцедуры

#КонецОбласти

#Область СобытияЭлементовФормы

&НаКлиенте
Процедура ПолеHTMLДокументСформирован(Элемент)
		
	Адрес = Элемент.Документ.URL;
	Если НЕ СтрНайти(Адрес, "&code=") = 0 ИЛИ НЕ СтрНайти(Адрес, "?code=") = 0 Тогда
		
		AuthCode = ВыделитьAuthCode(Адрес);
		ОбработатьAccessToken(AuthCode);
		
	Иначе
		
		body = Элемент.Документ.getElementsByTagName("body")[0];
		
		Док = Элемент.Документ;
				
		Скрипт = Док.createElement("script");
		Скрипт.text = ПолучитьТекстСкрипта();	
		body.appendChild(Скрипт);		
		
	КонецЕсли;

КонецПроцедуры

&НаСервере
Функция ПолучитьТекстСкрипта()
	
	ОбработкаОбъект = РеквизитФормыВЗначение("Объект");
	Макет = ОбработкаОбъект.ПолучитьМакет("СкриптОтображенияФормыАвторизации");
	
	Возврат Макет.ПолучитьТекст();
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыФункции

&НаСервере
Процедура ЗаполнитьТекущегоПользователя()
	
	Если НЕ Метаданные.ОбщиеМодули.Найти("ПользователиИнформационнойБазы") = Неопределено Тогда
		ТекущийПользователь = ПользователиИнформационнойБазы.ТекущийПользователь();
	Иначе
		ТекущийПользователь = ПользователиКлиентСервер.ТекущийПользователь();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Функция СгенерироватьКодВерификации(ДлинаСтроки)
	
	Результат = "";
	Генератор = Новый ГенераторСлучайныхЧисел;
	
	Для Счетчик = 1 по ДлинаСтроки Цикл
		СлучайноеЧисло = Генератор.СлучайноеЧисло(0, 35);
		Если СлучайноеЧисло<10 Тогда
			Результат = Результат + СлучайноеЧисло;
		Иначе
			Результат = Результат + Символ(55 + СлучайноеЧисло);
		КонецЕсли;
	КонецЦикла;
	
	Возврат Результат;	
	
КонецФункции	

&НаСервере
Функция СформироватьАдрес(Знач URL, Знач ПараметрыURL)
	
	Перем МассивПараметров;
	МассивПараметров = Новый Массив;
	Для каждого Параметр Из ПараметрыURL Цикл
		МассивПараметров.Добавить(Параметр.Ключ + "=" + Параметр.Значение);
	КонецЦикла;
	URL = СокрП(URL);
	URL = ?(СтрЗаканчиваетсяНа(URL, "/"), URL, URL + "/"); 
	Возврат URL + "?" + КодироватьСтроку(СтрСоединить(МассивПараметров, "&"),	СпособКодированияСтроки.URLВКодировкеURL);

КонецФункции

&НаСервереБезКонтекста
Функция КодироватьBase64СтрокуВСтрокуURLНаСервере(ЭлектроннаяПодписьBase64)

	Возврат КодироватьСтроку(ЭлектроннаяПодписьBase64, СпособКодированияСтроки.КодировкаURL);
	
КонецФункции

&НаСервереБезКонтекста
Функция Хешировать_SHA256(Значение)

	Хэш = Новый ХешированиеДанных(ХешФункция.SHA256); // ХешФункция.SHA256);
	Хэш.Добавить(Значение);
	Возврат Хэш.ХешСумма;
	
КонецФункции

&НаСервере
Процедура ОпределитьИспользованиеТестовогоКонтура()

	Объект.ЭтоТестоваяОбработка = ХранилищеОбщихНастроек.Загрузить("ОФД_ЭДО_НастройкиОбработки", 	// Ключ объекта
				"ЭтоТестовыйКонтур",																// Ключ настройки 
				"Служебный параметр, определяющий соединение с тестовым контуром", 					// описание настройки
				ПолучитьТекущегоПользователя());
				
				
	Если Объект.ЭтоТестоваяОбработка = Неопределено тогда
		
		Объект.ЭтоТестоваяОбработка = Ложь;
		
	КонецЕсли; 
		
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьТекущегоПользователя()
	
	Возврат Неопределено;
	
КонецФункции

#КонецОбласти

#Область KeycloakВзаимодействие

&НаКлиенте
Функция АдресСтраницыАутентификации()
	
	code_verifier = СгенерироватьКодВерификации(43);
	
	code_challenge_хеш = Хешировать_SHA256(code_verifier);
	
	code_challenge = Base64Строка(code_challenge_хеш);
	code_challenge = СтрЗаменить(code_challenge, Символы.ПС, "");
	code_challenge = СтрЗаменить(code_challenge, Символы.ВК, "");
	code_challenge = СтрЗаменить(code_challenge, "=", "");
	code_challenge = СтрЗаменить(code_challenge, "+", "-");
	code_challenge = СтрЗаменить(code_challenge, "/", "_");
	code_challenge = КодироватьBase64СтрокуВСтрокуURLНаСервере(code_challenge); 
	
	ПараметрыURL = Новый Структура;
	Адрес = "https://"+ВедущийФрагментАдресаKeycloak+".platformaofd.ru/realms/"+realmФрагментАдресаKeycloak+"/protocol/openid-connect/auth";
	ПараметрыURL.Вставить("client_id", "1c-sso");
	ПараметрыURL.Вставить("redirect_uri", "localhost");
	ПараметрыURL.Вставить("scope", "openid+offline_access");
	ПараметрыURL.Вставить("response_type", "code");
	ПараметрыURL.Вставить("code_challenge_method", "S256");
	ПараметрыURL.Вставить("code_challenge", code_challenge);
	ПараметрыURL.Вставить("prompt", "login");
	
	Возврат СформироватьАдрес(Адрес, ПараметрыURL);

КонецФункции

&НаКлиенте
Функция ВыделитьAuthCode(URL)
	
	НачалоКода = СтрНайти(ВРЕГ(URL), ВРЕГ("code="), НаправлениеПоиска.СНачала);
	Если НачалоКода = 0 Тогда
		Возврат "";
	КонецЕсли;
	НачалоКода = НачалоКода + 5;
	КонецКода = СтрДлина(URL)+1; 
	Возврат Сред(URL, НачалоКода, КонецКода - НачалоКода);
	
КонецФункции

&НаКлиенте
Процедура ОбработатьAccessToken(AuthCode) Экспорт

	Если AuthCode <> Неопределено И Не ПустаяСтрока(AuthCode) Тогда
		Tokens = Tokens(AuthCode);
		Если НЕ Tokens = Неопределено Тогда 
			AccessToken = AccessToken(Tokens);
			RefreshToken = ?(RefreshToken(Tokens) = Неопределено, RefreshToken, RefreshToken(Tokens));
			АвторизацияУспешна = Истина;
			Оповещение = Новый ОписаниеОповещения("ПослеЗакрытияОповещенияОбУспешнойАвторизации", ЭтотОбъект);
			ПоказатьВопрос(Оповещение, "Авторизация выполнена", РежимДиалогаВопрос.ОК);    
		КонецЕсли;
	Иначе
		Сообщить("Авторизация не выполнена."+Символы.ПС+"Проверьте корректность логина/пароля.");
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ПослеЗакрытияОповещенияОбУспешнойАвторизации(Результат, Параметры) Экспорт

	// Авторизация выполнена, все молодцы.
	ЭтаФорма.Закрыть();
	
КонецПроцедуры

&НаКлиенте
Функция Tokens(AuthCode)
	
	СтрокаПараметров = "grant_type=authorization_code&client_id=1c-sso&redirect_uri=localhost&code="+AuthCode+"&code_verifier="+code_verifier;
		
	headers = Новый Соответствие;
	headers.Вставить("Content-Type", "application/x-www-form-urlencoded");
	
	HTTPСоединение = Новый HTTPСоединение(""+ВедущийФрагментАдресаKeycloak+".platformaofd.ru", 443 ,,,, 15, Новый ЗащищенноеСоединениеOpenSSL);
	СтрокаЗапроса = "realms/"+realmФрагментАдресаKeycloak+"/protocol/openid-connect/token";
	
	Запрос = Новый HTTPЗапрос(СтрокаЗапроса, headers);
	
	Запрос.УстановитьТелоИзСтроки(СтрокаПараметров, КодировкаТекста.UTF8, ИспользованиеByteOrderMark.НеИспользовать);
		
	HTTPОтвет = HTTPСоединение.ОтправитьДляОбработки(Запрос);
	
	Если HTTPОтвет.КодСостояния = 200 Тогда
		Ответ = HTTPОтвет.ПолучитьТелоКакСтроку(); 
		Ответ = СтрЗаменить(Ответ, "not-before-policy", "not_before_policy");
		ЧтениеJSON = Новый ЧтениеJSON();
		ЧтениеJSON.УстановитьСтроку(Ответ);
		Tokens = ПрочитатьJSON(ЧтениеJSON, Ложь);
		Возврат Tokens;
	Иначе
		Сообщить("Произошла ошибка обращения к серверу," + "Токен не получен" +
		 		Символы.ПС + "Статус ответа сервера: " + HTTPОтвет.КодСостояния);
		Возврат Неопределено;	
	КонецЕсли;
	
КонецФункции

&НаКлиенте
Функция AccessToken(Tokens)
	
	Если типЗнч(Tokens ) = Тип("Структура") Тогда
		Возврат Tokens.access_token;
	Иначе
		Возврат Неопределено;
	КонецЕсли;
	
КонецФункции

&НаКлиенте
Функция RefreshToken(Tokens)

	Если Tokens.Свойство("refresh_token") Тогда
		Возврат Tokens.refresh_token;
	Иначе
		Возврат Неопределено;
	КонецЕсли;

КонецФункции

#КонецОбласти

АвторизацияУспешна = Ложь;
