
#Область СобытияФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	АдресВременногоХранилищаКэш = Параметры.АдресВременногоХранилищаКэш;
	ПутьКФайлуЗагружаемогоДокумента = Параметры.ПутьКФайлуЗагружаемогоДокумента;
	ФорматЗагружаемогоЕдиничногоДокумента = Параметры.ФорматЗагружаемогоДокумента;
	ПрефиксКонфигурации = Параметры.ПрефиксКонфигурации;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ИнициализацияКэш();
	
	ЭтаФорма.ПараметрыЗагрузкиНоменклатуры = Новый Структура;
	
	ЗарузкаЕдиничногоДокумента_ПоискИСопоставлениеНоменклатуры();
	
КонецПроцедуры

&НаКлиенте
Процедура ЗарузкаЕдиничногоДокумента_ПоискИСопоставлениеНоменклатуры()
	
	ФайлДокументаДвоичныеДанные	= Новый ДвоичныеДанные(ПутьКФайлуЗагружаемогоДокумента);
	
	ЗагруженныйДокумент = Неопределено;
	
	СписокОбъектовПриемников = ПередЗагрузкой_ПодготовкаНаСервере(ФайлДокументаДвоичныеДанные);
		
	Если НЕ СписокОбъектовПриемников = Неопределено И СписокОбъектовПриемников.Количество() >= 2 Тогда
		Оповещение = Новый ОписаниеОповещения("ОповещениеПослеВыбораОбъектаПриемникаЗагружаемогоДокумента", ЭтотОбъект, ФайлДокументаДвоичныеДанные);
		ПоказатьВыборИзСписка(Оповещение, СписокОбъектовПриемников);
	ИначеЕсли НЕ СписокОбъектовПриемников = Неопределено И СписокОбъектовПриемников.Количество() = 1 Тогда
		ВариантПриемникаЗагрузкиЕдиничногоДокумента = СписокОбъектовПриемников[0].Значение;
		Если ТребуетсяСопоставлениеТоваров = Истина Тогда
			Элементы.ТаблицаСопоставленияНоменклатуры.Доступность = Истина;
			ПередЗагрузкой_ПрочитатьДанныеОТоварахНаСервере(ФайлДокументаДвоичныеДанные, ФорматЗагружаемогоЕдиничногоДокумента, ВариантПриемникаЗагрузкиЕдиничногоДокумента);
		КонецЕсли;
	Иначе	
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Не удалось определить список объектов приемников для загружаемого документа.";
		Сообщение.Сообщить();
		ЭтаФорма.Закрыть();
	КонецЕсли;
	
	Если ЭтаФорма.ТаблицаСопоставленияНоменклатуры.Количество() > 0 И НЕ ЭтаФорма.ИспользованияХранениеРезультатовСопоставленияВИБ Тогда
		ЗагрузитьИзПамятиТаблицуТоваровНаСервере(ФорматЗагружаемогоЕдиничногоДокумента);	
	КонецЕсли;	
		
КонецПроцедуры

&НаКлиенте
Процедура ОповещениеПослеВыбораОбъектаПриемникаЗагружаемогоДокумента(Результат, ФайлДокументаДвоичныеДанные) Экспорт

	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ВариантПриемникаЗагрузкиЕдиничногоДокумента = Результат.Значение;
	
	Если ТребуетсяСопоставлениеТоваров = Истина Тогда
		Элементы.ТаблицаСопоставленияНоменклатуры.Доступность = Истина;
		ПередЗагрузкой_ПрочитатьДанныеОТоварахНаСервере(ФайлДокументаДвоичныеДанные, ФорматЗагружаемогоЕдиничногоДокумента, ВариантПриемникаЗагрузкиЕдиничногоДокумента);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗарузкаЕдиничногоДокумента(Команда)
	
	ФайлДокументаДвоичныеДанные	= Новый ДвоичныеДанные(ПутьКФайлуЗагружаемогоДокумента);
	ЗагружаемыйФормат = ФорматЗагружаемогоЕдиничногоДокумента;
	ВариантПриемникаЗагрузки = ВариантПриемникаЗагрузкиЕдиничногоДокумента;
	
	Если ТребуетсяСопоставлениеТоваров = Истина Тогда
		ОтборСтрокБезСопоставления = Новый Структура;
		ОтборСтрокБезСопоставления.Вставить("Номенклатура", ПредопределенноеЗначение("Справочник.Номенклатура.ПустаяСсылка"));
		СтрокиБезСопоставления = ЭтаФорма.ТаблицаСопоставленияНоменклатуры.НайтиСтроки(ОтборСтрокБезСопоставления);
	КонецЕсли;
	
	Если ТребуетсяСопоставлениеТоваров = Истина И СтрокиБезСопоставления.Количество()>0 Тогда
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Не все товарные позиции сопоставлены с номенклатурой в ИБ, документ не может быть загружен.";
		Сообщение.Сообщить();
	Иначе	
		ЗагруженныйДокумент = СформироватьЕдиничныйДокументПодготовкаНаСервере(ФайлДокументаДвоичныеДанные, ЗагружаемыйФормат, ВариантПриемникаЗагрузки);
	КонецЕсли;
	
	Если НЕ ЗагруженныйДокумент = Неопределено Тогда
		ПоказатьЗначение(, ЗагруженныйДокумент);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаСопоставленияНоменклатурыПередУдалением(Элемент, Отказ)
	
	Отказ = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура ИспользованияХранениеРезультатовПоискаВИБПриИзменении(Элемент)
	
	Если ИспользованияХранениеРезультатовСопоставленияВИБ Тогда
		Элементы.СохранитьТаблицуТоваров.Доступность = Ложь;
		Элементы.ЗагрузитьИзПамятиТаблицуТоваров.Доступность = Ложь;
		Элементы.ТекстОписаниеХраненияРезультатовВИБ.Видимость = Истина;
		Элементы.ТаблицаСопоставленияНоменклатурыНоменклатура.ТолькоПросмотр = Истина;
		Элементы.ТаблицаСопоставленияНоменклатурыНоменклатура.ТолькоПросмотр = Ложь;
		Если НЕ Элементы.Найти("ТаблицаСопоставленияНоменклатурыСсылкаНаХранениеРезультатовПоиска") = Неопределено Тогда
			Элементы.ТаблицаСопоставленияНоменклатурыСсылкаНаХранениеРезультатовПоиска.Видимость = Истина;
			Элементы.ТаблицаСопоставленияНоменклатурыНоменклатура.ТолькоПросмотр = Истина;
		КонецЕсли;
	Иначе
		Элементы.СохранитьТаблицуТоваров.Доступность = Истина;
		Элементы.ЗагрузитьИзПамятиТаблицуТоваров.Доступность = Истина;
		Элементы.ТекстОписаниеХраненияРезультатовВИБ.Видимость = Ложь;
		Элементы.ТаблицаСопоставленияНоменклатурыНоменклатура.ТолькоПросмотр = Ложь;
		Элементы.ТаблицаСопоставленияНоменклатурыНоменклатура.ТолькоПросмотр = Истина;
		Если НЕ Элементы.Найти("ТаблицаСопоставленияНоменклатурыСсылкаНаХранениеРезультатовПоиска") = Неопределено Тогда
			Элементы.ТаблицаСопоставленияНоменклатурыСсылкаНаХранениеРезультатовПоиска.Видимость = Ложь;
			Элементы.ТаблицаСопоставленияНоменклатурыНоменклатура.ТолькоПросмотр = Ложь;
		КонецЕсли;	
	КонецЕсли;
	
	ЗарузкаЕдиничногоДокумента_ПоискИСопоставлениеНоменклатуры();
	
КонецПроцедуры

&НаКлиенте
Процедура ПередВыборомСсылкиНаХранениеРезультатовПоиска(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	//Если Элементы.ТаблицаСопоставленияНоменклатуры.ТекущиеДанные.Свойство("СсылкаНаХранениеРезультатовПоиска") Тогда
	//	Если НЕ ТипЗнч(Элементы.ТаблицаСопоставленияНоменклатуры.ТекущиеДанные.СсылкаНаХранениеРезультатовПоиска) = Тип("Строка") И НЕ Элементы.ТаблицаСопоставленияНоменклатуры.ТекущиеДанные.СсылкаНаХранениеРезультатовПоиска.Пустая() Тогда
	//		СтандартнаяОбработка = Ложь;
	//		Отказ = Истина;
	//		Оповещение = Новый ОписаниеОповещения("ОтветНаВопросЗаменыРезультатаПоиска", ЭтотОбъект);
	//		ПоказатьВопрос(Оповещение, "Вы уверены, что хотите изменить найденный результат сопоставления? (не рекомендуется)", РежимДиалогаВопрос.ДаНет, 0, КодВозвратаДиалога.Нет);	
	//	Иначе
	//		СтандартнаяОбработка = Ложь;
	//		Отказ = Истина;
	//		Оповещение = Новый ОписаниеОповещения("ОтветНаВопросСозданияИлиВыбораСопоставления", ЭтотОбъект);
	//		СписокКнопок = Новый СписокЗначений;
	//		СписокКнопок.Добавить("Создать", "Создать новое");
	//		СписокКнопок.Добавить("Выбрать", "Выбрать из существующих");
	//		СписокКнопок.Добавить("Отмена", "Отмена");
	//		ПоказатьВопрос(Оповещение, "Создать новое сопоставление или выбрать из существующих?", СписокКнопок, 0, "Создать");	
	//	КонецЕсли;	
	//КонецЕсли;
	
	ПараметрыСоздания = Новый Структура("РежимВыбора", Истина);
	ОбработкаЗакрытия = Новый ОписаниеОповещения("ПриЗакрытииФормыНовогоЭлементаХраненияРезультатовПоиска", ЭтаФорма);
	ФормаНовогоТовараПоставщика = ОткрытьФорму("Справочник."+ПараметрыЗагрузкиНоменклатуры.ОбъектХраненияНоменклатурыПоставщиков+".ФормаОбъекта", ПараметрыСоздания, ЭтаФорма, , , , ОбработкаЗакрытия);
	
	Если Элементы.ТаблицаСопоставленияНоменклатуры.ТекущиеДанные.Свойство("ПартнерПоПоставщикуТовара") Тогда
		ПоставщикТовара = Элементы.ТаблицаСопоставленияНоменклатуры.ТекущиеДанные.ПартнерПоПоставщикуТовара;
	Иначе
		ПоставщикТовара = Элементы.ТаблицаСопоставленияНоменклатуры.ТекущиеДанные.ПоставщикПоДокументу;
	КонецЕсли;
	
	ФормаНовогоТовараПоставщика.Объект[ПараметрыЗагрузкиНоменклатуры.ИмяРеквизитаОбъектаХраненияДляОпределенияПоставщикаТовара] = ПоставщикТовара;
	ФормаНовогоТовараПоставщика.Объект.Наименование = Элементы.ТаблицаСопоставленияНоменклатуры.ТекущиеДанные.НаименованиеИзДокумента; 
	
	Если ФормаНовогоТовараПоставщика.Объект.Свойство("КодНоменклатуры") тогда
		ФормаНовогоТовараПоставщика.Объект.КодНоменклатуры = Элементы.ТаблицаСопоставленияНоменклатуры.ТекущиеДанные.КодТовараИзДокумента;
	КонецЕсли;
	
	Если ФормаНовогоТовараПоставщика.Объект.Свойство("Идентификатор") тогда
		ФормаНовогоТовараПоставщика.Объект.Идентификатор = Элементы.ТаблицаСопоставленияНоменклатуры.ТекущиеДанные.КодТовараИзДокумента;
	КонецЕсли;
	
	ФормаНовогоТовараПоставщика.Объект.Артикул = Элементы.ТаблицаСопоставленияНоменклатуры.ТекущиеДанные.АртикулТовараИзДокумента;
	
	Если НЕ ФормаНовогоТовараПоставщика.Объект.Свойство("НаименованиеНоменклатуры") = Неопределено И НЕ ФормаНовогоТовараПоставщика.Объект.Свойство("НаименованиеНоменклатуры") = Ложь Тогда
		ФормаНовогоТовараПоставщика.Объект.НаименованиеНоменклатуры = Элементы.ТаблицаСопоставленияНоменклатуры.ТекущиеДанные.НаименованиеИзДокумента;
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ОтветНаВопросЗаменыРезультатаПоиска(Результат, Параметры) Экспорт

	Если Результат = КодВозвратаДиалога.Да Тогда
		ПараметрыВыбора = Новый Структура("РежимВыбора", Истина);	
		ПараметрыОтбора = Новый Структура;
		Если Элементы.ТаблицаСопоставленияНоменклатуры.ТекущиеДанные.Свойство("ПартнерПоПоставщикуТовара") Тогда
			ПараметрыОтбора.Вставить(ПараметрыЗагрузкиНоменклатуры.ИмяРеквизитаОбъектаХраненияДляОпределенияПоставщикаТовара, Элементы.ТаблицаСопоставленияНоменклатуры.ТекущиеДанные.ПартнерПоПоставщикуТовара);
		Иначе
			ПараметрыОтбора.Вставить(ПараметрыЗагрузкиНоменклатуры.ИмяРеквизитаОбъектаХраненияДляОпределенияПоставщикаТовара, Элементы.ТаблицаСопоставленияНоменклатуры.ТекущиеДанные.ПоставщикПоДокументу);
		КонецЕсли;
		ПараметрыВыбора.Вставить("Отбор", ПараметрыОтбора);
		ОбработкаВыбора = Новый ОписаниеОповещения("ПриЗакрытииФормыВыбораСсылкиНаХранениеРезультатовПоиска", ЭтаФорма);
		ОткрытьФорму("Справочник.НоменклатураПоставщиков.ФормаВыбора", ПараметрыВыбора, ЭтаФорма, , , , ОбработкаВыбора);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОтветНаВопросСозданияИлиВыбораСопоставления(Результат, Параметры) Экспорт
	
	Если Результат = "Отмена" Тогда
		
		Возврат;
		
	ИначеЕсли Результат = "Создать" Тогда 
		
		ПараметрыСоздания = Новый Структура("РежимВыбора", Истина);	
		ОбработкаЗакрытия = Новый ОписаниеОповещения("ПриЗакрытииФормыНовогоЭлементаХраненияРезультатовПоиска", ЭтаФорма);
		ФормаНовогоТовараПоставщика = ОткрытьФорму("Справочник."+ПараметрыЗагрузкиНоменклатуры.ОбъектХраненияНоменклатурыПоставщиков+".ФормаОбъекта", ПараметрыСоздания, ЭтаФорма, , , , ОбработкаЗакрытия);
		
		Если Элементы.ТаблицаСопоставленияНоменклатуры.ТекущиеДанные.Свойство("ПартнерПоПоставщикуТовара") Тогда
			ПоставщикТовара = Элементы.ТаблицаСопоставленияНоменклатуры.ТекущиеДанные.ПартнерПоПоставщикуТовара;
		Иначе
			ПоставщикТовара = Элементы.ТаблицаСопоставленияНоменклатуры.ТекущиеДанные.ПоставщикПоДокументу;
		КонецЕсли;
		
		ФормаНовогоТовараПоставщика.Объект.Владелец = ПоставщикТовара;
		ФормаНовогоТовараПоставщика.Объект.Наименование = Элементы.ТаблицаСопоставленияНоменклатуры.ТекущиеДанные.НаименованиеИзДокумента;
		ФормаНовогоТовараПоставщика.Объект.НаименованиеНоменклатуры = Элементы.ТаблицаСопоставленияНоменклатуры.ТекущиеДанные.НаименованиеИзДокумента;
		ФормаНовогоТовараПоставщика.Объект.Идентификатор = Элементы.ТаблицаСопоставленияНоменклатуры.ТекущиеДанные.КодТовараИзДокумента;
		ФормаНовогоТовараПоставщика.Объект.Артикул = Элементы.ТаблицаСопоставленияНоменклатуры.ТекущиеДанные.АртикулТовараИзДокумента;	
	
	ИначеЕсли Результат = "Выбрать" Тогда
		
		ПараметрыВыбора = Новый Структура("РежимВыбора", Истина);	
		ПараметрыОтбора = Новый Структура;
		Если Элементы.ТаблицаСопоставленияНоменклатуры.ТекущиеДанные.Свойство("ПартнерПоПоставщикуТовара") Тогда
			ПараметрыОтбора.Вставить(ПараметрыЗагрузкиНоменклатуры.ИмяРеквизитаОбъектаХраненияДляОпределенияПоставщикаТовара, Элементы.ТаблицаСопоставленияНоменклатуры.ТекущиеДанные.ПартнерПоПоставщикуТовара);
		Иначе
			ПараметрыОтбора.Вставить(ПараметрыЗагрузкиНоменклатуры.ИмяРеквизитаОбъектаХраненияДляОпределенияПоставщикаТовара, Элементы.ТаблицаСопоставленияНоменклатуры.ТекущиеДанные.ПоставщикПоДокументу);
		КонецЕсли;
		ПараметрыВыбора.Вставить("Отбор", ПараметрыОтбора);
		ОбработкаВыбора = Новый ОписаниеОповещения("ПриЗакрытииФормыВыбораСсылкиНаХранениеРезультатовПоиска", ЭтаФорма);
		ОткрытьФорму("Справочник."+ПараметрыЗагрузкиНоменклатуры.ОбъектХраненияНоменклатурыПоставщиков+".ФормаВыбора", ПараметрыВыбора, ЭтаФорма, , , , ОбработкаВыбора);
		
	КонецЕсли;	
	
КонецПроцедуры	

&НаКлиенте
Процедура ПриЗакрытииФормыВыбораСсылкиНаХранениеРезультатовПоиска(Значение, ДопПараметры) Экспорт
	
	Если Значение = Неопределено Тогда
        Возврат;
    КонецЕсли;
     
    Элементы.ТаблицаСопоставленияНоменклатуры.ТекущиеДанные.СсылкаНаХранениеРезультатовПоиска = Значение;
	Элементы.ТаблицаСопоставленияНоменклатуры.ТекущиеДанные.Номенклатура = ПолучитьНоменклатуруПоЗаданномуРезультатуПоиска(Элементы.ТаблицаСопоставленияНоменклатуры.ТекущиеДанные.СсылкаНаХранениеРезультатовПоиска);
	
	ЗаполнитьВсеСтрокиТаблицыРезультатомСопоставления();
	
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытииФормыНовогоЭлементаХраненияРезультатовПоиска(Значение, ДопПараметры) Экспорт
	
	// В стандартном коде формы нет формирования параметров закрытия. Приходится просто искать заново.
     
   ЗарузкаЕдиничногоДокумента_ПоискИСопоставлениеНоменклатуры();
	
КонецПроцедуры

&НаСервере
Функция ПолучитьНоменклатуруПоЗаданномуРезультатуПоиска(ЗаданныйРезультатПоиска)
	
	Возврат ЗаданныйРезультатПоиска[ПараметрыЗагрузкиНоменклатуры.ИмяРеквизитаОбъектаХраненияДляОпределенияТовара];	
	
КонецФункции	

&НаКлиенте
Процедура ОбработкаВыбора(ВыбранноеЗначение, ИсточникВыбора)
	
	Если ВыбранноеЗначение = Неопределено Тогда
    	Возврат;
	КонецЕсли;
	
	Если Тип(ИсточникВыбора) = Тип("ФормаКлиентскогоПриложения") Тогда 
		Если ИсточникВыбора.ИмяФормы = "Справочник.НоменклатураПоставщиков.Форма.ФормаЭлемента" Тогда 
			Элементы.ТаблицаСопоставленияНоменклатуры.ТекущиеДанные.СсылкаНаХранениеРезультатовПоиска = ВыбранноеЗначение;
			Элементы.ТаблицаСопоставленияНоменклатуры.ТекущиеДанные.Номенклатура = ПолучитьНоменклатуруПоЗаданномуРезультатуПоиска(Элементы.ТаблицаСопоставленияНоменклатуры.ТекущиеДанные.СсылкаНаХранениеРезультатовПоиска);
		КонецЕсли;
		ЗаполнитьВсеСтрокиТаблицыРезультатомСопоставления();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПередВыборомСсылкиНаНоменклатуру(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	Если Элементы.ТаблицаСопоставленияНоменклатуры.ТекущиеДанные.Свойство("Номенклатура")
		И НЕ Элементы.ТаблицаСопоставленияНоменклатуры.ТекущиеДанные.Номенклатура.Пустая() Тогда
			СтандартнаяОбработка = Ложь;
			Отказ = Истина;
			Оповещение = Новый ОписаниеОповещения("ОтветНаВопросЗаменыНоменклатуры", ЭтотОбъект);
			ПоказатьВопрос(Оповещение, "Вы уверены, что хотите изменить номенклатуру? (не рекомендуется)", РежимДиалогаВопрос.ДаНет, 0, КодВозвратаДиалога.Нет);	
	КонецЕсли;	
	
КонецПроцедуры	

&НаКлиенте
Процедура ОтветНаВопросЗаменыНоменклатуры(Результат, Параметры) Экспорт

	Если Результат = КодВозвратаДиалога.Да Тогда
		ПараметрыВыбора = Новый Структура("РежимВыбора", Истина);
		ОбработкаВыбора = Новый ОписаниеОповещения("ПриЗакрытииФормыВыбораСсылкиНаНоменклатуру", ЭтаФорма);
		ОткрытьФорму("Справочник.Номенклатура.ФормаВыбора", ПараметрыВыбора, ЭтаФорма, , , , ОбработкаВыбора);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытииФормыВыбораСсылкиНаНоменклатуру(Значение, ДопПараметры) Экспорт
	
	Если Значение = Неопределено Тогда
        Возврат;
    КонецЕсли;
     
	Элементы.ТаблицаСопоставленияНоменклатуры.ТекущиеДанные.Номенклатура = Значение;
	
	Элементы.ТаблицаСопоставленияНоменклатуры.ТекущиеДанные.ХарактеристикаНоменклатуры = Неопределено;
	
	ЗаполнитьВсеСтрокиТаблицыРезультатомСопоставления();	
	
КонецПроцедуры	

&НаКлиенте
Процедура ПриИзмененииСсылкиНаНоменклатуру(Элемент)
	
	ЗаполнитьВсеСтрокиТаблицыРезультатомСопоставления();	
	
КонецПроцедуры	

&НаКлиенте
Процедура ЗаполнитьВсеСтрокиТаблицыРезультатомСопоставления()
	
	Для Каждого Строка из ЭтаФорма.ТаблицаСопоставленияНоменклатуры Цикл
		
		Если НЕ Элементы.ТаблицаСопоставленияНоменклатуры.ТекущиеДанные.КодТовараИзДокумента = "" 
			И НЕ Элементы.ТаблицаСопоставленияНоменклатуры.ТекущиеДанные.АртикулТовараИзДокумента = "" Тогда  
			СтрокаСоответствуетИзмененной = Строка.ПоставщикПоДокументу = Элементы.ТаблицаСопоставленияНоменклатуры.ТекущиеДанные.ПоставщикПоДокументу
				И Строка.КодТовараИзДокумента = Элементы.ТаблицаСопоставленияНоменклатуры.ТекущиеДанные.КодТовараИзДокумента
				И Строка.АртикулТовараИзДокумента = Элементы.ТаблицаСопоставленияНоменклатуры.ТекущиеДанные.АртикулТовараИзДокумента;
		Иначе
			СтрокаСоответствуетИзмененной = Строка.ПоставщикПоДокументу = Элементы.ТаблицаСопоставленияНоменклатуры.ТекущиеДанные.ПоставщикПоДокументу
				И Строка.КодТовараИзДокумента = Элементы.ТаблицаСопоставленияНоменклатуры.ТекущиеДанные.НаименованиеИзДокумента;
		КонецЕсли;	
		
		Если СтрокаСоответствуетИзмененной Тогда
			
			Если Элементы.ТаблицаСопоставленияНоменклатуры.ТекущиеДанные.Свойство("СсылкаНаХранениеРезультатовПоиска") Тогда
				Если НЕ Строка.СсылкаНаХранениеРезультатовПоиска = Элементы.ТаблицаСопоставленияНоменклатуры.ТекущиеДанные.СсылкаНаХранениеРезультатовПоиска Тогда 
					Строка.СсылкаНаХранениеРезультатовПоиска = Элементы.ТаблицаСопоставленияНоменклатуры.ТекущиеДанные.СсылкаНаХранениеРезультатовПоиска;
					Строка.Номенклатура = Элементы.ТаблицаСопоставленияНоменклатуры.ТекущиеДанные.Номенклатура;
				КонецЕсли;
			Иначе
				Если НЕ Строка.Номенклатура = Элементы.ТаблицаСопоставленияНоменклатуры.ТекущиеДанные.Номенклатура Тогда	
					Строка.Номенклатура = Элементы.ТаблицаСопоставленияНоменклатуры.ТекущиеДанные.Номенклатура;		
				КонецЕсли;	
			КонецЕсли;
			
		КонецЕсли;	
		
	КонецЦикла	
	
КонецПроцедуры

&НаКлиенте
Процедура СохранитьТаблицуТоваров(Команда)
	
	ФорматЗагружаемогоЕдиничногоДокумента = "ON_NSCHFDOPPR";
	СохранитьТаблицуТоваровНаСервере(ФорматЗагружаемогоЕдиничногоДокумента);
	
КонецПроцедуры

&НаСервере
Процедура СохранитьТаблицуТоваровНаСервере(ФорматВходящегоДокумента)
	
	Если ФорматВходящегоДокумента = "ON_NSCHFDOPPR" Тогда
		
		ТекущаяТаблицаСоответствий = ЭтаФорма.ТаблицаСопоставленияНоменклатуры.Выгрузить();
		
		ТаблицаСоответствий = ХранилищеОбщихНастроек.Загрузить("ОФД_ЭДО_СопоставлениеТоваров", 		// Ключ объекта
		"ТаблицаСоответствийПоступлений",															// Ключ настройки 
		"Таблица соответствий товаров их входящих эл. документов с номенклатурой в базе данных.",	// описание настройки
		ПолучитьТекущегоПользователя());          													// Пользователь
		
		Если ТаблицаСоответствий = Неопределено Тогда
			
			УстановитьПривилегированныйРежим(Истина);
			ХранилищеОбщихНастроек.Сохранить("ОФД_ЭДО_СопоставлениеТоваров",							// Ключ объекта
			"ТаблицаСоответствийПоступлений",															// Ключ настройки 
			ТекущаяТаблицаСоответствий,																	// Настройка
			"Таблица соответствий товаров их входящих эл. документов с номенклатурой в базе данных.",	// описание настройки
			ПолучитьТекущегоПользователя()); 															// Пользователь     
			УстановитьПривилегированныйРежим(Ложь);
			
		Иначе
			
			Если ЕстьМетаданныеХарактеристикиНоменклатуры() = Истина Тогда 
				Если ТаблицаСоответствий.Колонки.Найти("ХарактеристикаНоменклатуры") = Неопределено Тогда
					ТаблицаСоответствий.Колонки.Добавить("ХарактеристикаНоменклатуры", Новый ОписаниеТипов("СправочникСсылка.ХарактеристикиНоменклатуры"));
				ИначеЕсли НЕ ТаблицаСоответствий.Колонки.ХарактеристикаНоменклатуры.ТипЗначения = Тип("СправочникСсылка.ХарактеристикиНоменклатуры") Тогда
					ТаблицаСоответствий.Колонки.Удалить("ХарактеристикаНоменклатуры");
					ТаблицаСоответствий.Колонки.Добавить("ХарактеристикаНоменклатуры", Новый ОписаниеТипов("СправочникСсылка.ХарактеристикиНоменклатуры"));
				КонецЕсли;
				Если ТекущаяТаблицаСоответствий.Колонки.Найти("ХарактеристикаНоменклатуры") = Неопределено Тогда
					ТекущаяТаблицаСоответствий.Колонки.Добавить("ХарактеристикаНоменклатуры", Новый ОписаниеТипов("СправочникСсылка.ХарактеристикиНоменклатуры"));
				КонецЕсли;
			Иначе
				Если ТаблицаСоответствий.Колонки.Найти("ХарактеристикаНоменклатуры") = Неопределено Тогда
					ТаблицаСоответствий.Колонки.Добавить("ХарактеристикаНоменклатуры", Новый ОписаниеТипов("Строка"));
				КонецЕсли;
				Если ТекущаяТаблицаСоответствий.Колонки.Найти("ХарактеристикаНоменклатуры") = Неопределено Тогда
					ТекущаяТаблицаСоответствий.Колонки.Добавить("ХарактеристикаНоменклатуры", Новый ОписаниеТипов("Строка"));
				КонецЕсли;
			КонецЕсли;	
			
			Запрос = Новый Запрос;
			Запрос.Текст = "ВЫБРАТЬ
			               |	ВЫРАЗИТЬ(ТаблицаСоответствий.НаименованиеИзДокумента КАК СТРОКА(200)) КАК НаименованиеИзДокумента,
			               |	ВЫРАЗИТЬ(ТаблицаСоответствий.КодТовараИзДокумента КАК СТРОКА(50)) КАК КодТовараИзДокумента,
			               |	ВЫРАЗИТЬ(ТаблицаСоответствий.АртикулТовараИзДокумента КАК СТРОКА(50)) КАК АртикулТовараИзДокумента,
			               |	ТаблицаСоответствий.ПоставщикПоДокументу КАК ПоставщикПоДокументу,
			               |	ТаблицаСоответствий.Номенклатура КАК Номенклатура,
						   |	ТаблицаСоответствий.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры
			               |ПОМЕСТИТЬ ТаблицаНоменклатурыПоставщика
			               |ИЗ
			               |	&ТаблицаСоответствий КАК ТаблицаСоответствий
			               |;
			               |
			               |////////////////////////////////////////////////////////////////////////////////
			               |ВЫБРАТЬ
			               |	ВЫРАЗИТЬ(ТекущаяТаблицаСоответствий.НаименованиеИзДокумента КАК СТРОКА(200)) КАК НаименованиеИзДокумента,
			               |	ВЫРАЗИТЬ(ТекущаяТаблицаСоответствий.КодТовараИзДокумента КАК СТРОКА(50)) КАК КодТовараИзДокумента,
			               |	ВЫРАЗИТЬ(ТекущаяТаблицаСоответствий.АртикулТовараИзДокумента КАК СТРОКА(50)) КАК АртикулТовараИзДокумента,
			               |	ТекущаяТаблицаСоответствий.ПоставщикПоДокументу КАК ПоставщикПоДокументу,
			               |	ТекущаяТаблицаСоответствий.Номенклатура КАК НоваяНоменклатура,
						   |	ТекущаяТаблицаСоответствий.ХарактеристикаНоменклатуры КАК НоваяХарактеристикаНоменклатуры
			               |ПОМЕСТИТЬ НоваяТаблицаНоменклатурыПоставщика
			               |ИЗ
			               |	&ТекущаяТаблицаСоответствий КАК ТекущаяТаблицаСоответствий
			               |;
			               |
			               |////////////////////////////////////////////////////////////////////////////////
			               |ВЫБРАТЬ
			               |	ЕСТЬNULL(ТаблицаНоменклатурыПоставщика.НаименованиеИзДокумента, НоваяТаблицаНоменклатурыПоставщика.НаименованиеИзДокумента) КАК НаименованиеИзДокумента,
			               |	ЕСТЬNULL(ТаблицаНоменклатурыПоставщика.КодТовараИзДокумента, НоваяТаблицаНоменклатурыПоставщика.КодТовараИзДокумента) КАК КодТовараИзДокумента,
			               |	ЕСТЬNULL(ТаблицаНоменклатурыПоставщика.АртикулТовараИзДокумента, НоваяТаблицаНоменклатурыПоставщика.АртикулТовараИзДокумента) КАК АртикулТовараИзДокумента,
			               |	ЕСТЬNULL(ТаблицаНоменклатурыПоставщика.ПоставщикПоДокументу, НоваяТаблицаНоменклатурыПоставщика.ПоставщикПоДокументу) КАК ПоставщикПоДокументу,
			               |	ТаблицаНоменклатурыПоставщика.Номенклатура,
			               |	НоваяТаблицаНоменклатурыПоставщика.НоваяНоменклатура,
						   |	ТаблицаНоменклатурыПоставщика.ХарактеристикаНоменклатуры,
						   |	НоваяТаблицаНоменклатурыПоставщика.НоваяХарактеристикаНоменклатуры
			               |ПОМЕСТИТЬ ОбъединеннаяТаблица
			               |ИЗ
			               |	ТаблицаНоменклатурыПоставщика КАК ТаблицаНоменклатурыПоставщика
			               |		ПОЛНОЕ СОЕДИНЕНИЕ НоваяТаблицаНоменклатурыПоставщика КАК НоваяТаблицаНоменклатурыПоставщика
			               |		ПО ТаблицаНоменклатурыПоставщика.НаименованиеИзДокумента = НоваяТаблицаНоменклатурыПоставщика.НаименованиеИзДокумента
			               |			И ТаблицаНоменклатурыПоставщика.КодТовараИзДокумента = НоваяТаблицаНоменклатурыПоставщика.КодТовараИзДокумента
			               |			И ТаблицаНоменклатурыПоставщика.АртикулТовараИзДокумента = НоваяТаблицаНоменклатурыПоставщика.АртикулТовараИзДокумента
			               |;
			               |
			               |////////////////////////////////////////////////////////////////////////////////
			               |УНИЧТОЖИТЬ ТаблицаНоменклатурыПоставщика
			               |;
			               |
			               |////////////////////////////////////////////////////////////////////////////////
			               |УНИЧТОЖИТЬ НоваяТаблицаНоменклатурыПоставщика
			               |;
			               |
			               |////////////////////////////////////////////////////////////////////////////////
			               |ВЫБРАТЬ
			               |	ОбъединеннаяТаблица.НаименованиеИзДокумента,
			               |	ОбъединеннаяТаблица.КодТовараИзДокумента,
			               |	ОбъединеннаяТаблица.АртикулТовараИзДокумента,
			               |	ОбъединеннаяТаблица.ПоставщикПоДокументу,
						   |	ЕСТЬNULL(ЕСТЬNULL(ОбъединеннаяТаблица.НоваяНоменклатура, ОбъединеннаяТаблица.Номенклатура), ЗНАЧЕНИЕ(Справочник."+ПараметрыЗагрузкиНоменклатуры.ИмяСправочникаНоменклатуры+".ПустаяСсылка)) КАК Номенклатура,
						   |	ЕСТЬNULL(ЕСТЬNULL(ОбъединеннаяТаблица.НоваяХарактеристикаНоменклатуры, ОбъединеннаяТаблица.ХарактеристикаНоменклатуры), ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка)) КАК ХарактеристикаНоменклатуры
						   |ИЗ
			               |	ОбъединеннаяТаблица КАК ОбъединеннаяТаблица";
			Запрос.УстановитьПараметр("ТаблицаСоответствий", ТаблицаСоответствий);
			Запрос.УстановитьПараметр("ТекущаяТаблицаСоответствий", ТекущаяТаблицаСоответствий);
			
			//|	ЕСТЬNULL(ЕСТЬNULL(ОбъединеннаяТаблица.НоваяНоменклатура, ОбъединеннаяТаблица.Номенклатура), ЗНАЧЕНИЕ(Справочник."+ПараметрыЗагрузкиНоменклатуры.ИмяСправочникаНоменклатуры+".ПустаяСсылка)) КАК Номенклатура
			
			Результат = Запрос.Выполнить().Выгрузить();
			
			УстановитьПривилегированныйРежим(Истина);
			ХранилищеОбщихНастроек.Сохранить("ОФД_ЭДО_СопоставлениеТоваров",							// Ключ объекта
			"ТаблицаСоответствийПоступлений",															// Ключ настройки 
			Результат,																					// Настройка
			"Таблица соответствий товаров их входящих эл. документов с номенклатурой в базе данных.",	// описание настройки
			ПолучитьТекущегоПользователя()); 															// Пользователь     
			УстановитьПривилегированныйРежим(Ложь);
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьИзПамятиТаблицуТоваров(Команда)
	
	ФорматЗагружаемогоЕдиничногоДокумента = "ON_NSCHFDOPPR";
	ЗагрузитьИзПамятиТаблицуТоваровНаСервере(ФорматЗагружаемогоЕдиничногоДокумента);	
		
КонецПроцедуры

&НаСервере
Процедура ЗагрузитьИзПамятиТаблицуТоваровНаСервере(ФорматВходящегоДокумента)
	
	Если ФорматВходящегоДокумента = "ON_NSCHFDOPPR" Тогда
		
		ТаблицаСоответствий = ХранилищеОбщихНастроек.Загрузить("ОФД_ЭДО_СопоставлениеТоваров", 		// Ключ объекта
		"ТаблицаСоответствийПоступлений",															// Ключ настройки 
		"Таблица соответствий товаров их входящих эл. документов с номенклатурой в базе данных.",	// описание настройки
		ПолучитьТекущегоПользователя());          													// Пользователь	
		
		Если ТаблицаСоответствий = Неопределено Тогда
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = "Не обнаружено сохраненных значений."+Символы.ПС+"Таблица не была заполнена.";
			Сообщение.Сообщить();
			Возврат;
		КонецЕсли;	
		
		ТипСтрока200	= Новый ОписаниеТипов("Строка", , Новый КвалификаторыСтроки(200, ДопустимаяДлина.Фиксированная));
		ТипСтрока50		= Новый ОписаниеТипов("Строка", , Новый КвалификаторыСтроки(50, ДопустимаяДлина.Фиксированная));
		
		Для Каждого Строка из ЭтаФорма.ТаблицаСопоставленияНоменклатуры Цикл 
			
			ОтборСтрок = Новый Структура();
			ОтборСтрок.Вставить("АртикулТовараИзДокумента", ТипСтрока50.ПривестиЗначение(Строка.АртикулТовараИзДокумента));
			ОтборСтрок.Вставить("КодТовараИзДокумента", ТипСтрока50.ПривестиЗначение(Строка.КодТовараИзДокумента));
			ОтборСтрок.Вставить("НаименованиеИзДокумента", ТипСтрока200.ПривестиЗначение(Строка.НаименованиеИзДокумента));
			ОтборСтрок.Вставить("ПоставщикПоДокументу", Строка.ПоставщикПоДокументу);
			НайденныеСтрокиСоответствий = ТаблицаСоответствий.НайтиСтроки(ОтборСтрок);
			
			// Предполагается, что дублей быть не может.
			Если НайденныеСтрокиСоответствий.Количество() > 0 Тогда 
				Строка.Номенклатура = НайденныеСтрокиСоответствий[0].Номенклатура;
				Если ХарактеристикиСуществуютИИспользуются() = Истина Тогда
					Если НЕ ТаблицаСоответствий.Колонки.Найти("ХарактеристикаНоменклатуры") = Неопределено Тогда
						Строка.ХарактеристикаНоменклатуры = НайденныеСтрокиСоответствий[0].ХарактеристикаНоменклатуры;
					КонецЕсли;
				КонецЕсли;	
			КонецЕсли;	
			
		КонецЦикла;	
		
	КонецЕсли;
		
КонецПроцедуры

&НаКлиенте
Процедура ПередВыборомСсылкиНаХарактеристику(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ПараметрыОткрытияФормы = Новый Структура("РежимВыбора", Истина);
	
	Если ЕстьМетаданныеВидНоменклатуры() Тогда
		ПараметрыОткрытияФормы.Вставить("Номенклатура", Элементы.ТаблицаСопоставленияНоменклатуры.ТекущиеДанные.Номенклатура);
	Иначе
		ПараметрыОткрытияФормы.Вставить("Владелец", Элементы.ТаблицаСопоставленияНоменклатуры.ТекущиеДанные.Номенклатура)
	КонецЕсли;	
	
	ОбработкаЗакрытия = Новый ОписаниеОповещения("ПриЗакрытииФормыВыбораХарактеристики", ЭтаФорма);
	ФормаВыбораХарактеристики = ОткрытьФорму("Справочник.ХарактеристикиНоменклатуры.ФормаВыбора", ПараметрыОткрытияФормы, ЭтаФорма, , , , ОбработкаЗакрытия);

КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытииФормыВыбораХарактеристики(Значение, ДопПараметры) Экспорт
	
	Если Значение = Неопределено Тогда
        Возврат;
    КонецЕсли;
     
	Элементы.ТаблицаСопоставленияНоменклатуры.ТекущиеДанные.ХарактеристикаНоменклатуры = Значение;	
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыФункции

&НаСервере
Процедура ИнициализацияКэш(Откат = Ложь)
	
	// Инициализируем Кэш 
	Кэш = ЗагрузитьКэш(Откат);
	СохранитьКэш(Кэш);
	
КонецПроцедуры

&НаСервере
Функция ЗагрузитьКэш(Откат = Ложь)       
	
	Если ЗначениеЗаполнено(ЭтаФорма.АдресВременногоХранилищаКэш) и Не Откат Тогда
		
		Возврат ПолучитьИзВременногоХранилища(ЭтаФорма.АдресВременногоХранилищаКэш);
		
	Иначе
		
		МодульОбъектаОбработки = РеквизитФормыВЗначение("Объект");
		Кэш = МодульОбъектаОбработки.Инициализация(Откат);
		ЗначениеВРеквизитФормы(МодульОбъектаОбработки, "Объект"); 
		
		Возврат Кэш;
		
	КонецЕсли;
	
КонецФункции

&НаСервере
Процедура СохранитьКэш(Кэш)
	
	Если ЗначениеЗаполнено(ЭтаФорма.АдресВременногоХранилищаКэш) Тогда
		Адрес = ЭтаФорма.АдресВременногоХранилищаКэш;
	Иначе
		Адрес = ЭтаФорма.УникальныйИдентификатор;
	КонецЕсли;
	
	ЭтаФорма.АдресВременногоХранилищаКэш = ПоместитьВоВременноеХранилище(Кэш, Адрес);	
	
КонецПроцедуры

&НаСервере
Процедура СоздатьФайлЗагружаемогоДокументаНаСервере(ФайлДокументаДвоичныеДанные)
	
	Если НЕ ПутьКВременномуФайлуДокументаНаСервере = "" Тогда
		 ВременныйФайлДокументаНаСервере = Новый Файл(ПутьКВременномуФайлуДокументаНаСервере);
		 Если НЕ ВременныйФайлДокументаНаСервере.Существует() Тогда
			ПутьКВременномуФайлуДокументаНаСервере = КаталогВременныхФайлов()+"ФайлДанныхЗагрузки.xml";
			ФайлДокументаДвоичныеДанные.Записать(ПутьКВременномуФайлуДокументаНаСервере);
		КонецЕсли;
	Иначе
		ПутьКВременномуФайлуДокументаНаСервере = КаталогВременныхФайлов()+"ФайлДанныхЗагрузки.xml";
		ФайлДокументаДвоичныеДанные.Записать(ПутьКВременномуФайлуДокументаНаСервере);
	КонецЕсли;
	
КонецПроцедуры	

&НаСервереБезКонтекста
Функция ПолучитьТекущегоПользователя()
	
	Возврат Неопределено;
	
	Если НЕ Метаданные.ОбщиеМодули.Найти("ПользователиИнформационнойБазы") = Неопределено Тогда
		ТекущийПользователь = ПользователиИнформационнойБазы.ТекущийПользователь();
	Иначе
		ТекущийПользователь = ПользователиКлиентСервер.ТекущийПользователь();
	КонецЕсли;	
	
	Возврат ТекущийПользователь;
	
КонецФункции

&НаСервереБезКонтекста
Функция ЕстьМетаданныеВидНоменклатуры()
	
	ЕстьМетаданныеВидНоменклатуры = Ложь;
	
	Если НЕ Метаданные.Справочники.Номенклатура.Реквизиты.Найти("ВидНоменклатуры") = Неопределено Тогда
		ЕстьМетаданныеВидНоменклатуры = Истина;
	КонецЕсли;
	
	Возврат ЕстьМетаданныеВидНоменклатуры;
	
КонецФункции

&НаСервереБезКонтекста
Функция ЕстьМетаданныеХарактеристикиНоменклатуры()
	
	ХарактеристикиСуществуют = Ложь;
	
	Если НЕ Метаданные.Справочники.Найти("ХарактеристикиНоменклатуры") = Неопределено Тогда
		ХарактеристикиСуществуют = Истина;
	КонецЕсли;
	
	Возврат ХарактеристикиСуществуют;	
	
КонецФункции

&НаСервереБезКонтекста
Функция ХарактеристикиСуществуютИИспользуются()
	
	ХарактеристикиСуществуютИИспользуются = Ложь;
	
	Если НЕ Метаданные.Константы.Найти("ИспользоватьХарактеристикиНоменклатуры") = Неопределено И НЕ Метаданные.Справочники.Найти("ХарактеристикиНоменклатуры") = Неопределено Тогда
		ХарактеристикиИспользуются = Константы["ИспользоватьХарактеристикиНоменклатуры"].Получить();
		Если ХарактеристикиИспользуются = Истина Тогда
			ХарактеристикиСуществуютИИспользуются = Истина;
		КонецЕсли;	
	КонецЕсли;
	
	Возврат ХарактеристикиСуществуютИИспользуются;	
	
КонецФункции		

#КонецОбласти

#Область ЗагрузкаВходящихДокументов

&НаСервере
Функция ПередЗагрузкой_ПодготовкаНаСервере(ФайлДокументаДвоичныеДанные)
	
	Адрес = АдресВременногоХранилищаКэш;
	
	Кэш = ПолучитьИзВременногоХранилища(Адрес);
	
	Если Кэш = Неопределено Тогда
		ИнициализацияКэш(Истина);
		Кэш = ПолучитьИзВременногоХранилища(Адрес);
	КонецЕсли;
	
	Если Кэш.НастройкиОбъект[Кэш.ПрефиксКонфигурации+"НастройкиЗагрузки"] = Неопределено Тогда				
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Не обнаружена настройка загрузки объектов """+Кэш.ПрефиксКонфигурации+"НастройкиЗагрузки"+"""";
		Сообщение.Сообщить();
		Возврат Неопределено;
	КонецЕсли;
	
	НастройкаЗагрузкиОбъектXDTO = Кэш.НастройкиОбъект[Кэш.ПрефиксКонфигурации+"НастройкиЗагрузки"];
	
	Если НастройкаЗагрузкиОбъектXDTO.ЗагружаемыеФорматы.Свойства().Получить(ФорматЗагружаемогоЕдиничногоДокумента) = Неопределено Тогда 
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "В настройке загрузки объектов """+Кэш.ПрефиксКонфигурации+"НастройкиЗагрузки"+""" не обнаружено описание загрузки для формата """+ФорматЗагружаемогоЕдиничногоДокумента+"""";
		Сообщение.Сообщить();
		Возврат Неопределено;
	КонецЕсли;
	
	ОписаниеЗагрузкиПоФормату = НастройкаЗагрузкиОбъектXDTO.ЗагружаемыеФорматы[ФорматЗагружаемогоЕдиничногоДокумента]; 
	
	МодульОбъектаОбработки = РеквизитФормыВЗначение("Объект");
	ФорматЗагружаемогоДокументаОбъектXDTO = МодульОбъектаОбработки.ПолучитьФабрикуФормата(ФорматЗагружаемогоЕдиничногоДокумента, Кэш);
	
	СписокОбъектовПриемников = Новый СписокЗначений;
	
	Для Каждого ОписаниеОбъектаПриемника из ОписаниеЗагрузкиПоФормату.Свойства() Цикл
		Если ОписаниеЗагрузкиПоФормату[ОписаниеОбъектаПриемника.Имя].ТребуетсяСопоставлениеНоменклатуры = "Истина" Тогда
			ТребуетсяСопоставлениеТоваров = Истина;
		КонецЕсли;	
		СписокОбъектовПриемников.Добавить(ОписаниеОбъектаПриемника.Имя, ОписаниеЗагрузкиПоФормату[ОписаниеОбъектаПриемника.Имя].Имя); 
	КонецЦикла;	
	
	Возврат СписокОбъектовПриемников; 
	
КонецФункции	

&НаСервере
Функция СформироватьЕдиничныйДокументПодготовкаНаСервере(ФайлДокументаДвоичныеДанные, ЗагружаемыйФормат, ВариантПриемникаЗагрузки)
	
	Адрес = АдресВременногоХранилищаКэш;
	
	Кэш = ПолучитьИзВременногоХранилища(Адрес);
	
	Если Кэш = Неопределено Тогда
		ИнициализацияКэш(Истина);
		Кэш = ПолучитьИзВременногоХранилища(Адрес);
	КонецЕсли;
	
	Если Кэш.НастройкиОбъект[Кэш.ПрефиксКонфигурации+ЗагружаемыйФормат+"_"+ВариантПриемникаЗагрузки] = Неопределено Тогда				
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Не обнаружена настройка загрузки объектов """+Кэш.ПрефиксКонфигурации+ЗагружаемыйФормат+"_"+ВариантПриемникаЗагрузки+"""";
		Сообщение.Сообщить();
		Возврат Неопределено;
	КонецЕсли;
	
	XDTOСтруктураНастройка = Кэш.НастройкиОбъект[Кэш.ПрефиксКонфигурации+ЗагружаемыйФормат+"_"+ВариантПриемникаЗагрузки];
	
	СоздатьФайлЗагружаемогоДокументаНаСервере(ФайлДокументаДвоичныеДанные);
	ЧтениеXML = Новый ЧтениеXML();
	ЧтениеXML.ОткрытьФайл(ПутьКВременномуФайлуДокументаНаСервере);
	Фабрика = Кэш.ФорматыОбъект[ЗагружаемыйФормат];
	XDTOСтруктураДанные = Фабрика.ПрочитатьXML(ЧтениеXML);
	
	Возврат СформироватьЕдиничныйДокументНаСервере(XDTOСтруктураДанные, XDTOСтруктураНастройка, ТаблицаСопоставленияНоменклатуры); 
	
КонецФункции	

&НаСервере
Функция СформироватьЕдиничныйДокументНаСервере(XDTOСтруктураДанные, XDTOСтруктураНастройка, ТаблицаСопоставленияНоменклатуры = Неопределено)
			
	ФайлНастройкиЗагрузкиКорректен = ПроверкаФайлаНастройкиЗагрузкиНаСоответствиеФормату(XDTOСтруктураНастройка);
	
	Если НЕ ФайлНастройкиЗагрузкиКорректен Тогда
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Файл настройки загрузки документа не прошел проверку на корректность.";
		Сообщение.Сообщить();
		Возврат Неопределено;
	КонецЕсли;
	
	НастройкаСоответствуетКонфигурации = XDTOСтруктураНастройка.ПрефиксКонфигурации = ПрефиксКонфигурации;
	
	Если НЕ НастройкаСоответствуетКонфигурации Тогда
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Файл настройки загрузки документа не соответствует текущей конфигурации программы.";
		Сообщение.Сообщить();
		Возврат Неопределено;
	КонецЕсли;	
	
	// Начинаем разбирать входящие данные.
	НачатьТранзакцию();
	
	// Основной объект.
	Если Метаданные[XDTOСтруктураНастройка.ОсновнойОбъектПриемник.ТипОбъектаМетаданных].Найти(XDTOСтруктураНастройка.ОсновнойОбъектПриемник.ИмяОбъектаМетаданных) = Неопределено Тогда
		ОтменитьТранзакцию();
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст =	"Описанный в настройке загрузки объект метаданных "+XDTOСтруктураНастройка.ОсновнойОбъектПриемник.ТипОбъектаМетаданных+"."
							+XDTOСтруктураНастройка.ОсновнойОбъектПриемник.ИмяОбъектаМетаданных+" не обнаружен!";
		Сообщение.Сообщить();
		Возврат Неопределено;
	КонецЕсли;
	
	ОбъектМетаданыхПриемника = Метаданные[XDTOСтруктураНастройка.ОсновнойОбъектПриемник.ТипОбъектаМетаданных][XDTOСтруктураНастройка.ОсновнойОбъектПриемник.ИмяОбъектаМетаданных];
	
	Если XDTOСтруктураНастройка.ОсновнойОбъектПриемник.ТипОбъектаМетаданных = "Документы" Тогда
		ОбъектПриемник = Документы[XDTOСтруктураНастройка.ОсновнойОбъектПриемник.ИмяОбъектаМетаданных].СоздатьДокумент();
	ИначеЕсли XDTOСтруктураНастройка.ОсновнойОбъектПриемник.ТипОбъектаМетаданных = "Справочники" Тогда
		ОбъектПриемник = Справочники[XDTOСтруктураНастройка.ОсновнойОбъектПриемник.ИмяОбъектаМетаданных].СоздатьЭлемент();
	Иначе
		// Не стоит забегать вперёд.
		ОтменитьТранзакцию();
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст =	"Описанный в настройке загрузки тип объекта метаданных "+XDTOСтруктураНастройка.ОсновнойОбъектПриемник.ТипОбъектаМетаданных
							+" не поддерживается для загрузки на данный момент."+Символы.ПС+"На данный момент загрузать данные можно только в справочники и документы.";
		Сообщение.Сообщить();
		Возврат Неопределено;
	КонецЕсли;
	
	// Реквизит для загружаемого объекта на форме.
	// Нужен для вызова некоторых общих процедур заполнения, которые созданы для вызова из формы документа.
	Структура = Новый Структура("ЗагружаемыйДокументОбъект", Неопределено);
	ЗаполнитьЗначенияСвойств(Структура, ЭтаФорма);
	Если НЕ Структура["ЗагружаемыйДокументОбъект"] = Неопределено Тогда
		УдаляемыеРеквизиты = Новый Массив;
		УдаляемыеРеквизиты.Добавить("ЗагружаемыйДокументОбъект");	   
		ЭтаФорма.ИзменитьРеквизиты(, УдаляемыеРеквизиты);
	КонецЕсли;	
	Если XDTOСтруктураНастройка.ОсновнойОбъектПриемник.ТипОбъектаМетаданных = "Документы" Тогда
		ТипРеквизита = Новый ОписаниеТипов("ДокументОбъект."+XDTOСтруктураНастройка.ОсновнойОбъектПриемник.ИмяОбъектаМетаданных);
	ИначеЕсли XDTOСтруктураНастройка.ОсновнойОбъектПриемник.ТипОбъектаМетаданных = "Справочники" Тогда
		ТипРеквизита = Новый ОписаниеТипов("СправочникОбъект."+XDTOСтруктураНастройка.ОсновнойОбъектПриемник.ИмяОбъектаМетаданных);
	КонецЕсли;	
	ДобавляемыеРеквизиты = Новый Массив;
	НовыйРеквизит = Новый РеквизитФормы("ЗагружаемыйДокументОбъект", ТипРеквизита);
	ДобавляемыеРеквизиты.Добавить(НовыйРеквизит);	
	ЭтаФорма.ИзменитьРеквизиты(ДобавляемыеРеквизиты);
	
	// Основные реквизиты объекта.
	Для Каждого РеквизитПриемника из XDTOСтруктураНастройка.ОсновнойОбъектПриемник.Реквизиты.Свойства() Цикл
		
		ОбрабатываемыйРеквизитXDTO = XDTOСтруктураНастройка.ОсновнойОбъектПриемник.Реквизиты[РеквизитПриемника.Имя];
		
		Если НЕ ОбрабатываемыйРеквизитXDTO.Свойства().Получить("УсловияЗаполнения") = Неопределено Тогда	
			УсловиеВыполнено = РезультатОбработкиУсловия(XDTOСтруктураДанные, ОбрабатываемыйРеквизитXDTO, ОбъектПриемник);
			Если УсловиеВыполнено = Ложь Тогда
				Продолжить;
			КонецЕсли;	
		КонецЕсли;
		
		МетодРасчетаЗначения = ОбрабатываемыйРеквизитXDTO.Источник.МетодРасчетаЗначения;
		
		// Проверяем существование реквизита.
		РеквизитСуществует = ПроверкаСуществованияРеквизита(ОбъектМетаданыхПриемника, ОбрабатываемыйРеквизитXDTO);
		Если НЕ РеквизитСуществует Тогда
			ОтменитьТранзакцию();
			Возврат Неопределено;
		КонецЕсли;		
		
		ЗначениеРеквизита = РассчитатьЗначениеРеквизитаПоМетодуРасчета(ОбрабатываемыйРеквизитXDTO, МетодРасчетаЗначения, XDTOСтруктураДанные, ОбъектПриемник);		
		Если ЗначениеРеквизита = Неопределено Тогда
			ОтменитьТранзакцию();
			Возврат Неопределено;
		КонецЕсли;
		
		ОбъектПриемник[ОбрабатываемыйРеквизитXDTO.ИмяОбъектаМетаданных] = ЗначениеРеквизита;
				
	КонецЦикла;	
	
	// Табличные части объекта.
	ТабличныеЧастиОбработаны = ЗаполнитьТабличныеЧастиДокумента(XDTOСтруктураДанные, XDTOСтруктураНастройка, ОбъектМетаданыхПриемника, ОбъектПриемник, ТаблицаСопоставленияНоменклатуры);
	Если ТабличныеЧастиОбработаны = Ложь Тогда
		ОтменитьТранзакцию();
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "При обработке табличных частей загружаемого документа произошла ошибка."+Символы.ПС+"Загрузка отменена.";
		Сообщение.Сообщить();
		Возврат Неопределено;
	КонецЕсли;
	
	// Дополнительные процедуры
	ВыполнитьДополнительныеПроцедурыЗаполненияДокумента(XDTOСтруктураДанные, XDTOСтруктураНастройка, ОбъектМетаданыхПриемника, ОбъектПриемник);
	
	// Загрузка информации по маркам.
	ОбработатьИЗаполнитьИнформациюПоМаркам(ОбъектПриемник, XDTOСтруктураДанные, XDTOСтруктураНастройка.ФорматВходящегоДокумента);
	
	ОбъектПриемник.Записать(РежимЗаписиДокумента.Запись);
	
	// Дополнительные объекты. Связанные документы и т.п.
	ДополнительныеОбъектыОбработаны = СоздатьИЗаполнитьДополнительныеОбъекты(XDTOСтруктураДанные, XDTOСтруктураНастройка, ОбъектМетаданыхПриемника, ОбъектПриемник);
	Если ДополнительныеОбъектыОбработаны = Ложь Тогда
		ОтменитьТранзакцию();
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "При обработке дополнительных объектов (связанных документов и проч.) загружаемого документа произошла ошибка."+Символы.ПС+"Загрузка отменена.";
		Сообщение.Сообщить();
		Возврат Неопределено;
	КонецЕсли;
	
	// Все прошло без ошибок.
	//ОтменитьТранзакцию();
	//ОбъектПриемник.ОбменДанными.Загрузка = Истина;
	ЗафиксироватьТранзакцию();
	
	Возврат ОбъектПриемник.Ссылка; 
	
КонецФункции

&НаСервереБезКонтекста
Функция ЗаполнитьТабличныеЧастиДокумента_Резерв(XDTOСтруктураДанные, XDTOСтруктураНастройка, ОбъектМетаданыхПриемника, ОбъектПриемник, ТаблицаСопоставленияНоменклатуры = Неопределено)
	
	ВходящиеПеременные = Новый Структура;
	
	Для каждого ТабличнаяЧастьПриемникаСвойствоXDTO из XDTOСтруктураНастройка.ОсновнойОбъектПриемник.ТабличныеЧасти.Свойства() Цикл
		
		ОбрабатываетсяТаблицаТоваров = Ложь;
		
		ОбрабатываемаяТабличнаяЧастьПриемникаРеквизитXDTO = XDTOСтруктураНастройка.ОсновнойОбъектПриемник.ТабличныеЧасти[ТабличнаяЧастьПриемникаСвойствоXDTO.Имя];
		
		Если ОбъектМетаданыхПриемника.ТабличныеЧасти.Найти(ОбрабатываемаяТабличнаяЧастьПриемникаРеквизитXDTO.ИмяОбъектаМетаданных) = Неопределено Тогда
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст =	"Описанная в настройке загрузки табличная часть """+XDTOСтруктураНастройка.ОсновнойОбъектПриемник.ТипОбъектаМетаданных+"."
								+XDTOСтруктураНастройка.ОсновнойОбъектПриемник.ИмяОбъектаМетаданных+"."
								+ОбрабатываемаяТабличнаяЧастьПриемникаРеквизитXDTO.ИмяОбъектаМетаданных+""" не обнаружена!";
			Сообщение.Сообщить();
			Возврат Ложь;
		КонецЕсли;	
		
		ТаблицаОбъектМетаданных = ОбъектМетаданыхПриемника.ТабличныеЧасти[ОбрабатываемаяТабличнаяЧастьПриемникаРеквизитXDTO.ИмяОбъектаМетаданных];
		ПутьКСпискуСтрок		= ОбрабатываемаяТабличнаяЧастьПриемникаРеквизитXDTO.ПутьКСпискуСтрок;
		ПутьКСпискуСтрокМассив	= СтрРазделить(ОбрабатываемаяТабличнаяЧастьПриемникаРеквизитXDTO.ПутьКСпискуСтрок, ".");
		УзелДанных = XDTOСтруктураДанные;
		
		Для Каждого ЭлементПути из ПутьКСпискуСтрокМассив Цикл
			
			Если УзелДанных.Свойства().Получить(ЭлементПути) = Неопределено Тогда
				Сообщение = Новый СообщениеПользователю;
				Сообщение.Текст =	"При заполнении табличной части """+XDTOСтруктураНастройка.ОсновнойОбъектПриемник.ТипОбъектаМетаданных+"."
									+XDTOСтруктураНастройка.ОсновнойОбъектПриемник.ИмяОбъектаМетаданных+"."+ОбрабатываемаяТабличнаяЧастьПриемникаРеквизитXDTO.ИмяОбъектаМетаданных
									+""" произошла ошибка."+Символы.ПС+"Параметр ""ПутьКСпискуСтрок"", указан некорректно."+Символы.ПС
									+"Значение параметра "+ПутьКСпискуСтрок;
				Сообщение.Сообщить();
				Возврат Ложь;	
			Иначе                 
				УзелДанных = УзелДанных[ЭлементПути];
			КонецЕсли;	
			
		КонецЦикла;
		
		Если НЕ ОбрабатываемаяТабличнаяЧастьПриемникаРеквизитXDTO.Свойства().Получить("ТаблицаТоваров") = Неопределено
			И ОбрабатываемаяТабличнаяЧастьПриемникаРеквизитXDTO.ТаблицаТоваров = "Истина" Тогда
			ОбрабатываетсяТаблицаТоваров = Истина;	
		КонецЕсли;
		
		Если ОбрабатываетсяТаблицаТоваров Тогда
			//Если ФайлНастройкиРаботыСНоменклатуройДвоичныеДанные = Неопределено Тогда
			//	Сообщение = Новый СообщениеПользователю;
			//	Сообщение.Текст = "Описанная в настройке загрузки табличная часть """+XDTOСтруктураНастройка.ОсновнойОбъектПриемник.ТипОбъектаМетаданных+"."
			//					+XDTOСтруктураНастройка.ОсновнойОбъектПриемник.ИмяОбъектаМетаданных+"."
			//					+ОбрабатываемаяТабличнаяЧастьПриемникаРеквизитXDTO.ИмяОбъектаМетаданных+""", помеченная как таблица,"
			//					+Символы.ПС+" содержащая товарные позиции, не может быть обработана, поскольку не обнаружена настройка сопоставления товарных позиций!";
			//	Сообщение.Сообщить();
			//	Возврат Ложь;
			//КонецЕсли;
			Если ТаблицаСопоставленияНоменклатуры = Неопределено Тогда
				Сообщение = Новый СообщениеПользователю;
				Сообщение.Текст = "Описанная в настройке загрузки табличная часть """+XDTOСтруктураНастройка.ОсновнойОбъектПриемник.ТипОбъектаМетаданных+"."
								+XDTOСтруктураНастройка.ОсновнойОбъектПриемник.ИмяОбъектаМетаданных+"."
								+ОбрабатываемаяТабличнаяЧастьПриемникаРеквизитXDTO.ИмяОбъектаМетаданных+""", помеченная как таблица,"
								+Символы.ПС+" содержащая товарные позиции, не может быть обработана, поскольку не обнаружена таблица сопоставления товарных позиций!"
								+Символы.ПС+"Проверьте заполненность таблицы сопоставления."
								+Символы.ПС+"Попробуйте повторить процедуру сопоставления.";
				Сообщение.Сообщить();
				Возврат Ложь;
			КонецЕсли;
			Если НЕ ОбрабатываемаяТабличнаяЧастьПриемникаРеквизитXDTO.Свойства().Получить("КолонкаТоваров") = Неопределено Тогда 
				Если ТаблицаОбъектМетаданных.Реквизиты.Найти(ОбрабатываемаяТабличнаяЧастьПриемникаРеквизитXDTO.КолонкаТоваров) = Неопределено Тогда		
					Сообщение = Новый СообщениеПользователю;
					Сообщение.Текст =	"Описанная в настройке загрузки колонка """+ОбрабатываемаяТабличнаяЧастьПриемникаРеквизитXDTO.КолонкаТоваров
						+""" табличной части """+XDTOСтруктураНастройка.ОсновнойОбъектПриемник.ТипОбъектаМетаданных+"."
						+XDTOСтруктураНастройка.ОсновнойОбъектПриемник.ИмяОбъектаМетаданных+"."
						+ОбрабатываемаяТабличнаяЧастьПриемникаРеквизитXDTO.ИмяОбъектаМетаданных+""" не обнаружена!";
					Сообщение.Сообщить();
					Возврат Ложь;	
				КонецЕсли;
			Иначе
				Сообщение = Новый СообщениеПользователю;
				Сообщение.Текст =	"Табличная часть """+XDTOСтруктураНастройка.ОсновнойОбъектПриемник.ТипОбъектаМетаданных+"."
					+XDTOСтруктураНастройка.ОсновнойОбъектПриемник.ИмяОбъектаМетаданных+"."
					+ОбрабатываемаяТабличнаяЧастьПриемникаРеквизитXDTO.ИмяОбъектаМетаданных+""" объявлена как таблица товаров документа, но наименование колонки товаров не указано!";
				Сообщение.Сообщить();
				Возврат Ложь;	
			КонецЕсли;
			ВходящиеПеременные.Вставить("ТаблицаСопоставленияНоменклатуры", ТаблицаСопоставленияНоменклатуры);
		КонецЕсли;
	 	
		ОбрабатываемаяТабличнаяЧастьПриемникаОбъектМетаданных = ОбъектМетаданыхПриемника.ТабличныеЧасти[ОбрабатываемаяТабличнаяЧастьПриемникаРеквизитXDTO.ИмяОбъектаМетаданных];
		
		Если ТипЗнч(УзелДанных) = Тип("СписокXDTO") Тогда 
			
			#Область ЕслиМногоСтрок
			
			СтрокиДокументаСписокXDTO = УзелДанных;
			
			Для Каждого СтрокаДокументаОбъектXDTO из СтрокиДокументаСписокXDTO Цикл
				
				Если НЕ ОбрабатываемаяТабличнаяЧастьПриемникаРеквизитXDTO.Свойства().Получить("УсловияЗагрузкиСтроки") = Неопределено Тогда
					УсловиеЗагрузкиВыполнено = Ложь;
					УсловиеЗагрузкиВыполнено = РезультатОбработкиУсловия(СтрокаДокументаОбъектXDTO, ОбрабатываемаяТабличнаяЧастьПриемникаРеквизитXDTO, ОбъектПриемник, , ВходящиеПеременные);
					Если УсловиеЗагрузкиВыполнено = Ложь Тогда
						Продолжить;	
					КонецЕсли;	
				КонецЕсли;
				
				НоваяСтрока = ОбъектПриемник[ОбрабатываемаяТабличнаяЧастьПриемникаРеквизитXDTO.ИмяОбъектаМетаданных].Добавить();
				
				Для Каждого КолонкаТабличнойЧастиСвойствоXDTO из ОбрабатываемаяТабличнаяЧастьПриемникаРеквизитXDTO.КолонкиТабличнойЧасти.Свойства() Цикл
					
					КолонкаТабличойЧастиОбъектXDTO = ОбрабатываемаяТабличнаяЧастьПриемникаРеквизитXDTO.КолонкиТабличнойЧасти[КолонкаТабличнойЧастиСвойствоXDTO.Имя];
					
					Если ТаблицаОбъектМетаданных.Реквизиты.Найти(КолонкаТабличойЧастиОбъектXDTO.ИмяОбъектаМетаданных) = Неопределено Тогда
						Сообщение = Новый СообщениеПользователю;
						Сообщение.Текст =	"Описанная в настройке загрузки колонка """+КолонкаТабличойЧастиОбъектXDTO.ИмяОбъектаМетаданных
						+""" табличной части """+XDTOСтруктураНастройка.ОсновнойОбъектПриемник.ТипОбъектаМетаданных+"."
						+XDTOСтруктураНастройка.ОсновнойОбъектПриемник.ИмяОбъектаМетаданных+"."
						+ОбрабатываемаяТабличнаяЧастьПриемникаРеквизитXDTO.ИмяОбъектаМетаданных+""" не обнаружена!";
						Сообщение.Сообщить();
						Возврат Ложь;
					КонецЕсли;
					
					Если НЕ КолонкаТабличойЧастиОбъектXDTO.Свойства().Получить("УсловияЗаполнения") = Неопределено Тогда	
						УсловиеВыполнено = РезультатОбработкиУсловия(XDTOСтруктураДанные, КолонкаТабличойЧастиОбъектXDTO, ОбъектПриемник, НоваяСтрока, ВходящиеПеременные);
						Если УсловиеВыполнено = Ложь Тогда
							Продолжить;
						КонецЕсли;	
					КонецЕсли;
					
					ЗначениеКолонки = РассчитатьЗначениеРеквизитаПоМетодуРасчета(КолонкаТабличойЧастиОбъектXDTO, 
					КолонкаТабличойЧастиОбъектXDTO.Источник.МетодРасчетаЗначения, 
					СтрокаДокументаОбъектXDTO, ОбъектПриемник, НоваяСтрока, Истина, ВходящиеПеременные);
					Если ЗначениеКолонки = Неопределено Тогда
						Возврат Ложь;
					КонецЕсли;
					
					НоваяСтрока[КолонкаТабличойЧастиОбъектXDTO.ИмяОбъектаМетаданных] = ЗначениеКолонки; 
					
				КонецЦикла;	
				
				ВыполнитьДополнительныеПроцедурыЗаполненияСтрокиТабличнойЧастиДокумента(XDTOСтруктураДанные, СтрокаДокументаОбъектXDTO, 
																						ОбрабатываемаяТабличнаяЧастьПриемникаРеквизитXDTO, 
																						ОбъектМетаданыхПриемника, ОбъектПриемник, НоваяСтрока);
				
			КонецЦикла;
			
			#КонецОбласти
			
		Иначе
			
			#Область ЕслиОднаСтрока
			
			СтрокаДокументаОбъектXDTO = УзелДанных;
			
			Если НЕ ОбрабатываемаяТабличнаяЧастьПриемникаРеквизитXDTO.Свойства().Получить("УсловияЗагрузкиСтроки") = Неопределено Тогда
				УсловиеЗагрузкиВыполнено = Ложь;
				УсловиеЗагрузкиВыполнено = РезультатОбработкиУсловия(СтрокаДокументаОбъектXDTO, ОбрабатываемаяТабличнаяЧастьПриемникаРеквизитXDTO, ОбъектПриемник, , ВходящиеПеременные);
				Если УсловиеЗагрузкиВыполнено = Ложь Тогда
					// Строка не попадает под условия загрузки.
					Возврат Истина;	
				КонецЕсли;	
			КонецЕсли;	
			
			НоваяСтрока = ОбъектПриемник[ОбрабатываемаяТабличнаяЧастьПриемникаРеквизитXDTO.ИмяОбъектаМетаданных].Добавить();
			
			Для Каждого КолонкаТабличнойЧастиСвойствоXDTO из ОбрабатываемаяТабличнаяЧастьПриемникаРеквизитXDTO.КолонкиТабличнойЧасти.Свойства() Цикл
				
				КолонкаТабличойЧастиОбъектXDTO = ОбрабатываемаяТабличнаяЧастьПриемникаРеквизитXDTO.КолонкиТабличнойЧасти[КолонкаТабличнойЧастиСвойствоXDTO.Имя];
				
				Если ТаблицаОбъектМетаданных.Реквизиты.Найти(КолонкаТабличойЧастиОбъектXDTO.ИмяОбъектаМетаданных) = Неопределено Тогда
					Сообщение = Новый СообщениеПользователю;
					Сообщение.Текст =	"Описанная в настройке загрузки колонка """+КолонкаТабличойЧастиОбъектXDTO.ИмяОбъектаМетаданных
					+""" табличной части """+XDTOСтруктураНастройка.ОсновнойОбъектПриемник.ТипОбъектаМетаданных+"."
					+XDTOСтруктураНастройка.ОсновнойОбъектПриемник.ИмяОбъектаМетаданных+"."
					+ОбрабатываемаяТабличнаяЧастьПриемникаРеквизитXDTO.ИмяОбъектаМетаданных+""" не обнаружена!";
					Сообщение.Сообщить();
					Возврат Ложь;
				КонецЕсли;
				
				Если НЕ КолонкаТабличойЧастиОбъектXDTO.Свойства().Получить("УсловияЗаполнения") = Неопределено Тогда	
					УсловиеВыполнено = РезультатОбработкиУсловия(СтрокаДокументаОбъектXDTO, КолонкаТабличойЧастиОбъектXDTO, ОбъектПриемник, НоваяСтрока, ВходящиеПеременные);
					Если УсловиеВыполнено = Ложь Тогда
						Продолжить;
					КонецЕсли;	
				КонецЕсли;
				
				ЗначениеКолонки = РассчитатьЗначениеРеквизитаПоМетодуРасчета(КолонкаТабличойЧастиОбъектXDTO, 
				КолонкаТабличойЧастиОбъектXDTO.Источник.МетодРасчетаЗначения, 
				СтрокаДокументаОбъектXDTO, ОбъектПриемник, НоваяСтрока, Истина, ВходящиеПеременные);
				Если ЗначениеКолонки = Неопределено Тогда
					Возврат Ложь;
				КонецЕсли;
				
				НоваяСтрока[КолонкаТабличойЧастиОбъектXDTO.ИмяОбъектаМетаданных] = ЗначениеКолонки; 
				
			КонецЦикла;
			
			ВыполнитьДополнительныеПроцедурыЗаполненияСтрокиТабличнойЧастиДокумента(XDTOСтруктураДанные, СтрокаДокументаОбъектXDTO, 
																					ОбрабатываемаяТабличнаяЧастьПриемникаРеквизитXDTO, 
																					ОбъектМетаданыхПриемника, ОбъектПриемник, НоваяСтрока);
			
			#КонецОбласти
			
		КонецЕсли;
	
	КонецЦикла;
	
	Возврат Истина;
	
КонецФункции	

&НаСервереБезКонтекста
Функция ЗаполнитьТабличныеЧастиДокумента(XDTOСтруктураДанные, XDTOСтруктураНастройка, ОбъектМетаданыхПриемника, ОбъектПриемник, ТаблицаСопоставленияНоменклатуры = Неопределено)
	
	Для каждого ТабличнаяЧастьПриемникаСвойствоXDTO из XDTOСтруктураНастройка.ОсновнойОбъектПриемник.ТабличныеЧасти.Свойства() Цикл
				
		ОбрабатываемаяТабличнаяЧастьПриемникаРеквизитXDTO = XDTOСтруктураНастройка.ОсновнойОбъектПриемник.ТабличныеЧасти[ТабличнаяЧастьПриемникаСвойствоXDTO.Имя];
		
		Если ОбъектМетаданыхПриемника.ТабличныеЧасти.Найти(ОбрабатываемаяТабличнаяЧастьПриемникаРеквизитXDTO.ИмяОбъектаМетаданных) = Неопределено Тогда
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст =	"Описанная в настройке загрузки табличная часть """+XDTOСтруктураНастройка.ОсновнойОбъектПриемник.ТипОбъектаМетаданных+"."
								+XDTOСтруктураНастройка.ОсновнойОбъектПриемник.ИмяОбъектаМетаданных+"."
								+ОбрабатываемаяТабличнаяЧастьПриемникаРеквизитXDTO.ИмяОбъектаМетаданных+""" не обнаружена!";
			Сообщение.Сообщить();
			Возврат Ложь;
		КонецЕсли;	
		
		ПутьКСпискуСтрок				= ОбрабатываемаяТабличнаяЧастьПриемникаРеквизитXDTO.ПутьКСпискуСтрок;
		ПутьКСпискуСтрокМассив			= СтрРазделить(ОбрабатываемаяТабличнаяЧастьПриемникаРеквизитXDTO.ПутьКСпискуСтрок, ".");
		ИндексЭлементаПутиКСпискуСтрок	= 0;
		УзелДанных = XDTOСтруктураДанные;
		
		СтруктураОбработкиЭлементаПутиКДанным = Новый Структура;
		СтруктураОбработкиЭлементаПутиКДанным.Вставить("УзелДанных", УзелДанных);
		СтруктураОбработкиЭлементаПутиКДанным.Вставить("ПутьКСпискуСтрокМассив", ПутьКСпискуСтрокМассив);
		СтруктураОбработкиЭлементаПутиКДанным.Вставить("ИндексЭлементаПутиКСпискуСтрок", ИндексЭлементаПутиКСпискуСтрок);
		СтруктураОбработкиЭлементаПутиКДанным.Вставить("ПутьКСпискуСтрок", ПутьКСпискуСтрок);
		СтруктураОбработкиЭлементаПутиКДанным.Вставить("ОбъектПриемник", ОбъектПриемник);
		СтруктураОбработкиЭлементаПутиКДанным.Вставить("ОбъектМетаданыхПриемника", ОбъектМетаданыхПриемника);
		СтруктураОбработкиЭлементаПутиКДанным.Вставить("XDTOСтруктураДанные", XDTOСтруктураДанные);
		СтруктураОбработкиЭлементаПутиКДанным.Вставить("XDTOСтруктураНастройка", XDTOСтруктураНастройка);
		СтруктураОбработкиЭлементаПутиКДанным.Вставить("ОбрабатываемаяТабличнаяЧастьПриемникаРеквизитXDTO", ОбрабатываемаяТабличнаяЧастьПриемникаРеквизитXDTO);
		СтруктураОбработкиЭлементаПутиКДанным.Вставить("ТаблицаСопоставленияНоменклатуры", ТаблицаСопоставленияНоменклатуры);
		
		ЭлементОбработан = ЗаполнениеТабличнойЧастиДокумента_ОбработатьЭлементПутиКДанным(СтруктураОбработкиЭлементаПутиКДанным);
		
		Если ЭлементОбработан = Истина Тогда
			Продолжить
		Иначе
			Возврат ЭлементОбработан; 
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат Истина;
	
КонецФункции

&НаСервереБезКонтекста
Функция ЗаполнениеТабличнойЧастиДокумента_ОбработатьЭлементПутиКДанным(СтруктураОбработкиЭлементаПутиКДанным)

	УзелДанных											= СтруктураОбработкиЭлементаПутиКДанным.УзелДанных;
	ПутьКСпискуСтрокМассив								= СтруктураОбработкиЭлементаПутиКДанным.ПутьКСпискуСтрокМассив;
	ИндексЭлементаПутиКСпискуСтрок						= СтруктураОбработкиЭлементаПутиКДанным.ИндексЭлементаПутиКСпискуСтрок;
	ПутьКСпискуСтрок									= СтруктураОбработкиЭлементаПутиКДанным.ПутьКСпискуСтрок;
	ОбъектПриемник										= СтруктураОбработкиЭлементаПутиКДанным.ОбъектПриемник;
	ОбъектМетаданыхПриемника							= СтруктураОбработкиЭлементаПутиКДанным.ОбъектМетаданыхПриемника;
	XDTOСтруктураДанные									= СтруктураОбработкиЭлементаПутиКДанным.XDTOСтруктураДанные;
	XDTOСтруктураНастройка								= СтруктураОбработкиЭлементаПутиКДанным.XDTOСтруктураНастройка;
	ОбрабатываемаяТабличнаяЧастьПриемникаРеквизитXDTO	= СтруктураОбработкиЭлементаПутиКДанным.ОбрабатываемаяТабличнаяЧастьПриемникаРеквизитXDTO;
	ТаблицаСопоставленияНоменклатуры					= СтруктураОбработкиЭлементаПутиКДанным.ТаблицаСопоставленияНоменклатуры;
	
	ОбрабатываетсяПоследнийЭлементПути = ПутьКСпискуСтрокМассив.Количество() = ИндексЭлементаПутиКСпискуСтрок + 1;
	
	Если ТипЗнч(УзелДанных) = Тип("СписокXDTO") Тогда
		
		ИндексДоНачалаРазбораСписка = ИндексЭлементаПутиКСпискуСтрок;
		Для Каждого ЭлементXDTO из УзелДанных Цикл
			СтруктураОбработкиЭлементаПутиКДанным.Вставить("УзелДанных", ЭлементXDTO);
			ЭлементОбработан = ЗаполнениеТабличнойЧастиДокумента_ОбработатьЭлементПутиКДанным(СтруктураОбработкиЭлементаПутиКДанным);
			Если ЭлементОбработан Тогда
				СтруктураОбработкиЭлементаПутиКДанным.Вставить("ИндексЭлементаПутиКСпискуСтрок", ИндексДоНачалаРазбораСписка);
				Продолжить;
			Иначе
				Возврат Ложь;
			КонецЕсли;				
		КонецЦикла;
		
	ИначеЕсли НЕ ОбрабатываетсяПоследнийЭлементПути Тогда 
		
		ЭлементПути = ПутьКСпискуСтрокМассив[ИндексЭлементаПутиКСпискуСтрок];
		
		Если УзелДанных.Свойства().Получить(ЭлементПути) = Неопределено Тогда
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст =	"При заполнении табличной части """+XDTOСтруктураНастройка.ОсновнойОбъектПриемник.ТипОбъектаМетаданных+"."
				+XDTOСтруктураНастройка.ОсновнойОбъектПриемник.ИмяОбъектаМетаданных+"."+ОбрабатываемаяТабличнаяЧастьПриемникаРеквизитXDTO.ИмяОбъектаМетаданных
				+""" произошла ошибка."+Символы.ПС+"Параметр ""ПутьКСпискуСтрок"", указан некорректно."+Символы.ПС
				+"Значение параметра "+ПутьКСпискуСтрок;
			Сообщение.Сообщить();
			Возврат Ложь;	
		Иначе	
			УзелДанных = УзелДанных[ЭлементПути];
			ИндексЭлементаПутиКСпискуСтрок = ИндексЭлементаПутиКСпискуСтрок + 1;
			СтруктураОбработкиЭлементаПутиКДанным.Вставить("УзелДанных", УзелДанных);
			СтруктураОбработкиЭлементаПутиКДанным.Вставить("ИндексЭлементаПутиКСпискуСтрок", ИндексЭлементаПутиКСпискуСтрок);
			ЭлементОбработан = ЗаполнениеТабличнойЧастиДокумента_ОбработатьЭлементПутиКДанным(СтруктураОбработкиЭлементаПутиКДанным);
			Возврат ЭлементОбработан; 
		КонецЕсли;	
		
	ИначеЕсли ОбрабатываетсяПоследнийЭлементПути Тогда 	
	
		ВходящиеПеременные = Новый Структура;
		
		ОбрабатываетсяТаблицаТоваров = Ложь;
		
		ТаблицаОбъектМетаданных = ОбъектМетаданыхПриемника.ТабличныеЧасти[ОбрабатываемаяТабличнаяЧастьПриемникаРеквизитXDTO.ИмяОбъектаМетаданных];
		
		ЭлементПути = ПутьКСпискуСтрокМассив[ИндексЭлементаПутиКСпискуСтрок];
		
		Если УзелДанных.Свойства().Получить(ЭлементПути) = Неопределено Тогда
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст =	"При заполнении табличной части """+XDTOСтруктураНастройка.ОсновнойОбъектПриемник.ТипОбъектаМетаданных+"."
				+XDTOСтруктураНастройка.ОсновнойОбъектПриемник.ИмяОбъектаМетаданных+"."+ОбрабатываемаяТабличнаяЧастьПриемникаРеквизитXDTO.ИмяОбъектаМетаданных
				+""" произошла ошибка."+Символы.ПС+"Параметр ""ПутьКСпискуСтрок"", указан некорректно."+Символы.ПС
				+"Значение параметра "+ПутьКСпискуСтрок;
			Сообщение.Сообщить();
			Возврат Ложь;	
		КонецЕсли;
		
		УзелДанных = УзелДанных[ЭлементПути];
		
		Если НЕ ОбрабатываемаяТабличнаяЧастьПриемникаРеквизитXDTO.Свойства().Получить("ТаблицаТоваров") = Неопределено
			И ОбрабатываемаяТабличнаяЧастьПриемникаРеквизитXDTO.ТаблицаТоваров = "Истина" Тогда
			ОбрабатываетсяТаблицаТоваров = Истина;	
		КонецЕсли;
		
		Если ОбрабатываетсяТаблицаТоваров Тогда
			
			Если ТаблицаСопоставленияНоменклатуры = Неопределено Тогда
				Сообщение = Новый СообщениеПользователю;
				Сообщение.Текст = "Описанная в настройке загрузки табличная часть """+XDTOСтруктураНастройка.ОсновнойОбъектПриемник.ТипОбъектаМетаданных+"."
					+XDTOСтруктураНастройка.ОсновнойОбъектПриемник.ИмяОбъектаМетаданных+"."
					+ОбрабатываемаяТабличнаяЧастьПриемникаРеквизитXDTO.ИмяОбъектаМетаданных+""", помеченная как таблица,"
					+Символы.ПС+" содержащая товарные позиции, не может быть обработана, поскольку не обнаружена таблица сопоставления товарных позиций!"
					+Символы.ПС+"Проверьте заполненность таблицы сопоставления."
					+Символы.ПС+"Попробуйте повторить процедуру сопоставления.";
				Сообщение.Сообщить();
				Возврат Ложь;
			КонецЕсли;
			Если НЕ ОбрабатываемаяТабличнаяЧастьПриемникаРеквизитXDTO.Свойства().Получить("КолонкаТоваров") = Неопределено Тогда 
				Если ТаблицаОбъектМетаданных.Реквизиты.Найти(ОбрабатываемаяТабличнаяЧастьПриемникаРеквизитXDTO.КолонкаТоваров) = Неопределено Тогда		
					Сообщение = Новый СообщениеПользователю;
					Сообщение.Текст =	"Описанная в настройке загрузки колонка """+ОбрабатываемаяТабличнаяЧастьПриемникаРеквизитXDTO.КолонкаТоваров
						+""" табличной части """+XDTOСтруктураНастройка.ОсновнойОбъектПриемник.ТипОбъектаМетаданных+"."
						+XDTOСтруктураНастройка.ОсновнойОбъектПриемник.ИмяОбъектаМетаданных+"."
						+ОбрабатываемаяТабличнаяЧастьПриемникаРеквизитXDTO.ИмяОбъектаМетаданных+""" не обнаружена!";
					Сообщение.Сообщить();
					Возврат Ложь;	
				КонецЕсли;
			Иначе
				Сообщение = Новый СообщениеПользователю;
				Сообщение.Текст =	"Табличная часть """+XDTOСтруктураНастройка.ОсновнойОбъектПриемник.ТипОбъектаМетаданных+"."
					+XDTOСтруктураНастройка.ОсновнойОбъектПриемник.ИмяОбъектаМетаданных+"."
					+ОбрабатываемаяТабличнаяЧастьПриемникаРеквизитXDTO.ИмяОбъектаМетаданных+""" объявлена как таблица товаров документа, но наименование колонки товаров не указано!";
				Сообщение.Сообщить();
				Возврат Ложь;	
			КонецЕсли;
			ВходящиеПеременные.Вставить("ТаблицаСопоставленияНоменклатуры", ТаблицаСопоставленияНоменклатуры);
		КонецЕсли;
		
		ОбрабатываемаяТабличнаяЧастьПриемникаОбъектМетаданных = ОбъектМетаданыхПриемника.ТабличныеЧасти[ОбрабатываемаяТабличнаяЧастьПриемникаРеквизитXDTO.ИмяОбъектаМетаданных];
		
		Если ТипЗнч(УзелДанных) = Тип("СписокXDTO") Тогда 
			
		#Область ЕслиМногоСтрок
			
			СтрокиДокументаСписокXDTO = УзелДанных;
			
			Для Каждого СтрокаДокументаОбъектXDTO из СтрокиДокументаСписокXDTO Цикл
				
				Если НЕ ОбрабатываемаяТабличнаяЧастьПриемникаРеквизитXDTO.Свойства().Получить("УсловияЗагрузкиСтроки") = Неопределено Тогда
					УсловиеЗагрузкиВыполнено = Ложь;
					УсловиеЗагрузкиВыполнено = РезультатОбработкиУсловия(СтрокаДокументаОбъектXDTO, ОбрабатываемаяТабличнаяЧастьПриемникаРеквизитXDTO, ОбъектПриемник, , ВходящиеПеременные);
					Если УсловиеЗагрузкиВыполнено = Ложь Тогда
						Продолжить;	
					КонецЕсли;	
				КонецЕсли;
				
				НоваяСтрока = ОбъектПриемник[ОбрабатываемаяТабличнаяЧастьПриемникаРеквизитXDTO.ИмяОбъектаМетаданных].Добавить();
				
				Для Каждого КолонкаТабличнойЧастиСвойствоXDTO из ОбрабатываемаяТабличнаяЧастьПриемникаРеквизитXDTO.КолонкиТабличнойЧасти.Свойства() Цикл
					
					КолонкаТабличойЧастиОбъектXDTO = ОбрабатываемаяТабличнаяЧастьПриемникаРеквизитXDTO.КолонкиТабличнойЧасти[КолонкаТабличнойЧастиСвойствоXDTO.Имя];
					
					Если ТаблицаОбъектМетаданных.Реквизиты.Найти(КолонкаТабличойЧастиОбъектXDTO.ИмяОбъектаМетаданных) = Неопределено Тогда
						Сообщение = Новый СообщениеПользователю;
						Сообщение.Текст =	"Описанная в настройке загрузки колонка """+КолонкаТабличойЧастиОбъектXDTO.ИмяОбъектаМетаданных
							+""" табличной части """+XDTOСтруктураНастройка.ОсновнойОбъектПриемник.ТипОбъектаМетаданных+"."
							+XDTOСтруктураНастройка.ОсновнойОбъектПриемник.ИмяОбъектаМетаданных+"."
							+ОбрабатываемаяТабличнаяЧастьПриемникаРеквизитXDTO.ИмяОбъектаМетаданных+""" не обнаружена!";
						Сообщение.Сообщить();
						Возврат Ложь;
					КонецЕсли;
					
					Если НЕ КолонкаТабличойЧастиОбъектXDTO.Свойства().Получить("УсловияЗаполнения") = Неопределено Тогда	
						УсловиеВыполнено = РезультатОбработкиУсловия(XDTOСтруктураДанные, КолонкаТабличойЧастиОбъектXDTO, ОбъектПриемник, НоваяСтрока, ВходящиеПеременные);
						Если УсловиеВыполнено = Ложь Тогда
							Продолжить;
						КонецЕсли;	
					КонецЕсли;
					
					ЗначениеКолонки = РассчитатьЗначениеРеквизитаПоМетодуРасчета(КолонкаТабличойЧастиОбъектXDTO, 
					КолонкаТабличойЧастиОбъектXDTO.Источник.МетодРасчетаЗначения, 
					СтрокаДокументаОбъектXDTO, ОбъектПриемник, НоваяСтрока, Истина, ВходящиеПеременные);
					Если ЗначениеКолонки = Неопределено Тогда
						Возврат Ложь;
					КонецЕсли;
					
					НоваяСтрока[КолонкаТабличойЧастиОбъектXDTO.ИмяОбъектаМетаданных] = ЗначениеКолонки; 
					
				КонецЦикла;	
				
				ВыполнитьДополнительныеПроцедурыЗаполненияСтрокиТабличнойЧастиДокумента(XDTOСтруктураДанные, СтрокаДокументаОбъектXDTO, 
				ОбрабатываемаяТабличнаяЧастьПриемникаРеквизитXDTO, 
				ОбъектМетаданыхПриемника, ОбъектПриемник, НоваяСтрока);
				
			КонецЦикла;
			
		#КонецОбласти
			
		Иначе
			
		#Область ЕслиОднаСтрока
			
			СтрокаДокументаОбъектXDTO = УзелДанных;
			
			Если НЕ ОбрабатываемаяТабличнаяЧастьПриемникаРеквизитXDTO.Свойства().Получить("УсловияЗагрузкиСтроки") = Неопределено Тогда
				УсловиеЗагрузкиВыполнено = Ложь;
				УсловиеЗагрузкиВыполнено = РезультатОбработкиУсловия(СтрокаДокументаОбъектXDTO, ОбрабатываемаяТабличнаяЧастьПриемникаРеквизитXDTO, ОбъектПриемник, , ВходящиеПеременные);
				Если УсловиеЗагрузкиВыполнено = Ложь Тогда
					// Строка не попадает под условия загрузки.
					Возврат Истина;	
				КонецЕсли;	
			КонецЕсли;	
			
			НоваяСтрока = ОбъектПриемник[ОбрабатываемаяТабличнаяЧастьПриемникаРеквизитXDTO.ИмяОбъектаМетаданных].Добавить();
			
			Для Каждого КолонкаТабличнойЧастиСвойствоXDTO из ОбрабатываемаяТабличнаяЧастьПриемникаРеквизитXDTO.КолонкиТабличнойЧасти.Свойства() Цикл
				
				КолонкаТабличойЧастиОбъектXDTO = ОбрабатываемаяТабличнаяЧастьПриемникаРеквизитXDTO.КолонкиТабличнойЧасти[КолонкаТабличнойЧастиСвойствоXDTO.Имя];
				
				Если ТаблицаОбъектМетаданных.Реквизиты.Найти(КолонкаТабличойЧастиОбъектXDTO.ИмяОбъектаМетаданных) = Неопределено Тогда
					Сообщение = Новый СообщениеПользователю;
					Сообщение.Текст =	"Описанная в настройке загрузки колонка """+КолонкаТабличойЧастиОбъектXDTO.ИмяОбъектаМетаданных
						+""" табличной части """+XDTOСтруктураНастройка.ОсновнойОбъектПриемник.ТипОбъектаМетаданных+"."
						+XDTOСтруктураНастройка.ОсновнойОбъектПриемник.ИмяОбъектаМетаданных+"."
						+ОбрабатываемаяТабличнаяЧастьПриемникаРеквизитXDTO.ИмяОбъектаМетаданных+""" не обнаружена!";
					Сообщение.Сообщить();
					Возврат Ложь;
				КонецЕсли;
				
				Если НЕ КолонкаТабличойЧастиОбъектXDTO.Свойства().Получить("УсловияЗаполнения") = Неопределено Тогда	
					УсловиеВыполнено = РезультатОбработкиУсловия(СтрокаДокументаОбъектXDTO, КолонкаТабличойЧастиОбъектXDTO, ОбъектПриемник, НоваяСтрока, ВходящиеПеременные);
					Если УсловиеВыполнено = Ложь Тогда
						Продолжить;
					КонецЕсли;	
				КонецЕсли;
				
				ЗначениеКолонки = РассчитатьЗначениеРеквизитаПоМетодуРасчета(КолонкаТабличойЧастиОбъектXDTO, 
				КолонкаТабличойЧастиОбъектXDTO.Источник.МетодРасчетаЗначения, 
				СтрокаДокументаОбъектXDTO, ОбъектПриемник, НоваяСтрока, Истина, ВходящиеПеременные);
				Если ЗначениеКолонки = Неопределено Тогда
					Возврат Ложь;
				КонецЕсли;
				
				НоваяСтрока[КолонкаТабличойЧастиОбъектXDTO.ИмяОбъектаМетаданных] = ЗначениеКолонки; 
				
			КонецЦикла;
			
			ВыполнитьДополнительныеПроцедурыЗаполненияСтрокиТабличнойЧастиДокумента(XDTOСтруктураДанные, СтрокаДокументаОбъектXDTO, 
			ОбрабатываемаяТабличнаяЧастьПриемникаРеквизитXDTO, 
			ОбъектМетаданыхПриемника, ОбъектПриемник, НоваяСтрока);
			
		#КонецОбласти
			
		КонецЕсли;
		
		Возврат Истина;
	
	КонецЕсли;
	
КонецФункции	

&НаСервереБезКонтекста
Процедура ВыполнитьДополнительныеПроцедурыЗаполненияСтрокиТабличнойЧастиДокумента(XDTOСтруктураДанные, XDTOСтруктураДанныхСтроки, XDTOСтруктураСтроки, ОбъектМетаданыхПриемника, ОбъектПриемник, Строка)

	Для Каждого ДополнительнаяПроцедура из XDTOСтруктураСтроки.ВызовДополнительныхПроцедурПриЗаполненииСтроки.Свойства() Цикл
		
		ДополнительнаяПроцедураОбъектXDTO = XDTOСтруктураСтроки.ВызовДополнительныхПроцедурПриЗаполненииСтроки[ДополнительнаяПроцедура.Имя];
		
		ТекстКода = ДополнительнаяПроцедураОбъектXDTO.ТекстПроцедуры;
		
		XDTOВходящиеПараметры = ДополнительнаяПроцедураОбъектXDTO.ВходящиеПараметры;
		
		ВходящиеПараметры = Новый Структура;
		ВходящиеПараметры.Вставить("ОбъектПриемник", ОбъектПриемник);
		ВходящиеПараметры.Вставить("Строка", Строка);
		
		Для Каждого XDTOВходящийПараметрСвойство из XDTOВходящиеПараметры.Свойства() Цикл
			
			XDTOВходящийПараметр = XDTOВходящиеПараметры[XDTOВходящийПараметрСвойство.Имя];
			МетодРасчетаЗначенияПараметра = XDTOВходящийПараметр.Источник.МетодРасчетаЗначения;
			
			ИмяПараметраЗапроса = XDTOВходящийПараметр.ИмяПараметра;
			ЗначениеВходящегоПараметра = РассчитатьЗначениеРеквизитаПоМетодуРасчета(XDTOВходящийПараметр, МетодРасчетаЗначенияПараметра, XDTOСтруктураДанные, ОбъектПриемник);
			
			Если ЗначениеВходящегоПараметра = Неопределено Тогда
				Возврат;
			КонецЕсли;	
			
			ВходящиеПараметры.Вставить(XDTOВходящийПараметрСвойство.Имя, ЗначениеВходящегоПараметра);
			
		КонецЦикла;
		
		Попытка
			
			Выполнить(ТекстКода);
			
		Исключение
			
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст =	"При выполнении дополнительной процедуры """+ДополнительнаяПроцедура.Имя+""" произошла ошибка."+Символы.ПС
			+"Проверьте текст кода на корректность."+Символы.ПС+"Текст кода:"+Символы.ПС+ТекстКода;
			Сообщение.Сообщить();
			Возврат;	
			
		КонецПопытки;
		
	КонецЦикла;
	
КонецПроцедуры

//&НаСервереБезКонтекста
&НаСервере
Процедура ВыполнитьДополнительныеПроцедурыЗаполненияДокумента(XDTOСтруктураДанные, XDTOСтруктураНастройка, ОбъектМетаданыхПриемника, ОбъектПриемник)

	Для Каждого ДополнительнаяПроцедура из XDTOСтруктураНастройка.ОсновнойОбъектПриемник.ВызовДополнительныхПроцедур.Свойства() Цикл
		
		ДополнительнаяПроцедураОбъектXDTO = XDTOСтруктураНастройка.ОсновнойОбъектПриемник.ВызовДополнительныхПроцедур[ДополнительнаяПроцедура.Имя];
		
		ТекстКода = ДополнительнаяПроцедураОбъектXDTO.ТекстПроцедуры;
		
		XDTOВходящиеПараметры = ДополнительнаяПроцедураОбъектXDTO.ВходящиеПараметры;
		
		ВходящиеПараметры = Новый Структура;
		ВходящиеПараметры.Вставить("ОбъектПриемник", ОбъектПриемник);
		
		Для Каждого XDTOВходящийПараметрСвойство из XDTOВходящиеПараметры.Свойства() Цикл
			
			XDTOВходящийПараметр = XDTOВходящиеПараметры[XDTOВходящийПараметрСвойство.Имя];
			МетодРасчетаЗначенияПараметра = XDTOВходящийПараметр.Источник.МетодРасчетаЗначения;
			
			ИмяПараметраЗапроса = XDTOВходящийПараметр.ИмяПараметра;
			ЗначениеВходящегоПараметра = РассчитатьЗначениеРеквизитаПоМетодуРасчета(XDTOВходящийПараметр, МетодРасчетаЗначенияПараметра, XDTOСтруктураДанные, ОбъектПриемник);
			
			Если ЗначениеВходящегоПараметра = Неопределено Тогда
				Возврат;
			КонецЕсли;	
			
			ВходящиеПараметры.Вставить(XDTOВходящийПараметрСвойство.Имя, ЗначениеВходящегоПараметра);
			
		КонецЦикла;
		
		Попытка
			
			Выполнить(ТекстКода);
						
		Исключение
			
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст =	"При выполнении дополнительной процедуры """+ДополнительнаяПроцедура.Имя+""" произошла ошибка."+Символы.ПС
			+"Проверьте текст кода на корректность."+Символы.ПС+"Текст кода:"+Символы.ПС+ТекстКода;
			Сообщение.Сообщить();
			Возврат;	
			
		КонецПопытки;
		
	КонецЦикла;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция СоздатьИЗаполнитьДополнительныеОбъекты(XDTOСтруктураДанные, XDTOСтруктураНастройка, ОбъектМетаданыхПриемника, ОбъектПриемник)
	
	Для Каждого ДополнительныйОбъект из XDTOСтруктураНастройка.ДополнительныеОбъекты.Свойства() Цикл
		
		ДополнительныйОбъектОбъектXDTO = XDTOСтруктураНастройка.ДополнительныеОбъекты[ДополнительныйОбъект.Имя];
		ПризнакСозданияДопОбъектаXDTO = ДополнительныйОбъектОбъектXDTO.ПризнакИспользования.Признак;
		ПризнакСравненияСозданияДопОбъектаXDTO = ДополнительныйОбъектОбъектXDTO.ПризнакИспользования.ПризнакСравнения;
		
		ПризнакСозданияДопОбъектаЗначение = РассчитатьЗначениеРеквизитаПоМетодуРасчета(ПризнакСозданияДопОбъектаXDTO, ПризнакСозданияДопОбъектаXDTO.Источник.МетодРасчетаЗначения, XDTOСтруктураДанные);
		ПризнакСравненияСозданияДопОбъектааЗначение = РассчитатьЗначениеРеквизитаПоМетодуРасчета(ПризнакСравненияСозданияДопОбъектаXDTO, ПризнакСравненияСозданияДопОбъектаXDTO.Источник.МетодРасчетаЗначения, XDTOСтруктураДанные);
		
		Если НЕ ПризнакСозданияДопОбъектаЗначение = ПризнакСравненияСозданияДопОбъектааЗначение Тогда
			Продолжить;
		КонецЕсли;
		
		// Сам объект.
		Если Метаданные[ДополнительныйОбъектОбъектXDTO.ТипОбъектаМетаданных].Найти(ДополнительныйОбъектОбъектXDTO.ИмяОбъектаМетаданных) = Неопределено Тогда
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст =	"Описанный в настройке загрузки объект метаданных "+ДополнительныйОбъектОбъектXDTO.ТипОбъектаМетаданных+"."
								+ДополнительныйОбъектОбъектXDTO.ИмяОбъектаМетаданных+" не обнаружен!";
			Сообщение.Сообщить();
			Возврат Ложь;
		КонецЕсли;	
		
		ОбъектМетаданыхДополнительногоОбъекта = Метаданные[ДополнительныйОбъектОбъектXDTO.ТипОбъектаМетаданных][ДополнительныйОбъектОбъектXDTO.ИмяОбъектаМетаданных];
		
		Если ДополнительныйОбъектОбъектXDTO.ТипОбъектаМетаданных = "Документы" Тогда
			СозданныйДополнительныйОбъект = Документы[ДополнительныйОбъектОбъектXDTO.ИмяОбъектаМетаданных].СоздатьДокумент();
		ИначеЕсли ДополнительныйОбъектОбъектXDTO.ТипОбъектаМетаданных = "Справочники" Тогда
			СозданныйДополнительныйОбъект = Справочники[ДополнительныйОбъектОбъектXDTO.ИмяОбъектаМетаданных].СоздатьЭлемент();
		Иначе
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст =	"Описанный в настройке загрузки тип объекта метаданных "+ДополнительныйОбъектОбъектXDTO.ТипОбъектаМетаданных
								+" не поддерживается для загрузки на данный момент."+Символы.ПС+"На данный момент загрузать данные можно только в справочники и документы.";
			Сообщение.Сообщить();
			Возврат Ложь;
		КонецЕсли;
		
		Если ДополнительныйОбъектОбъектXDTO.ОбработкаЗаполнения = "Истина" Тогда
		
			// Определяем параметры заполнения.
			ДанныеЗаполнения = Новый Структура();
			Для Каждого ЭлементДанныхЗаполнения из ДополнительныйОбъектОбъектXDTO.ДанныеЗаполнения.Свойства() Цикл
				
				ЭлементДанныхЗаполненияОбъектXDTO = ДополнительныйОбъектОбъектXDTO.ДанныеЗаполнения[ЭлементДанныхЗаполнения.Имя]; 
				МетодРасчетаЗначения = ЭлементДанныхЗаполненияОбъектXDTO.Источник.МетодРасчетаЗначения;
				ЗначениеЭлементаДанныхЗаполнения = РассчитатьЗначениеРеквизитаПоМетодуРасчета(ЭлементДанныхЗаполненияОбъектXDTO, МетодРасчетаЗначения, XDTOСтруктураДанные, ОбъектПриемник);		
				
				Если ЗначениеЭлементаДанныхЗаполнения = Неопределено Тогда
					Возврат Ложь;
				КонецЕсли;
				
				ДанныеЗаполнения.Вставить(ЭлементДанныхЗаполненияОбъектXDTO.ИмяПараметра, ЗначениеЭлементаДанныхЗаполнения);
				
			КонецЦикла;	
			
			СозданныйДополнительныйОбъект.Заполнить(ДанныеЗаполнения);
			
			// Дополнительные данные заполнения.
			// Непосредственное заполнение реквизитов.
			Для Каждого ЭлементДополнительныхДанныхЗаполнения из ДополнительныйОбъектОбъектXDTO.ДополнительныеДанныеЗаполнения.Реквизиты.Свойства() Цикл
				
				ЭлементДополнительныхДанныхЗаполненияОбъектXDTO = ДополнительныйОбъектОбъектXDTO.ДополнительныеДанныеЗаполнения.Реквизиты[ЭлементДополнительныхДанныхЗаполнения.Имя];
				МетодРасчетаЗначения = ЭлементДополнительныхДанныхЗаполненияОбъектXDTO.Источник.МетодРасчетаЗначения;
			
				// Проверяем существование реквизита.
				РеквизитДополнительногоОбъектаСуществует = ПроверкаСуществованияРеквизита(ОбъектМетаданыхДополнительногоОбъекта, ЭлементДополнительныхДанныхЗаполненияОбъектXDTO);
				Если НЕ РеквизитДополнительногоОбъектаСуществует Тогда
					Возврат Ложь;
				КонецЕсли;		
				
				ЗначениеРеквизитаДополнительногоОбъекта = РассчитатьЗначениеРеквизитаПоМетодуРасчета(ЭлементДополнительныхДанныхЗаполненияОбъектXDTO, 
																							МетодРасчетаЗначения, XDTOСтруктураДанные, ОбъектПриемник);		
				Если ЗначениеРеквизитаДополнительногоОбъекта = Неопределено Тогда
					Возврат Ложь;
				КонецЕсли;
				
				СозданныйДополнительныйОбъект[ЭлементДополнительныхДанныхЗаполненияОбъектXDTO.ИмяОбъектаМетаданных] = ЗначениеРеквизитаДополнительногоОбъекта;
				
			КонецЦикла;
			
			СозданныйДополнительныйОбъект.Записать(РежимЗаписиДокумента.Запись);
			
		ИначеЕсли ДополнительныйОбъектОбъектXDTO.ОбработкаЗаполнения = "Ложь" Тогда
			
			Если ДополнительныйОбъектОбъектXDTO.ПроизвольнаяПроцедураЗаполнения = "Истина" Тогда
				
				ТекстКода = ДополнительныйОбъектОбъектXDTO.ТекстПроцедуры;
		
				XDTOВходящиеПараметры = ДополнительныйОбъектОбъектXDTO.ВходящиеПараметры;
				
				ВходящиеПараметры = Новый Структура;
				ВходящиеПараметры.Вставить("ОбъектПриемник", ОбъектПриемник);
				
				Для Каждого XDTOВходящийПараметрСвойство из XDTOВходящиеПараметры.Свойства() Цикл
					
					XDTOВходящийПараметр = XDTOВходящиеПараметры[XDTOВходящийПараметрСвойство.Имя];
					МетодРасчетаЗначенияПараметра = XDTOВходящийПараметр.Источник.МетодРасчетаЗначения;
					
					ИмяПараметраЗапроса = XDTOВходящийПараметр.ИмяПараметра;
					ЗначениеВходящегоПараметра = РассчитатьЗначениеРеквизитаПоМетодуРасчета(XDTOВходящийПараметр, МетодРасчетаЗначенияПараметра, XDTOСтруктураДанные, ОбъектПриемник);
					
					Если ЗначениеВходящегоПараметра = Неопределено Тогда
						Возврат Ложь;
					КонецЕсли;	
					
					ВходящиеПараметры.Вставить(XDTOВходящийПараметрСвойство.Имя, ЗначениеВходящегоПараметра);
					
				КонецЦикла;
				
				Попытка
					
					Выполнить(ТекстКода);
								
				Исключение
					
					Сообщение = Новый СообщениеПользователю;
					Сообщение.Текст =	"При создании дополнительного объекта """+ДополнительныйОбъектОбъектXDTO.ИмяОбъектаМетаданных+""" посредством произвольной процедуры произошла ошибка."+Символы.ПС
					+"Проверьте текст кода на корректность."+Символы.ПС+"Текст кода:"+Символы.ПС+ТекстКода;
					Сообщение.Сообщить();
					Возврат Ложь;	
					
				КонецПопытки;
				
			Иначе
				
				Возврат Ложь;
				
			КонецЕсли;	
			
		Иначе
			
			Возврат Ложь;
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецФункции	
	
&НаСервереБезКонтекста
Функция ПроверкаФайлаНастройкиЗагрузкиНаСоответствиеФормату(XDTOСтруктураНастройка)
	
	Попытка
		
		ПроверяемыйОбъектXDTO = XDTOСтруктураНастройка.ПрефиксКонфигурации;
		ПроверяемыйОбъектXDTO = XDTOСтруктураНастройка.ОсновнойОбъектПриемник;
		ПроверяемыйОбъектXDTO = XDTOСтруктураНастройка.ОсновнойОбъектПриемник.ТипОбъектаМетаданных;
		ПроверяемыйОбъектXDTO = XDTOСтруктураНастройка.ОсновнойОбъектПриемник.ИмяОбъектаМетаданных;
		ПроверяемыйОбъектXDTO = XDTOСтруктураНастройка.ОсновнойОбъектПриемник.Реквизиты;
		ПроверяемыйОбъектXDTO = XDTOСтруктураНастройка.ОсновнойОбъектПриемник.ТабличныеЧасти;
		ПроверяемыйОбъектXDTO = XDTOСтруктураНастройка.ДополнительныеОбъекты;
		Для Каждого ПроверяемыйРеквизит Из XDTOСтруктураНастройка.ОсновнойОбъектПриемник.Реквизиты.Свойства() Цикл
			ПроверяемыйРеквизитОбъектXDTO = XDTOСтруктураНастройка.ОсновнойОбъектПриемник.Реквизиты[ПроверяемыйРеквизит.Имя];
			ПроверкаКорректностиОписанияУзлаРеквизита(ПроверяемыйРеквизитОбъектXDTO);
		КонецЦикла;
		Для Каждого ПроверяемаяТЧ из XDTOСтруктураНастройка.ОсновнойОбъектПриемник.ТабличныеЧасти.Свойства() Цикл 
			ПроверяемаяТЧОбъектXDTO = XDTOСтруктураНастройка.ОсновнойОбъектПриемник.ТабличныеЧасти[ПроверяемаяТЧ.Имя];
			ПроверяемыйОбъектXDTO = ПроверяемаяТЧОбъектXDTO.ИмяОбъектаМетаданных;
			ПроверяемыйОбъектXDTO = ПроверяемаяТЧОбъектXDTO.ПутьКСпискуСтрок;
			Для Каждого ПроверяемаяКолонкаТЧ из ПроверяемаяТЧОбъектXDTO.КолонкиТабличнойЧасти.Свойства() Цикл
				ПроверяемаяКолонкаТЧОбъектXDTO = ПроверяемаяТЧОбъектXDTO.КолонкиТабличнойЧасти[ПроверяемаяКолонкаТЧ.Имя];
				ПроверкаКорректностиОписанияУзлаРеквизита(ПроверяемаяКолонкаТЧОбъектXDTO);
			КонецЦикла;		
		КонецЦикла;
		Для Каждого ДополнительныйОбъект из XDTOСтруктураНастройка.ДополнительныеОбъекты.Свойства() Цикл
			ПроверяемыйДополнительныйОбъектОбъектXDTO = XDTOСтруктураНастройка.ДополнительныеОбъекты[ДополнительныйОбъект.Имя];
			ПроверяемыйОбъектXDTO = ПроверяемыйДополнительныйОбъектОбъектXDTO.ТипОбъектаМетаданных;
			ПроверяемыйОбъектXDTO = ПроверяемыйДополнительныйОбъектОбъектXDTO.ИмяОбъектаМетаданных;
			ПроверяемыйОбъектXDTO = ПроверяемыйДополнительныйОбъектОбъектXDTO.ОбработкаЗаполнения;
			Если ПроверяемыйДополнительныйОбъектОбъектXDTO.ОбработкаЗаполнения = "Истина" Тогда 
				ПроверяемыйОбъектXDTO = ПроверяемыйДополнительныйОбъектОбъектXDTO.ДанныеЗаполнения;
				Для Каждого ЭлементДанныхЗаполнения из ПроверяемыйОбъектXDTO.Свойства() Цикл
					ПроверяемыйЭлементДанныхЗаполненияОбъектXDTO = ПроверяемыйОбъектXDTO[ЭлементДанныхЗаполнения.Имя]; 
					ПроверкаКорректностиОписанияУзлаРеквизита(ПроверяемыйЭлементДанныхЗаполненияОбъектXDTO, Ложь, Истина);
				КонецЦикла;	
				ПроверяемыйОбъектXDTO = ПроверяемыйДополнительныйОбъектОбъектXDTO.ДополнительныеДанныеЗаполнения;
				ПроверяемыйОбъектXDTO = ПроверяемыйДополнительныйОбъектОбъектXDTO.ДополнительныеДанныеЗаполнения.Реквизиты;
				Для Каждого ЭлементДополнительныхДанныхЗаполнения из ПроверяемыйОбъектXDTO.Свойства() Цикл
					ПроверяемыйЭлементДополнительныхДанныхЗаполненияОбъектXDTO = ПроверяемыйОбъектXDTO[ЭлементДополнительныхДанныхЗаполнения.Имя];
					ПроверкаКорректностиОписанияУзлаРеквизита(ПроверяемыйЭлементДополнительныхДанныхЗаполненияОбъектXDTO);
				КонецЦикла;
			ИначеЕсли ПроверяемыйДополнительныйОбъектОбъектXDTO.ОбработкаЗаполнения = "Ложь" Тогда
				ПроверяемыйОбъектXDTO = ПроверяемыйДополнительныйОбъектОбъектXDTO.ПроизвольнаяПроцедураЗаполнения;
				ПроверяемыйОбъектXDTO = ПроверяемыйДополнительныйОбъектОбъектXDTO.ТекстПроцедуры;
				ПроверяемыйОбъектXDTO = ПроверяемыйДополнительныйОбъектОбъектXDTO.ВходящиеПараметры;
			Иначе
				// Сознательно вызываем ошибку.
				ПроверяемыйОбъектXDTO = ПроверяемыйДополнительныйОбъектОбъектXDTO.Ошибка;
			КонецЕсли;	
		КонецЦикла;
		
	Исключение
		
		Возврат Ложь;
		
	КонецПопытки;	
	
	Возврат Истина;
	
КонецФункции

&НаСервереБезКонтекста
Процедура ПроверкаКорректностиОписанияУзлаРеквизита(РеквизитОбъектXDTO, ЭтоПараметрЗапросаИлиФункции = Ложь, ЭтоЭлементДанныхЗаполнения = Ложь)

	Если НЕ ЭтоПараметрЗапросаИлиФункции И НЕ ЭтоЭлементДанныхЗаполнения Тогда 
		ПроверяемыйОбъектXDTO = РеквизитОбъектXDTO.ИмяОбъектаМетаданных;
		ПроверяемыйОбъектXDTO = РеквизитОбъектXDTO.СтандартныйРеквизит;
	КонецЕсли;
	ПроверяемыйОбъектXDTO = РеквизитОбъектXDTO.Источник;
	Если НЕ ЭтоЭлементДанныхЗаполнения Тогда
		ПроверяемыйОбъектXDTO = РеквизитОбъектXDTO.ТипЗначения;
	КонецЕсли;
	ПроверяемыйОбъектXDTO = РеквизитОбъектXDTO.Источник.МетодРасчетаЗначения;
	Если ПроверяемыйОбъектXDTO = "ФиксированноеЗначение" Тогда
		ПроверяемыйОбъектXDTO = РеквизитОбъектXDTO.Источник.ПутьКИсточнику;
	ИначеЕсли ПроверяемыйОбъектXDTO = "ИзВходящихДанных" Тогда 
		ПроверяемыйОбъектXDTO = РеквизитОбъектXDTO.Источник.ПутьКИсточнику;
	ИначеЕсли ПроверяемыйОбъектXDTO = "ИзРанееРассчитанныхДанных" Тогда
		ПроверяемыйОбъектXDTO = РеквизитОбъектXDTO.Источник.ПутьКИсточнику;	
	ИначеЕсли ПроверяемыйОбъектXDTO = "ПоискПоИндексированнымРеквизитам" Тогда
		ПроверяемыйОбъектXDTO = РеквизитОбъектXDTO.Источник.РеквизитыПоиска;
		Для Каждого ПроверяемыйРеквизитПоиска Из ПроверяемыйОбъектXDTO.Свойства() Цикл
			ПроверяемыйРеквизитПоискаОбъектXDTO = РеквизитОбъектXDTO.Источник.РеквизитыПоиска[ПроверяемыйРеквизитПоиска.Имя];
			ПроверкаКорректностиОписанияУзлаРеквизита(ПроверяемыйРеквизитПоискаОбъектXDTO);
		КонецЦикла;	
	ИначеЕсли ПроверяемыйОбъектXDTO = "РезультатЗапроса" Тогда
		ПроверяемыйОбъектXDTO = РеквизитОбъектXDTO.Источник.ТекстЗапроса;
		ПроверяемыйОбъектXDTO = РеквизитОбъектXDTO.Источник.ПараметрыЗапроса;
		Для Каждого ПроверяемыйПараметрЗапроса Из ПроверяемыйОбъектXDTO.Свойства() Цикл
			ПроверяемыйПараметрЗапросаОбъектXDTO = РеквизитОбъектXDTO.Источник.ПараметрыЗапроса[ПроверяемыйПараметрЗапроса.Имя];
			ПроверкаКорректностиОписанияУзлаРеквизита(ПроверяемыйПараметрЗапросаОбъектXDTO, Истина);
		КонецЦикла;
	ИначеЕсли ПроверяемыйОбъектXDTO = "РезультатВыполненияКода" Тогда
		ПроверяемыйОбъектXDTO = РеквизитОбъектXDTO.Источник.ТекстФункции;
		ПроверяемыйОбъектXDTO = РеквизитОбъектXDTO.Источник.ВходящиеПараметры;
		Для Каждого ПроверяемыйВходящийПараметрФункции Из ПроверяемыйОбъектXDTO.Свойства() Цикл
			ПроверяемыйВходящийПараметрФункцииОбъектXDTO = РеквизитОбъектXDTO.Источник.ВходящиеПараметры[ПроверяемыйВходящийПараметрФункции.Имя];
			ПроверкаКорректностиОписанияУзлаРеквизита(ПроверяемыйВходящийПараметрФункцииОбъектXDTO, Истина);
		КонецЦикла;
	ИначеЕсли ПроверяемыйОбъектXDTO = "СсылкаНаНовыйОбъект" Тогда
		Для Каждого ПроверяемыйРеквизитОбъекта Из РеквизитОбъектXDTO.Источник.РеквизитыНовогоОбъекта.Свойства() Цикл
			ПроверяемыйВходящийПараметрФункцииОбъектXDTO = РеквизитОбъектXDTO.Источник.РеквизитыНовогоОбъекта[ПроверяемыйРеквизитОбъекта.Имя];
			ПроверкаКорректностиОписанияУзлаРеквизита(ПроверяемыйВходящийПараметрФункцииОбъектXDTO, Истина);
		КонецЦикла;
	ИначеЕсли ПроверяемыйОбъектXDTO = "Перечисление" Тогда 
		ПроверяемыйОбъектXDTO = РеквизитОбъектXDTO.Источник.ПутьКИсточнику;
	ИначеЕсли ПроверяемыйОбъектXDTO = "Константа" Тогда
		ПроверяемыйОбъектXDTO = РеквизитОбъектXDTO.Источник.ПутьКИсточнику; 	
	Иначе
		// Вызываем исключение;
		ПроверяемыйОбъектXDTO = РеквизитОбъектXDTO.ИмяНесуществующегоОбъекта;
	КонецЕсли;	
	
КонецПроцедуры	

&НаСервереБезКонтекста
Функция ПолучитьФиксированноеЗначение(Значение, ТипЗначения, Имя = Неопределено)
	
	Если ТипЗначения = "Булево" Тогда
		Если Значение = "Истина" Тогда
			Возврат Истина;
		ИначеЕсли Значение = "Ложь" Тогда
			Возврат Ложь;
		Иначе
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = "При загрузке данных в реквизит "+Имя+" произошла ошибка."+Символы.ПС+"Значение """+Значение+""" не может быть приведено к типу """+ТипЗначения+""".";
			Сообщение.Сообщить();
			Возврат Неопределено;
		КонецЕсли;
	ИначеЕсли ТипЗначения = "Строка" Тогда
		Возврат Значение;
	ИначеЕсли ТипЗначения = "Число" Тогда
		Попытка
			Возврат Число(Значение);	
		Исключение
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = "При загрузке данных в реквизит "+Имя+" произошла ошибка."+Символы.ПС+"Значение """+Значение+""" не может быть приведено к типу """+ТипЗначения+""".";
			Сообщение.Сообщить();
			Возврат Неопределено;
		КонецПопытки;
	ИначеЕсли ТипЗначения = "Дата" Тогда
		Попытка
			Возврат Дата(Значение);	
		Исключение
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = "При загрузке данных в реквизит "+Имя+" произошла ошибка."+Символы.ПС+"Значение """+Значение+""" не может быть приведено к типу """+ТипЗначения+""".";
			Сообщение.Сообщить();
			Возврат Неопределено;
		КонецПопытки;
	КонецЕсли;	
			
	Возврат Неопределено;		
		
КонецФункции

&НаСервереБезКонтекста
Функция ПолучитьЗначениеИзВходящихДанных(XDTOСтруктураДанные, ПутьКИсточнику, ТипЗначения, Имя = Неопределено)
	
	ДанныеУзла = XDTOСтруктураДанные;
	ВариантыИсточника = СтрРазделить(ПутьКИсточнику, "|");
	ЗначениеРеквизитаИзДанных = "";
	
	Для Каждого ВариантИсточника Из ВариантыИсточника Цикл
		
		Попытка
		
			ПутьКИсточникуМассивУзлов = СтрРазделить(ВариантИсточника, ".");
			Если ПутьКИсточникуМассивУзлов.Количество() = 1 И ПутьКИсточникуМассивУзлов[0] = "" Тогда
				Продолжить;
			КонецЕсли;	
			
			Счетчик = 1;
			Для Каждого Узел Из ПутьКИсточникуМассивУзлов Цикл	
				Если СокрЛП(Узел) = "Владелец()" ИЛИ СокрЛП(Узел) = "Владелец"  Тогда
					ДанныеУзла = ДанныеУзла.Владелец();	
				Иначе		
					ДанныеУзла = ДанныеУзла.Получить(СокрЛП(Узел));
					Если Счетчик = ПутьКИсточникуМассивУзлов.Количество() Тогда
						ЗначениеРеквизитаИзДанных = ДанныеУзла;
						Прервать;
					КонецЕсли;	
				КонецЕсли;
				Счетчик = Счетчик + 1;	
			КонецЦикла;
			
			Если НЕ ЗначениеРеквизитаИзДанных = "" Тогда
				Прервать;
			КонецЕсли;	
			
		Исключение
			
			ДанныеУзла = XDTOСтруктураДанные;
			Продолжить;
			
		КонецПопытки;
	
	КонецЦикла;
	
	Если ТипЗначения = "Дата" Тогда		
		// Все параметры официальных форматов, сожержащие в себе дату, ВСЕГДА являются строками в 10 знаков.
		Если ЗначениеРеквизитаИзДанных = "" Тогда
			ЗначениеРеквизита = Дата("00010101");
		ИначеЕсли НЕ СтрДлина(ЗначениеРеквизитаИзДанных) = 10 Тогда
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = "При загрузке данных в реквизит "+Имя+" произошла ошибка."+Символы.ПС+"Значение """+ЗначениеРеквизитаИзДанных+""" не может быть приведено к типу"""+ТипЗначения+""".";
			Сообщение.Сообщить();
			Возврат Неопределено;
		Иначе
			ЗначениеРеквизитаИзДанных = ЗначениеРеквизитаИзДанных + " 00:00:00";
			ЗначениеРеквизита = Дата(ЗначениеРеквизитаИзДанных);
		КонецЕсли;			
	ИначеЕсли ТипЗначения = "Число" Тогда
		Если ЗначениеРеквизитаИзДанных = "" Тогда
			ЗначениеРеквизитаИзДанных = 0;
		КонецЕсли;
		Попытка
			ЗначениеРеквизита = Число(ЗначениеРеквизитаИзДанных);
		Исключение
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = "При загрузке данных в реквизит "+Имя+" произошла ошибка."+Символы.ПС+"Значение """+ЗначениеРеквизитаИзДанных+""" не может быть приведено к типу"""+ТипЗначения+""".";
			Сообщение.Сообщить();
			Возврат Неопределено;
		КонецПопытки;	
	ИначеЕсли ТипЗначения = "Строка" Тогда 
		ЗначениеРеквизита = ЗначениеРеквизитаИзДанных;
	Иначе
		// Не стоит забегать вперёд.
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "При загрузке данных в реквизит "+Имя+" произошла ошибка."+Символы.ПС+"Значение """+ЗначениеРеквизитаИзДанных+""" не может быть приведено к типу"""+ТипЗначения+"""."+Символы.ПС+"Этот тип данных не поддерживается.";
		Сообщение.Сообщить();
		Возврат Неопределено;
	КонецЕсли;
	
	Возврат ЗначениеРеквизита;
	
КонецФункции

&НаСервереБезКонтекста                  
Функция ПолучитьРезультатПоискаПоИндексированнымРеквизитам(XDTOСтруктураДанные, РеквизитыПоиска, ТипОбъектаМетаданных, ИмяОбъектаМетаданных, ОбъектПриемник, ЗаполняемаяСтрока = Неопределено, СообщатьОПустомРезультате = Истина)
	
	РезультатПоиска = Неопределено;
	
	Если Метаданные[ТипОбъектаМетаданных].Найти(ИмяОбъектаМетаданных) = Неопределено Тогда
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Объявленный в настройке загрузки объект метаданных """+ТипОбъектаМетаданных+"."+ИмяОбъектаМетаданных+""" не обнаружен.";
		Сообщение.Сообщить();
		Возврат Неопределено;	
	КонецЕсли;	
	
	Если ТипОбъектаМетаданных = "Документы" Тогда
		ОбъектПоиска = Документы[ИмяОбъектаМетаданных];
	ИначеЕсли ТипОбъектаМетаданных = "Справочники" Тогда
		ОбъектПоиска = Справочники[ИмяОбъектаМетаданных];
	Иначе
		// Поиск возможен только по справочникам и документам.
		// Возможно, еще и по таким объектам, как "Задачи" и "Планы счетов" и т.д., но это все потом,
		// если возникнет потребность, в чем я сильно сомневаюсь.
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Тип объекта метаданных "+ТипОбъектаМетаданных+" не поддерживается для поиска по проиндексированным реквизитам.";
		Сообщение.Сообщить();
		Возврат Неопределено;
	КонецЕсли;
	
	ОбъектМетаданныхПоиска = Метаданные[ТипОбъектаМетаданных][ИмяОбъектаМетаданных];
	
	ПервичныйПараметрПоиска = Новый Структура;
	ПервичныйПараметрПоискаОбработан = Ложь;
	ВторичныеПараметрыПоиска = Новый Соответствие;
	
	Для Каждого РеквизитПоиска Из РеквизитыПоиска.Свойства() Цикл
		
		РеквизитПоискаXDTO = РеквизитыПоиска[РеквизитПоиска.Имя];
		
		// Проверяем существование реквизита.
		РеквизитПоискаСуществует = ПроверкаСуществованияРеквизита(ОбъектМетаданныхПоиска, РеквизитПоискаXDTO);
		Если НЕ РеквизитПоискаСуществует Тогда
			Возврат Неопределено;
		КонецЕсли;	
		
		МетодРасчетаЗначенияРеквизита = РеквизитПоискаXDTO.Источник.МетодРасчетаЗначения; 
		
		ЗначениеРеквизитаПоиска = РассчитатьЗначениеРеквизитаПоМетодуРасчета(РеквизитПоискаXDTO, МетодРасчетаЗначенияРеквизита, XDTOСтруктураДанные, ОбъектПриемник, ЗаполняемаяСтрока);
		Если ЗначениеРеквизитаПоиска = Неопределено Тогда
			Возврат Неопределено;
		КонецЕсли;
		
		Если НЕ РеквизитыПоиска[РеквизитПоиска.Имя].Свойства().Получить("РеквизитИндексированногоПоиска") = Неопределено И РеквизитыПоиска[РеквизитПоиска.Имя]["РеквизитИндексированногоПоиска"] = "Истина" Тогда    
			Если ПервичныйПараметрПоискаОбработан Тогда
				Сообщение = Новый СообщениеПользователю;
				Сообщение.Текст = "Поиск объекта """+ТипОбъектаМетаданных+"."+ИмяОбъектаМетаданных+""" по индексированному реквизиту  невозможен, поскольку в настройке"+Символы.ПС+
					+"указано более одного первичного проиндексированного реквизита. Указать можно только один.";
				Сообщение.Сообщить();
				Возврат Неопределено;
			КонецЕсли;	
			ПервичныйПараметрПоиска.Вставить("Ключ", РеквизитПоискаXDTO.ИмяОбъектаМетаданных);
			ПервичныйПараметрПоиска.Вставить("Значение", ЗначениеРеквизитаПоиска);
			ПервичныйПараметрПоискаОбработан = Истина;
		Иначе
			ВторичныеПараметрыПоиска.Вставить(РеквизитПоискаXDTO.ИмяОбъектаМетаданных, ЗначениеРеквизитаПоиска);
		КонецЕсли;	
		
	КонецЦикла;
	
	Если НЕ ПервичныйПараметрПоискаОбработан Тогда
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Поиск объекта """+ТипОбъектаМетаданных+"."+ИмяОбъектаМетаданных+""" по индексированному реквизиту  невозможен, поскольку в настройке"+Символы.ПС+
			+"не указано ни одного первичного проиндексированного реквизита.";
		Сообщение.Сообщить();
		Возврат Неопределено;
	КонецЕсли;	
	
	РезультатПоискаПоРеквизиту = Неопределено;
	
	// По первичному реквизиту ищем подходящие элементы через метод "Выбрать".
	ПараметрОтбора = Новый Структура; 
	ПараметрОтбора.Вставить(ПервичныйПараметрПоиска.Ключ, ПервичныйПараметрПоиска.Значение);
	ВыборкаПоПервичномуРеквизитуПоиска = ОбъектПоиска.Выбрать(, , ПараметрОтбора);
	РезультатПоискаПоРеквизиту = Новый СписокЗначений;
	Пока ВыборкаПоПервичномуРеквизитуПоиска.Следующий() Цикл
		РезультатПоискаПоРеквизиту.Добавить(ВыборкаПоПервичномуРеквизитуПоиска);
	КонецЦикла;	
	Если РезультатПоискаПоРеквизиту.Количество() = 0 Тогда
		// Ничего не найдено.
		Если СообщатьОПустомРезультате Тогда
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст =	"Поиск объекта """+ТипОбъектаМетаданных+"."+ИмяОбъектаМетаданных+""" по реквизиту """
			+ПервичныйПараметрПоиска.Ключ+""" со значением """+ПервичныйПараметрПоиска.Значение+""" не дал результатов.";
			Сообщение.Сообщить();
		КонецЕсли;
		Возврат Неопределено;	
	КонецЕсли;
	
	// Если реквизитов больше одного, ищем подходящие значения перебором в цикле.
	// Рекомендуется использовать поиск через запрос.
	Для Каждого ПараметрПоиска из ВторичныеПараметрыПоиска Цикл
		Если РезультатПоискаПоРеквизиту = Неопределено Тогда
			Если СообщатьОПустомРезультате Тогда
				Сообщение = Новый СообщениеПользователю;
				Сообщение.Текст = "Поиск объекта """+ТипОбъектаМетаданных+"."+ИмяОбъектаМетаданных+""" по индексированным реквизитам не дал результатов.";
				Сообщение.Сообщить();
			КонецЕсли;
			Возврат Неопределено;
		Иначе
			РезультатПоискаПоСледующемуРеквизиту = Новый СписокЗначений;
			Для Каждого ЭлементРезультата из РезультатПоискаПоРеквизиту Цикл
				Если НЕ ЭлементРезультата.Значение[ПараметрПоиска.Ключ] = ПараметрПоиска.Значение Тогда
					Продолжить;
				Иначе
					РезультатПоискаПоСледующемуРеквизиту.Добавить(ЭлементРезультата.Значение);
				КонецЕсли;	
			КонецЦикла;	
			РезультатПоискаПоРеквизиту = РезультатПоискаПоСледующемуРеквизиту;
		КонецЕсли;		
	КонецЦикла;	
	
	Если РезультатПоискаПоРеквизиту.Количество() = 0 Тогда
		Если СообщатьОПустомРезультате Тогда
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = "Поиск объекта """+ТипОбъектаМетаданных+"."+ИмяОбъектаМетаданных+""" по индексированным реквизитам не дал результатов.";
			Сообщение.Сообщить();
		КонецЕсли;	
		Возврат Неопределено;
	КонецЕсли;	
	
	Возврат РезультатПоискаПоРеквизиту[0].Значение.Ссылка;
	
КонецФункции

&НаСервереБезКонтекста
Функция ПолучитьРезультатЗапроса(XDTOСтруктураДанные, ТекстЗапроса, ТипРезультата, XDTOПараметрыЗапроса, ОбъектПриемник, ЗаполняемаяСтрока = Неопределено, Имя = Неопределено, СообщатьОПустомРезультате = Истина)
	
	РезультатЗапроса = Неопределено;
	
	Запрос = Новый Запрос;
	Запрос.Текст = ТекстЗапроса;
	
	Для Каждого XDTOПараметрСвойство из XDTOПараметрыЗапроса.Свойства() Цикл
		
		XDTOПараметр = XDTOПараметрыЗапроса[XDTOПараметрСвойство.Имя];
		МетодРасчетаЗначенияПараметра = XDTOПараметр.Источник.МетодРасчетаЗначения;
		
		ИмяПараметраЗапроса = XDTOПараметр.ИмяПараметра;
		ЗначениеПараметраЗапроса = РассчитатьЗначениеРеквизитаПоМетодуРасчета(XDTOПараметр, МетодРасчетаЗначенияПараметра, XDTOСтруктураДанные, ОбъектПриемник, ЗаполняемаяСтрока);
		
		Если ЗначениеПараметраЗапроса = Неопределено Тогда
			Возврат Неопределено;
		КонецЕсли;	
		
		Запрос.УстановитьПараметр(ИмяПараметраЗапроса, ЗначениеПараметраЗапроса);
		
	КонецЦикла;
	
	Результат = Запрос.Выполнить();
	
	Если Результат.Пустой() Тогда
		Если СообщатьОПустомРезультате Тогда 
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст =	"Поиск значения для реквизита """+Имя+""" через запрос не дал результата."+Символы.ПС
								+"Текст запроса:"+Символы.ПС+ТекстЗапроса+Символы.ПС+"Параметры запроса:";
			Сообщение.Сообщить();
			Для Каждого ПараметрЗапроса из Запрос.Параметры Цикл
				Сообщение = Новый СообщениеПользователю;
				Сообщение.Текст = "Параметр "+ПараметрЗапроса.Ключ+" - значение: "+ПараметрЗапроса.Значение+Символы.ПС;
				Сообщение.Сообщить();
			КонецЦикла;
		Конецесли;
		Возврат Неопределено;	
	Иначе
		Результат = Результат.Выбрать();
		Результат.Следующий();
		Результат = Результат.Результат;
		Если НЕ ТипЗнч(Результат) = Тип(ТипРезультата) Тогда
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст =	"Поиск значения для реквизита """+Имя+""" через запрос вернул результат с типом, не соответствующим ожидаемому."+Символы.ПС
								+"Тип результата: "+ТипЗнч(Результат)+". Ожидаемый тип:"+ТипРезультата+"."+Символы.ПС+"Текст запроса:"+Символы.ПС+ТекстЗапроса;
			Сообщение.Сообщить();
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = "Параметры запроса:";
			Сообщение.Сообщить();
			Для Каждого ПараметрЗапроса из Запрос.Параметры Цикл
				Сообщение = Новый СообщениеПользователю;
				Сообщение.Текст = "Параметр "+ПараметрЗапроса.Ключ+" - значение: "+ПараметрЗапроса.Значение+Символы.ПС;
				Сообщение.Сообщить();
			КонецЦикла;
			Возврат Неопределено;
		Иначе
			РезультатЗапроса = Результат;
		КонецЕсли;	
	КонецЕсли;	
	
	Возврат РезультатЗапроса;
	
КонецФункции	

&НаСервереБезКонтекста
Функция ПолучитьРезультатВыполненияКода(XDTOСтруктураДанные, ТекстКода, ТипРезультата, XDTOВходящиеПараметры, ОбъектПриемник, ЗаполняемаяСтрока = Неопределено, Имя = Неопределено, СообщатьОПустомРезультате = Истина, ВходящиеПеременные = Неопределено)
	
	РезультатВыполненияКода = Неопределено;
	ВходящиеПараметры = Новый Структура;
	ВходящиеПараметры.Вставить("ОбъектПриемник", ОбъектПриемник);
	
	Для Каждого XDTOВходящийПараметрСвойство из XDTOВходящиеПараметры.Свойства() Цикл
		
		XDTOВходящийПараметр = XDTOВходящиеПараметры[XDTOВходящийПараметрСвойство.Имя];
		МетодРасчетаЗначенияПараметра = XDTOВходящийПараметр.Источник.МетодРасчетаЗначения;
		
		ИмяПараметраЗапроса = XDTOВходящийПараметр.ИмяПараметра;
		ЗначениеВходящегоПараметра = РассчитатьЗначениеРеквизитаПоМетодуРасчета(XDTOВходящийПараметр, МетодРасчетаЗначенияПараметра, XDTOСтруктураДанные, ОбъектПриемник, ЗаполняемаяСтрока, , ВходящиеПеременные);
		
		Если ЗначениеВходящегоПараметра = Неопределено Тогда
			Возврат Неопределено;
		КонецЕсли;	
		
		ВходящиеПараметры.Вставить(XDTOВходящийПараметрСвойство.Имя, ЗначениеВходящегоПараметра);
		
	КонецЦикла;
	
	Попытка	
		
		Выполнить(ТекстКода);
		
	Исключение
		
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст =	"При расчете значения реквизита """+Имя+""" посредством выполнения произвольного кода произошла ошибка."+Символы.ПС
							+"Проверьте текст кода на корректность."+Символы.ПС+"Текст кода:"+Символы.ПС+ТекстКода;
		Сообщение.Сообщить();
		Возврат Неопределено;	
		
	КонецПопытки;
	
	Если РезультатВыполненияКода = Неопределено Тогда
		Если СообщатьОПустомРезультате Тогда
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст =	"Расчет значения реквизита """+Имя+""" посредством выполнения произвольного кода не вернул результата."+Символы.ПС
								+"Проверьте текст кода на корректность."+Символы.ПС+"Текст кода:"+Символы.ПС+ТекстКода;
			Сообщение.Сообщить();
		КонецЕсли;
		Возврат Неопределено;
	КонецЕсли;	
	
	Если НЕ ТипЗнч(РезультатВыполненияКода) = Тип(ТипРезультата) Тогда
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст =	"Поиск значения для реквизита """+Имя+""" через выполнение кода из строки вернул результат с типом, не соответствующим ожидаемому."+Символы.ПС
							+"Тип результата: "+ТипЗнч(РезультатВыполненияКода)+". Ожидаемый тип:"+ТипРезультата+"."+Символы.ПС+"Текст кода:"+Символы.ПС+ТекстКода;
		Сообщение.Сообщить();
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Входящие параметры кода:";
		Сообщение.Сообщить();
		Для Каждого ВходящийПараметр из ВходящиеПараметры Цикл
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = "Параметр "+ВходящийПараметр.Ключ+" - значение: "+ВходящийПараметр.Значение+Символы.ПС;
			Сообщение.Сообщить();
		КонецЦикла;
		Возврат Неопределено;
	КонецЕсли;
	
	Возврат РезультатВыполненияКода; 
	
КонецФункции	

&НаСервереБезКонтекста
Функция СоздатьПолучитьСсылкуНаНовыйОбъект(XDTOСтруктураДанные, ТипРезультата, XDTOРеквизитыОбъекта, ТипОбъектаМетаданных, ИмяОбъектаМетаданных, ОбъектПриемник, ЗаполняемаяСтрока = Неопределено, Имя = Неопределено, СообщатьОПустомРезультате = Истина, ВходящиеПеременные = Неопределено)
	
	СсылкаНаНовыйОбъект = Неопределено;
	
	РеквизитыНовогоОбъекта = Новый Структура;
		
	Если Метаданные[ТипОбъектаМетаданных].Найти(ИмяОбъектаМетаданных) = Неопределено Тогда
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст =	"Описанный в настройке загрузки объект метаданных "+ТипОбъектаМетаданных+"."
							+ИмяОбъектаМетаданных+" не обнаружен!";
		Сообщение.Сообщить();
		Возврат Неопределено;	
	КонецЕсли;	
	
	Попытка	
		
		ОбъектМетаданыхНовогоОбъекта = Метаданные[ТипОбъектаМетаданных][ИмяОбъектаМетаданных];
		
		Если ТипОбъектаМетаданных = "Документы" Тогда
			НовыйОбъект = Документы[ИмяОбъектаМетаданных].СоздатьДокумент();
		ИначеЕсли ТипОбъектаМетаданных = "Справочники" Тогда
			НовыйОбъект = Справочники[ИмяОбъектаМетаданных].СоздатьЭлемент();
		Иначе
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст =	"Описанный в настройке загрузки тип объекта метаданных "+ТипОбъектаМетаданных
								+" не поддерживается для загрузки на данный момент."+Символы.ПС+"На данный момент загрузать данные можно только в справочники и документы.";
			Сообщение.Сообщить();
			Возврат Неопределено;
		КонецЕсли;
		
		// Основные реквизиты объекта.
		Для Каждого РеквизитПриемника из XDTOРеквизитыОбъекта.Свойства() Цикл
			
			ОбрабатываемыйРеквизитXDTO	= XDTOРеквизитыОбъекта[РеквизитПриемника.Имя];
			МетодРасчетаЗначения		= ОбрабатываемыйРеквизитXDTO.Источник.МетодРасчетаЗначения;
			
			// Проверяем существование реквизита.
			РеквизитСуществует = ПроверкаСуществованияРеквизита(ОбъектМетаданыхНовогоОбъекта, ОбрабатываемыйРеквизитXDTO);
			Если НЕ РеквизитСуществует Тогда
				Возврат Неопределено;
			КонецЕсли;		
			
			ЗначениеРеквизита = РассчитатьЗначениеРеквизитаПоМетодуРасчета(ОбрабатываемыйРеквизитXDTO, МетодРасчетаЗначения, XDTOСтруктураДанные, ОбъектПриемник, ЗаполняемаяСтрока);		
			Если ЗначениеРеквизита = Неопределено Тогда
				ОтменитьТранзакцию();
				Возврат Неопределено;
			КонецЕсли;
			
			НовыйОбъект[ОбрабатываемыйРеквизитXDTO.ИмяОбъектаМетаданных] = ЗначениеРеквизита;
					
		КонецЦикла; 
				
		НовыйОбъект.Записать();
		
		СсылкаНаНовыйОбъект = НовыйОбъект.Ссылка;
		
	Исключение
		
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст =	"При расчете значения реквизита """+Имя+""" посредством создания нового объекта с типом """+ТипРезультата+""""
				+Символы.ПС+"Произошла ошибка.";
		Сообщение.Сообщить();
		Возврат Неопределено;	
		
	КонецПопытки;
	
	Если СсылкаНаНовыйОбъект = Неопределено Тогда
		Если СообщатьОПустомРезультате Тогда
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст =	"Создание значения для заполнения реквизита """+Имя+""" не удалось.";
			Сообщение.Сообщить();
		КонецЕсли;
		Возврат Неопределено;
	КонецЕсли;	
	
	Если НЕ ТипЗнч(СсылкаНаНовыйОбъект) = Тип(ТипРезультата) Тогда
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст =	"Создание значения для заполнения реквизита """+Имя+""" вернуло результат с типом, не соответствующим ожидаемому."+Символы.ПС
							+"Тип результата: "+ТипЗнч(СсылкаНаНовыйОбъект)+". Ожидаемый тип:"+ТипРезультата+".";
		Сообщение.Сообщить();
		Возврат Неопределено;
	КонецЕсли;
	
	Возврат СсылкаНаНовыйОбъект; 
	
КонецФункции

&НаСервереБезКонтекста
Функция ПолучитьЗначениеИзРанееРассчитанныхДанных(ОбъектПриемник, ПутьКИсточнику, Имя, ЗаполняемаяСтрока = Неопределено, ВходящиеПеременные = Неопределено)
	
	Попытка                              
		ЗначениеПоПути = Вычислить(ПутьКИсточнику);
		Если ТипЗнч(ЗначениеПоПути) = Тип("Строка") Тогда
			ЗначениеПоПути = СокрЛП(ЗначениеПоПути);
		КонецЕсли;	
		Возврат ЗначениеПоПути;
	Исключение
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "При расчете значения """+Имя+""" из ранее рассчитанного значения произошла ошибка. Ранее рассчитанное значение """+ПутьКИсточнику+""" не обнаружено.";
		Сообщение.Сообщить();
		Возврат Неопределено;	
	КонецПопытки	
	
КонецФункции

&НаСервереБезКонтекста
Функция ПолучитьЗначениеКонстанты(ИмяКонстанты)
	
	Возврат Константы[ИмяКонстанты].Получить();
	
КонецФункции

&НаСервереБезКонтекста
Функция ПолучитьЗначениеПеречисления(ИмяПеречисления, ЗначениеПеречисления)
	
	Возврат Перечисления[ИмяПеречисления][ЗначениеПеречисления];
	
КонецФункции

&НаСервереБезКонтекста
Функция РассчитатьЗначениеРеквизитаПоМетодуРасчета(РеквизитXDTO, МетодРасчетаЗначения, XDTOСтруктураДанные = Неопределено, ОбъектПриемник = Неопределено, ЗаполняемаяСтрока = Неопределено, СообщатьОПустомРезультате = Истина, ВходящиеПеременные = Неопределено)
	
	ИмяРеквизитаПараметра = ?(РеквизитXDTO.Свойства().Получить("ИмяОбъектаМетаданных") = Неопределено, РеквизитXDTO.ИмяПараметра, РеквизитXDTO.ИмяОбъектаМетаданных);
	
	Если МетодРасчетаЗначения = "ФиксированноеЗначение" Тогда
		ЗначениеРеквизита = ПолучитьФиксированноеЗначение(РеквизитXDTO.Источник.ПутьКИсточнику, РеквизитXDTO.ТипЗначения, ИмяРеквизитаПараметра);
	ИначеЕсли МетодРасчетаЗначения = "ИзВходящихДанных" Тогда
		ЗначениеРеквизита = ПолучитьЗначениеИзВходящихДанных(XDTOСтруктураДанные, РеквизитXDTO.Источник.ПутьКИсточнику, РеквизитXDTO.ТипЗначения, ИмяРеквизитаПараметра);
	ИначеЕсли МетодРасчетаЗначения = "ИзРанееРассчитанныхДанных" Тогда
		ЗначениеРеквизита = ПолучитьЗначениеИзРанееРассчитанныхДанных(ОбъектПриемник, РеквизитXDTO.Источник.ПутьКИсточнику, ИмяРеквизитаПараметра, ЗаполняемаяСтрока, ВходящиеПеременные);	
	ИначеЕсли МетодРасчетаЗначения = "ПоискПоИндексированнымРеквизитам" Тогда
		ЗначениеРеквизита = ПолучитьРезультатПоискаПоИндексированнымРеквизитам(XDTOСтруктураДанные, РеквизитXDTO.Источник.РеквизитыПоиска, 
																			   РеквизитXDTO.Источник.ТипОбъектаМетаданных, РеквизитXDTO.Источник.ИмяОбъектаМетаданных, 
																			   ОбъектПриемник, ЗаполняемаяСтрока, СообщатьОПустомРезультате);
	ИначеЕсли МетодРасчетаЗначения = "РезультатЗапроса" Тогда	
		ЗначениеРеквизита = ПолучитьРезультатЗапроса(XDTOСтруктураДанные, РеквизитXDTO.Источник.ТекстЗапроса, РеквизитXDTO.ТипЗначения, 
													 РеквизитXDTO.Источник.ПараметрыЗапроса, ОбъектПриемник, ЗаполняемаяСтрока, ИмяРеквизитаПараметра, СообщатьОПустомРезультате);
	ИначеЕсли МетодРасчетаЗначения = "РезультатВыполненияКода" Тогда
		ЗначениеРеквизита = ПолучитьРезультатВыполненияКода(XDTOСтруктураДанные, РеквизитXDTO.Источник.ТекстФункции, РеквизитXDTO.ТипЗначения, 
															РеквизитXDTO.Источник.ВходящиеПараметры, ОбъектПриемник, ЗаполняемаяСтрока, ИмяРеквизитаПараметра, СообщатьОПустомРезультате, ВходящиеПеременные);
	ИначеЕсли МетодРасчетаЗначения = "СсылкаНаНовыйОбъект" Тогда
		ЗначениеРеквизита = СоздатьПолучитьСсылкуНаНовыйОбъект(XDTOСтруктураДанные, РеквизитXDTO.ТипЗначения, РеквизитXDTO.Источник.РеквизитыНовогоОбъекта, РеквизитXDTO.Источник.ТипОбъектаМетаданных, 
															РеквизитXDTO.Источник.ИмяОбъектаМетаданных, ОбъектПриемник, ЗаполняемаяСтрока, ИмяРеквизитаПараметра,СообщатьОПустомРезультате, ВходящиеПеременные);													
	ИначеЕсли МетодРасчетаЗначения = "Константа" Тогда
		ЗначениеРеквизита = ПолучитьЗначениеКонстанты(РеквизитXDTO.ИмяОбъектаМетаданных);
	ИначеЕсли МетодРасчетаЗначения = "Перечисление" Тогда	
		ЗначениеРеквизита = ПолучитьЗначениеПеречисления(РеквизитXDTO.Источник.ИмяОбъектаМетаданных, РеквизитXDTO.Источник.ПутьКИсточнику)	
	ИначеЕсли МетодРасчетаЗначения = "Неопределено" Тогда
		Возврат Неопределено;	
	Иначе	
		ЗначениеРеквизита = Неопределено;
	КонецЕсли;
	
	Возврат ЗначениеРеквизита; 
	
КонецФункции

&НаСервереБезКонтекста
Функция ПроверкаСуществованияРеквизита(ОбъектМетаданных, РеквизитXDTO)
	
	Если РеквизитXDTO.СтандартныйРеквизит = "Ложь" Тогда	
		// Нестандартный.
		Если ОбъектМетаданных.Реквизиты.Найти(РеквизитXDTO.ИмяОбъектаМетаданных) = Неопределено Тогда
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст =	"При проверке существования реквизита """+РеквизитXDTO.ИмяОбъектаМетаданных+""" объекта метаданных """+ОбъектМетаданных+""" произошла ошибка."+Символы.ПС+
								"Реквизит """+РеквизитXDTO.ИмяОбъектаМетаданных+""" отсутствует в списке реквизитов объекта метаданных."+Символы.ПС+
								"Проверьте корректность файла настройки загрузки.";
			Сообщение.Сообщить();
			Возврат Ложь;
		КонецЕсли;
	ИначеЕсли РеквизитXDTO.СтандартныйРеквизит = "Истина" Тогда
		// Стандартный.
		Попытка
			ПроверяемыйСтандартныйРеквизит = ОбъектМетаданных.СтандартныеРеквизиты[РеквизитXDTO.ИмяОбъектаМетаданных];
		Исключение
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст =	"При проверке существования реквизита """+РеквизитXDTO.ИмяОбъектаМетаданных+""" объекта метаданных """+ОбъектМетаданных+""" произошла ошибка."+Символы.ПС+
								"Реквизит """+РеквизитXDTO.ИмяОбъектаМетаданных+""" заявлен как стандартный реквизит объекта метаданных, однако в списке стандартных реквизитов отсутствует."+
								Символы.ПС+"Проверьте корректность файла настройки загрузки.";
			Сообщение.Сообщить();
			Возврат Ложь;
		КонецПопытки;	
	Иначе
		// Внештатная ситуация.
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст =	"Неожиданная ошибка при проверке существования реквизита """+РеквизитXDTO.ИмяОбъектаМетаданных+""" объекта метаданных """+ОбъектМетаданных+"""."+Символы.ПС+
							"Проверьте корректность файла настройки загрузки.";
		Сообщение.Сообщить();
		Возврат Ложь;
	КонецЕсли;
	
	Возврат Истина;
	
КонецФункции

&НаСервереБезКонтекста
Функция РезультатОбработкиУсловия(XDTOСтруктураДанные, ОписаниеОбъектаПоНастройке, ОбъектПриемник, ЗаполняемаяСтрока = Неопределено, ВходящиеПеременные = Неопределено)
	
	Если НЕ ОписаниеОбъектаПоНастройке.Свойства().Получить("УсловияЗагрузкиСтроки") = Неопределено Тогда 
		Условия = ОписаниеОбъектаПоНастройке.УсловияЗагрузкиСтроки;	
	ИначеЕсли НЕ ОписаниеОбъектаПоНастройке.Свойства().Получить("УсловияЗаполнения") = Неопределено Тогда 
		Условия = ОписаниеОбъектаПоНастройке.УсловияЗаполнения;	
	Иначе
		Возврат Ложь;
	КонецЕсли;
	
	Если ТипЗнч(Условия.Условие) = Тип("СписокXDTO") Тогда
		
		Для Каждого Условие из Условия.Условие Цикл
			
			ЗначениеУсловия		= РассчитатьЗначениеРеквизитаПоМетодуРасчета(Условие, Условие.Источник.МетодРасчетаЗначения, XDTOСтруктураДанные, ОбъектПриемник, ЗаполняемаяСтрока, , ВходящиеПеременные);
			ПризнакСравнения	= РассчитатьЗначениеРеквизитаПоМетодуРасчета(Условие.ПризнакСравнения, Условие.ПризнакСравнения.Источник.МетодРасчетаЗначения, XDTOСтруктураДанные, ОбъектПриемник, ЗаполняемаяСтрока, , ВходящиеПеременные); 
			
			Если НЕ Условие.Свойства().Получить("СравнениеНЕ") = Неопределено И Условие.СравнениеНЕ = "Истина" Тогда
				// Если совпадают - не загружаем.
				Если ЗначениеУсловия = ПризнакСравнения Тогда
					Возврат Ложь;	
				КонецЕсли;	
			Иначе
				// Если совпадают - загружаем.
				Если НЕ ЗначениеУсловия = ПризнакСравнения Тогда
					Возврат Ложь;	
				КонецЕсли;
			КонецЕсли;	
			
		КонецЦикла;
		
	ИначеЕсли ТипЗнч(Условия.Условие) = Тип("ОбъектXDTO") Тогда
		
		Условие = Условия.Условие;
		
		ЗначениеУсловия		= РассчитатьЗначениеРеквизитаПоМетодуРасчета(Условие, Условие.Источник.МетодРасчетаЗначения, XDTOСтруктураДанные, ОбъектПриемник, ЗаполняемаяСтрока, , ВходящиеПеременные);
		ПризнакСравнения	= РассчитатьЗначениеРеквизитаПоМетодуРасчета(Условие.ПризнакСравнения, Условие.ПризнакСравнения.Источник.МетодРасчетаЗначения, XDTOСтруктураДанные, ОбъектПриемник, ЗаполняемаяСтрока, , ВходящиеПеременные); 
		
		Если НЕ Условие.Свойства().Получить("СравнениеНЕ") = Неопределено И Условие.СравнениеНЕ = "Истина" Тогда
			// Если совпадают - не загружаем.
			Если ЗначениеУсловия = ПризнакСравнения Тогда
				Возврат Ложь;	
			КонецЕсли;	
		Иначе
			// Если совпадают - загружаем.
			Если НЕ ЗначениеУсловия = ПризнакСравнения Тогда
				Возврат Ложь;	
			КонецЕсли;
		КонецЕсли;	
				
	КонецЕсли;	
	
	Возврат Истина;
		
КонецФункции

#КонецОбласти

#Область РаботаСИнформациейОТоварах

&НаСервере
Процедура ПрочитатьНастройкиРаботыСНоменклатуройНаСервере(ФайлНастроекРаботыСНоменклатуройДвоичныеДанные)
	
	ПутьКВременномуФайлуНастроекРаботыСНоменклатуройНаСервере	= КаталогВременныхФайлов()+"НастройкиРаботыСНоменклатурой.xml";	
	
	ФайлНастроекРаботыСНоменклатуройДвоичныеДанные.Записать(ПутьКВременномуФайлуНастроекРаботыСНоменклатуройНаСервере);
	
	ЧтениеXML = Новый ЧтениеXML();
	ЧтениеXML.ОткрытьФайл(ПутьКВременномуФайлуНастроекРаботыСНоменклатуройНаСервере);
	XDTOСтруктураНастройкиПоискаНоменклатуры = ФабрикаXDTO.ПрочитатьXML(ЧтениеXML);
	
КонецПроцедуры

&НаСервере
Процедура ПередЗагрузкой_ПрочитатьДанныеОТоварахНаСервере(ФайлДокументаДвоичныеДанные, ЗагружаемыйФормат, ВаримантПриемникаЗагрузки)
	
	#Область ЧтениеФайловНастроек
	
	Адрес = АдресВременногоХранилищаКэш;
	
	Кэш = ПолучитьИзВременногоХранилища(Адрес);
		
	НастройкаЗагрузкиОбъектXDTO = Кэш.НастройкиОбъект[Кэш.ПрефиксКонфигурации+"НастройкиЗагрузки"];		
	ОписаниеЗагрузкиПоФормату = НастройкаЗагрузкиОбъектXDTO.ЗагружаемыеФорматы[ЗагружаемыйФормат];
	
	ИмяНастройкиСопоставленияНоменклатуры = ОписаниеЗагрузкиПоФормату[ВаримантПриемникаЗагрузки].ИмяНастройкиСопоставленияНоменклатуры; 
	
	XDTOСтруктураНастройкаРаботыСНоменклатурой = Кэш.НастройкиОбъект[ИмяНастройкиСопоставленияНоменклатуры];
		
	#КонецОбласти
	
	#Область ЧтениеИПроверкаНастройки
	
	НастройкаСоответствуетКонфигурации = XDTOСтруктураНастройкаРаботыСНоменклатурой.ПрефиксКонфигурации = ПрефиксКонфигурации;
	
	Если НЕ НастройкаСоответствуетКонфигурации Тогда
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Файл настройки загрузки документа не соответствует текущей конфигурации программы.";
		Сообщение.Сообщить();
		Возврат;
	КонецЕсли;
	
	СправочникНоменклатурыОпределен									= Ложь;
	ОбъектХраненияРезультатовСопоставленияОпределен					= Ложь;
	ОбъектПризнакаИспользованияХраненияРезультатовПоискаОпределен	= Ложь;
	ЗначениеПризнакаИспользования									= Неопределено;
	//ИспользованияХранениеРезультатовСопоставленияВИБ				= Ложь;
	
	МассивРеквизитов = Новый Массив;
	
	// Проверяем наличие объекта хранения данных по номенклатуре, объявленного в настройке.
	Если Метаданные[XDTOСтруктураНастройкаРаботыСНоменклатурой.ОбъектПоиска.ТипОбъектаМетаданных].Найти(XDTOСтруктураНастройкаРаботыСНоменклатурой.ОбъектПоиска.ИмяОбъектаМетаданных) = Неопределено Тогда
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст =	"Описанный в настройке работы с номенклатурой объект метаданных "
		+XDTOСтруктураНастройкаРаботыСНоменклатурой.ОбъектПоиска.ТипОбъектаМетаданных+"."
		+XDTOСтруктураНастройкаРаботыСНоменклатурой.ОбъектПоиска.ИмяОбъектаМетаданных+" не обнаружен!";
		Сообщение.Сообщить();
		Возврат;
	Иначе
		СправочникНоменклатурыОпределен = Истина;
		ПараметрыЗагрузкиНоменклатуры.Вставить("ИмяСправочникаНоменклатуры", XDTOСтруктураНастройкаРаботыСНоменклатурой.ОбъектПоиска.ИмяОбъектаМетаданных);
	КонецЕсли;
	
	ОбъектХраненияXDTO = XDTOСтруктураНастройкаРаботыСНоменклатурой.ОбъектХраненияРезультатовСопоставления;
	ОбъектХраненияИспользуется = ОбъектХраненияXDTO.Используется = "Истина"; 
	
	Если ОбъектХраненияИспользуется Тогда 
		
		// Проверяем наличие объявленного в настройке объекта хранения результатов поиска.
		Если НЕ Метаданные[ОбъектХраненияXDTO.ТипОбъектаМетаданных].Найти(ОбъектХраненияXDTO.ИмяОбъектаМетаданных) = Неопределено Тогда
			ОбъектХраненияРезультатовСопоставленияОпределен = Истина;
			ПараметрыЗагрузкиНоменклатуры.Вставить("ОбъектХраненияНоменклатурыПоставщиков", XDTOСтруктураНастройкаРаботыСНоменклатурой.ОбъектХраненияРезультатовСопоставления.ИмяОбъектаМетаданных);
		Иначе
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст =	"Описанный в настройке работы с номенклатурой объект метаданных "
			+ОбъектХраненияXDTO.ТипОбъектаМетаданных+"."+ОбъектХраненияXDTO.ИмяОбъектаМетаданных+" не обнаружен!";
			Сообщение.Сообщить();
			Возврат;
		КонецЕсли;
		
		
		// Проверяем значение признака использования, сравниваем его с ожидаемым, при котором признак считается активированным.
		// Если признак не объявлен, выбор его использования/неиспользования остаётся за пользователем.
		Если НЕ ОбъектХраненияXDTO.Свойства().Получить("ПризнакИспользования") = Неопределено Тогда
			
			ПризнакИспользованияХраненияРезультатовСопоставленияXDTO = ОбъектХраненияXDTO.ПризнакИспользования.Признак;
			ПризнакСравненияХраненияРезультатовСопоставленияXDTO = ОбъектХраненияXDTO.ПризнакИспользования.ПризнакСравнения;
			
			ПризнакИспользованияХраненияРезультатовСопоставленияЗначение = РассчитатьЗначениеРеквизитаПоМетодуРасчета(ПризнакИспользованияХраненияРезультатовСопоставленияXDTO, ПризнакИспользованияХраненияРезультатовСопоставленияXDTO.Источник.МетодРасчетаЗначения);
			ПризнакСравненияХраненияРезультатовСопоставленияЗначение = РассчитатьЗначениеРеквизитаПоМетодуРасчета(ПризнакСравненияХраненияРезультатовСопоставленияXDTO, ПризнакСравненияХраненияРезультатовСопоставленияXDTO.Источник.МетодРасчетаЗначения);
			
			Если ПризнакИспользованияХраненияРезультатовСопоставленияЗначение = ПризнакСравненияХраненияРезультатовСопоставленияЗначение Тогда
				ИспользованияХранениеРезультатовСопоставленияВИБ = Истина;
			Иначе
				ИспользованияХранениеРезультатовСопоставленияВИБ = Ложь;
			КонецЕсли;
			
		Иначе
			
			Элементы.ИспользуетсяХранениеРезультатовПоискаВИБ.ТолькоПросмотр = Ложь;
			
		КонецЕсли;	
		
		
		// Проверяем заполнение параметра "ИмяРеквизитаОбъектаХраненияДляОпределенияТовара".
		// Он нужен для понимания, в каком, собственно, реквизите объекта хранения результатов сопоставления лежит ссылка на саму норменклатуру.
		// Если объект хранения результатов сопоставления сам и есть номенклатура, нужно просто указать реквизит "Ссылка". 
		Если ОбъектХраненияXDTO.Свойства().Получить("ИмяРеквизитаОбъектаХраненияДляОпределенияТовара") = Неопределено Тогда
			ОбъектПризнакаИспользованияХраненияРезультатовПоискаОпределен = Ложь;
			Сообщение = Новый СообщениеПользователю;
				Сообщение.Текст = "Не удалось определить реквизит объекта хранения сопоставления товаров, по которому определяется ссылка на номенклатуру в 1С."
				+Символы.ПС+"Функция неактивна.";
				Сообщение.Сообщить();
		Иначе
			ЭтаФорма.ПараметрыЗагрузкиНоменклатуры.Вставить("ИмяРеквизитаОбъектаХраненияДляОпределенияТовара", ОбъектХраненияXDTO.ИмяРеквизитаОбъектаХраненияДляОпределенияТовара);	
		КонецЕсли;
		
		// Проверяем заполнение параметра "ИмяРеквизитаОбъектаХраненияДляОпределенияПоставщикаТовара".
		// Он нужен для понимания, в каком реквизите объекта хранения результатов сопоставления лежит ссылка на его владельца (Контрагента или Партнера).
		// Наличие реквизита предполагается обязательным. Если его нет, не используйте объект хранения результатов сопоставления.  
		Если ОбъектХраненияXDTO.Свойства().Получить("ИмяРеквизитаОбъектаХраненияДляОпределенияТовара") = Неопределено Тогда
			ОбъектПризнакаИспользованияХраненияРезультатовПоискаОпределен = Ложь;
			Сообщение = Новый СообщениеПользователю;
				Сообщение.Текст = "Не удалось определить реквизит объекта хранения сопоставления товаров, по которому определяется ссылка поставщика товара по документу в 1С."
				+Символы.ПС+"Функция неактивна.";
				Сообщение.Сообщить();
		Иначе
			ЭтаФорма.ПараметрыЗагрузкиНоменклатуры.Вставить("ИмяРеквизитаОбъектаХраненияДляОпределенияПоставщикаТовара", ОбъектХраненияXDTO.ИмяРеквизитаОбъектаХраненияДляОпределенияПоставщикаТовара);	
		КонецЕсли;
		
	КонецЕсли;
	
	#КонецОбласти
	
	#Область РеквизитыИЭлементыФормы
	
	Если ТаблицаСопоставленияНоменклатуры.Количество() = 0 Тогда
		
		РеквизитПоставщикаПоДокументуОпределен = Ложь;
		РеквизитСсылкиНаНоменклатуруОпределен = Ложь;
		РеквизитСсылкиНаХранениеРезультатовПоискаОпределен = Ложь;
		ХарактеристикиСуществуютИИспользуются = ХарактеристикиСуществуютИИспользуются();
		
		Для Каждого РеквизитФормы из ЭтаФорма.ПолучитьРеквизиты("ТаблицаСопоставленияНоменклатуры") Цикл
			Если РеквизитФормы.Имя = "Номенклатура" Тогда
				РеквизитСсылкиНаНоменклатуруОпределен = Истина;
			ИначеЕсли РеквизитФормы.Имя = "СсылкаНаХранениеРезультатовПоиска" Тогда	
				РеквизитСсылкиНаХранениеРезультатовПоискаОпределен = Истина;
			ИначеЕсли РеквизитФормы.Имя = "ПоставщикПоДокументу" Тогда
				РеквизитПоставщикаПоДокументуОпределен = Истина;
			КонецЕсли;	
		КонецЦикла;	
		
		// Создание и фиксирование необходимых реквизитов.
		Если НЕ РеквизитПоставщикаПоДокументуОпределен Тогда
			МассивРеквизитов.Добавить(Новый РеквизитФормы("ПоставщикПоДокументу", Новый ОписаниеТипов(XDTOСтруктураНастройкаРаботыСНоменклатурой.ОбщиеПараметрыСопоставления.ПоставщикТовара.ТипЗначения), 
			"ТаблицаСопоставленияНоменклатуры", "Поставщик по документу"));
			РеквизитПоставщикаПоДокументуОпределен = Истина;
		КонецЕсли;
		
		Если НЕ XDTOСтруктураНастройкаРаботыСНоменклатурой.ОбщиеПараметрыСопоставления.Свойства().Получить("ПартнерПоПоставщикуТовара") = Неопределено Тогда
			МассивРеквизитов.Добавить(Новый РеквизитФормы("ПартнерПоПоставщикуТовара", Новый ОписаниеТипов(XDTOСтруктураНастройкаРаботыСНоменклатурой.ОбщиеПараметрыСопоставления.ПартнерПоПоставщикуТовара.ТипЗначения), 
			"ТаблицаСопоставленияНоменклатуры", "Партнер поставщика по документу"));
			РеквизитПоставщикаПоДокументуОпределен = Истина;	
		КонецЕсли;
		
		Если СправочникНоменклатурыОпределен И НЕ РеквизитСсылкиНаНоменклатуруОпределен Тогда 
			МассивРеквизитов.Добавить(Новый РеквизитФормы("Номенклатура", Новый ОписаниеТипов(XDTOСтруктураНастройкаРаботыСНоменклатурой.ОбъектПоиска.ТипЗначения), 
			"ТаблицаСопоставленияНоменклатуры", "Ссылка на товар в БД"));
		КонецЕсли;
		
		Если СправочникНоменклатурыОпределен И НЕ РеквизитСсылкиНаХранениеРезультатовПоискаОпределен Тогда
		//Если СправочникНоменклатурыОпределен И ИспользованияХранениеРезультатовСопоставленияВИБ И НЕ РеквизитСсылкиНаХранениеРезультатовПоискаОпределен Тогда 
			ТипыСсылкиНаХранениеРезультатовПоиска = Новый Массив;
			ТипыСсылкиНаХранениеРезультатовПоиска.Добавить(Тип(ОбъектХраненияXDTO.ТипЗначения));
			ТипыСсылкиНаХранениеРезультатовПоиска.Добавить(Тип("Строка"));
			МассивРеквизитов.Добавить(Новый РеквизитФормы("СсылкаНаХранениеРезультатовПоиска", 
			Новый ОписаниеТипов(ТипыСсылкиНаХранениеРезультатовПоиска), 
			"ТаблицаСопоставленияНоменклатуры", 
			Метаданные[ОбъектХраненияXDTO.ТипОбъектаМетаданных].Найти(ОбъектХраненияXDTO.ИмяОбъектаМетаданных).ПредставлениеОбъекта));
		КонецЕсли;
		
		Если ХарактеристикиСуществуютИИспользуются Тогда
			МассивРеквизитов.Добавить(Новый РеквизитФормы("ХарактеристикаНоменклатуры", Новый ОписаниеТипов("СправочникСсылка.ХарактеристикиНоменклатуры"),
				"ТаблицаСопоставленияНоменклатуры", "Характеристика"));	
		КонецЕсли;	
			
		ИзменитьРеквизиты(МассивРеквизитов);
		
		// Создание элементов форм под реквизиты.
		Если РеквизитПоставщикаПоДокументуОпределен И ЭтаФорма.Элементы.Найти("ТаблицаСопоставленияНоменклатурыПоставщикПоДокументу") = Неопределено Тогда 
			НовыйЭлемент = Элементы.Добавить("ТаблицаСопоставленияНоменклатурыПоставщикПоДокументу", Тип("ПолеФормы"), Элементы.ТаблицаСопоставленияНоменклатуры);       
			НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
			НовыйЭлемент.ПутьКДанным = "ТаблицаСопоставленияНоменклатуры.ПоставщикПоДокументу";
			НовыйЭлемент.ТолькоПросмотр = Истина;
		КонецЕсли;	
		
		Если СправочникНоменклатурыОпределен И ЭтаФорма.Элементы.Найти("ТаблицаСопоставленияНоменклатурыНоменклатура") = Неопределено Тогда 
			НовыйЭлемент = Элементы.Добавить("ТаблицаСопоставленияНоменклатурыНоменклатура", Тип("ПолеФормы"), Элементы.ТаблицаСопоставленияНоменклатуры);       
			НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
			НовыйЭлемент.ПутьКДанным = "ТаблицаСопоставленияНоменклатуры.Номенклатура";
			НовыйЭлемент.УстановитьДействие("НачалоВыбора", "ПередВыборомСсылкиНаНоменклатуру");
			НовыйЭлемент.УстановитьДействие("ПриИзменении", "ПриИзмененииСсылкиНаНоменклатуру");
			НовыйЭлемент.КнопкаВыпадающегоСписка = Ложь;
			НовыйЭлемент.КнопкаСоздания = Ложь;
			НовыйЭлемент.РежимВыбораИзСписка = Ложь;
			НовыйЭлемент.ОтображениеКнопкиВыбора = ОтображениеКнопкиВыбора.ОтображатьВПолеВвода;
			НовыйЭлемент.ИсторияВыбораПриВводе = ИсторияВыбораПриВводе.НеИспользовать;
			НовыйЭлемент.РедактированиеТекста = Ложь;
		КонецЕсли;
		
		Если ХарактеристикиСуществуютИИспользуются Тогда
			НовыйЭлемент = Элементы.Добавить("ТаблицаСопоставленияНоменклатурыХарактеристика", Тип("ПолеФормы"), Элементы.ТаблицаСопоставленияНоменклатуры);       
			НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
			НовыйЭлемент.ПутьКДанным = "ТаблицаСопоставленияНоменклатуры.ХарактеристикаНоменклатуры";
			НовыйЭлемент.ОтображениеКнопкиВыбора = ОтображениеКнопкиВыбора.ОтображатьВПолеВвода;
			НовыйЭлемент.КнопкаВыпадающегоСписка = Ложь;
			НовыйЭлемент.РежимВыбораИзСписка = Ложь;
			НовыйЭлемент.РедактированиеТекста = Ложь;
			НовыйЭлемент.ИсторияВыбораПриВводе = ИсторияВыбораПриВводе.НеИспользовать;
			НовыйЭлемент.УстановитьДействие("НачалоВыбора", "ПередВыборомСсылкиНаХарактеристику");
		КонецЕсли;
		
		Если СправочникНоменклатурыОпределен И ЭтаФорма.Элементы.Найти("ТаблицаСопоставленияНоменклатурыСсылкаНаХранениеРезультатовПоиска") = Неопределено Тогда 
			НовыйЭлемент = Элементы.Добавить("ТаблицаСопоставленияНоменклатурыСсылкаНаХранениеРезультатовПоиска", Тип("ПолеФормы"), Элементы.ТаблицаСопоставленияНоменклатуры);       
			НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
			НовыйЭлемент.ПутьКДанным = "ТаблицаСопоставленияНоменклатуры.СсылкаНаХранениеРезультатовПоиска";
			НовыйЭлемент.УстановитьДействие("НачалоВыбора", "ПередВыборомСсылкиНаХранениеРезультатовПоиска");
			Если НЕ ИспользованияХранениеРезультатовСопоставленияВИБ Тогда
				НовыйЭлемент.Видимость = Ложь;	
			КонецЕсли;	
		КонецЕсли;
		
		Если ИспользованияХранениеРезультатовСопоставленияВИБ Тогда
			Элементы.СохранитьТаблицуТоваров.Доступность = Ложь;
			Элементы.ЗагрузитьИзПамятиТаблицуТоваров.Доступность = Ложь;
			Элементы.ТекстОписаниеХраненияРезультатовВИБ.Видимость = Истина;
			Элементы.ТекстОписаниеХраненияРезультатовВИБ.Заголовок = "Результаты выбора будут храниться в"+Символы.ПС+
																		"объекте """+ОбъектХраненияXDTO.ТипОбъектаМетаданных+""""+Символы.ПС+
																		"с именем """+Метаданные[ОбъектХраненияXDTO.ТипОбъектаМетаданных].Найти(ОбъектХраненияXDTO.ИмяОбъектаМетаданных).Синоним+""".";
			Элементы.ТаблицаСопоставленияНоменклатурыНоменклатура.ТолькоПросмотр = Истина;
			Элементы.ТаблицаСопоставленияНоменклатурыСсылкаНаХранениеРезультатовПоиска.ТолькоПросмотр = Ложь;
			Если ХарактеристикиСуществуютИИспользуются Тогда
				Элементы.ТаблицаСопоставленияНоменклатурыХарактеристика.ТолькоПросмотр = Истина;
			КонецЕсли;	
			//Элементы.ТаблицаСопоставленияНоменклатурыНоменклатура.ТолькоПросмотр = Истина;
		Иначе
			Элементы.СохранитьТаблицуТоваров.Доступность = Истина;
			Элементы.ЗагрузитьИзПамятиТаблицуТоваров.Доступность = Истина;
			Элементы.ТекстОписаниеХраненияРезультатовВИБ.Видимость = Ложь;
			Элементы.ТекстОписаниеХраненияРезультатовВИБ.Заголовок = "";
			Элементы.ТаблицаСопоставленияНоменклатурыНоменклатура.ТолькоПросмотр = Ложь;
			Если НЕ ЭтаФорма.Элементы.Найти("ТаблицаСопоставленияНоменклатурыСсылкаНаХранениеРезультатовПоиска") = Неопределено Тогда
				Элементы.ТаблицаСопоставленияНоменклатурыСсылкаНаХранениеРезультатовПоиска.ТолькоПросмотр = Истина;
			КонецЕсли;
			Если ХарактеристикиСуществуютИИспользуются Тогда
				Элементы.ТаблицаСопоставленияНоменклатурыХарактеристика.ТолькоПросмотр = Ложь;
			КонецЕсли;
			//Элементы.ТаблицаСопоставленияНоменклатурыНоменклатура.ТолькоПросмотр = Ложь;
			
		КонецЕсли;	
			
	КонецЕсли;
	
	#КонецОбласти
	
	#Область ЧтениеДанныхСтрок
	
	// Чтение данных документа.
	СоздатьФайлЗагружаемогоДокументаНаСервере(ФайлДокументаДвоичныеДанные);
	ЧтениеXML = Новый ЧтениеXML();
	ЧтениеXML.ОткрытьФайл(ПутьКВременномуФайлуДокументаНаСервере);
	Фабрика = Кэш.ФорматыОбъект[ЗагружаемыйФормат];
	XDTOСтруктураДанные = Фабрика.ПрочитатьXML(ЧтениеXML);	
	
	ТаблицаСопоставленияНоменклатуры.Очистить();
	
	// Вычисляем общие параметры сопоставления.
	ОбщиеПараметрыСопоставления = Новый Структура;
	Для Каждого XDTOПараметрСвойство из XDTOСтруктураНастройкаРаботыСНоменклатурой.ОбщиеПараметрыСопоставления.Свойства() Цикл
		Если XDTOПараметрСвойство.Форма = ФормаXML.Атрибут Тогда
			Продолжить;
		КонецЕсли;	
		XDTOПараметрСопоставления = XDTOСтруктураНастройкаРаботыСНоменклатурой.ОбщиеПараметрыСопоставления[XDTOПараметрСвойство.Имя];
		МетодРасчетаЗначения = XDTOПараметрСопоставления.Источник.МетодРасчетаЗначения;
		ЗначениеСопоставления = РассчитатьЗначениеРеквизитаПоМетодуРасчета(XDTOПараметрСопоставления, МетодРасчетаЗначения, XDTOСтруктураДанные, ОбщиеПараметрыСопоставления);
		ОбщиеПараметрыСопоставления.Вставить(XDTOПараметрСвойство.Имя, ЗначениеСопоставления);
	КонецЦикла;	
		
	// Читаем данные по каждой строке документа.
	Если ТипЗнч(XDTOСтруктураДанные.Документ.ТаблСчФакт.СведТов) = Тип("СписокXDTO") Тогда 
		
		#Область ЕслиМногоСтрок
		
		Для Каждого Строка из XDTOСтруктураДанные.Документ.ТаблСчФакт.СведТов Цикл
			
			РезультатовСопоставленияЗначение = Неопределено;
			НоменклатураРезультатаСопоставления = Неопределено;
			
			НоваяСтрокаСопоставления = ТаблицаСопоставленияНоменклатуры.Добавить();
			
			НоваяСтрокаСопоставления.ПоставщикПоДокументу = ОбщиеПараметрыСопоставления.ПоставщикТовара;
			Если ОбщиеПараметрыСопоставления.Свойство("ПартнерПоПоставщикуТовара") Тогда
				НоваяСтрокаСопоставления.ПартнерПоПоставщикуТовара = ОбщиеПараметрыСопоставления.ПартнерПоПоставщикуТовара;
			КонецЕсли;	
			НоваяСтрокаСопоставления.НаименованиеИзДокумента = СокрЛП(Строка.НаимТов);
			Если НЕ Строка.Свойства().Получить("ДопСведТов") = Неопределено Тогда
				Если НЕ Строка.ДопСведТов.Свойства().Получить("КодТов") = Неопределено Тогда 
					НоваяСтрокаСопоставления.КодТовараИзДокумента =  Строка.ДопСведТов.КодТов;
				КонецЕсли;
				Если НЕ Строка.ДопСведТов.Свойства().Получить("АртикулТов") = Неопределено Тогда
					НоваяСтрокаСопоставления.АртикулТовараИзДокумента = Строка.ДопСведТов.АртикулТов;
				КонецЕсли;
			КонецЕсли;
			
			// Ищем соответствия в хранящихся результатах.
			Если ИспользованияХранениеРезультатовСопоставленияВИБ Тогда
				
				МетодРасчетаЗначения = ОбъектХраненияXDTO.Источник.МетодРасчетаЗначения;
				РезультатовСопоставленияЗначение = РассчитатьЗначениеРеквизитаПоМетодуРасчета(ОбъектХраненияXDTO, МетодРасчетаЗначения, Строка, ОбщиеПараметрыСопоставления, , Ложь);
				Если НЕ РезультатовСопоставленияЗначение = Неопределено Тогда
					Если ОбъектХраненияXDTO.ИмяРеквизитаОбъектаХраненияДляОпределенияТовара = "" Тогда
						НоменклатураРезультатаСопоставления = РезультатовСопоставленияЗначение;
					Иначе	
						НоменклатураРезультатаСопоставления = РезультатовСопоставленияЗначение[ОбъектХраненияXDTO.ИмяРеквизитаОбъектаХраненияДляОпределенияТовара];
					КонецЕсли;
					Если ХарактеристикиСуществуютИИспользуются() Тогда
						ХарактеристикаРезультатаСопоставления = РезультатовСопоставленияЗначение.Характеристика;
					КонецЕсли;	
				КонецЕсли;	
				
				Если НЕ РезультатовСопоставленияЗначение = Неопределено Тогда
					НоваяСтрокаСопоставления.СсылкаНаХранениеРезультатовПоиска = РезультатовСопоставленияЗначение;
					Если ХарактеристикиСуществуютИИспользуются() Тогда
						НоваяСтрокаСопоставления.ХарактеристикаНоменклатуры = ХарактеристикаРезультатаСопоставления;
					КонецЕсли;
				Иначе
					НоваяСтрокаСопоставления.СсылкаНаХранениеРезультатовПоиска = "Щелкните, чтобы создать";
				КонецЕсли;
				
				Если НЕ НоменклатураРезультатаСопоставления = Неопределено Тогда
					НоваяСтрокаСопоставления.Номенклатура = НоменклатураРезультатаСопоставления;
				КонецЕсли;	
				
			КонецЕсли;		
			
		КонецЦикла;
		
		#КонецОбласти
		
	Иначе
		
		#Область ЕслиОднаСтрока
		
		Строка = XDTOСтруктураДанные.Документ.ТаблСчФакт.СведТов;
		
		РезультатовСопоставленияЗначение = Неопределено;
		НоменклатураРезультатаСопоставления = Неопределено;
		
		НоваяСтрокаСопоставления = ТаблицаСопоставленияНоменклатуры.Добавить();
		
		НоваяСтрокаСопоставления.ПоставщикПоДокументу = ОбщиеПараметрыСопоставления.ПоставщикТовара;
		Если ОбщиеПараметрыСопоставления.Свойство("ПартнерПоПоставщикуТовара") Тогда
			НоваяСтрокаСопоставления.ПартнерПоПоставщикуТовара = ОбщиеПараметрыСопоставления.ПартнерПоПоставщикуТовара;
		КонецЕсли;	
		НоваяСтрокаСопоставления.НаименованиеИзДокумента = СокрЛП(Строка.НаимТов);
		Если НЕ Строка.Свойства().Получить("ДопСведТов") = Неопределено Тогда
			Если НЕ Строка.ДопСведТов.Свойства().Получить("КодТов") = Неопределено Тогда 
				НоваяСтрокаСопоставления.КодТовараИзДокумента =  Строка.ДопСведТов.КодТов;
			КонецЕсли;
			Если НЕ Строка.ДопСведТов.Свойства().Получить("АртикулТов") = Неопределено Тогда
				НоваяСтрокаСопоставления.АртикулТовараИзДокумента = Строка.ДопСведТов.АртикулТов;
			КонецЕсли;
		КонецЕсли;
		
		// Ищем соответствия в хранящихся результатах.
		Если ИспользованияХранениеРезультатовСопоставленияВИБ Тогда
			
			МетодРасчетаЗначения = ОбъектХраненияXDTO.Источник.МетодРасчетаЗначения;
			РезультатовСопоставленияЗначение = РассчитатьЗначениеРеквизитаПоМетодуРасчета(ОбъектХраненияXDTO, МетодРасчетаЗначения, Строка, ОбщиеПараметрыСопоставления, , Ложь);
			Если НЕ РезультатовСопоставленияЗначение = Неопределено Тогда
				Если ОбъектХраненияXDTO.ИмяРеквизитаОбъектаХраненияДляОпределенияТовара = "" Тогда
					НоменклатураРезультатаСопоставления = РезультатовСопоставленияЗначение;
				Иначе	
					НоменклатураРезультатаСопоставления = РезультатовСопоставленияЗначение[ОбъектХраненияXDTO.ИмяРеквизитаОбъектаХраненияДляОпределенияТовара];
				КонецЕсли;
				Если ХарактеристикиСуществуютИИспользуются Тогда
					ХарактеристикаРезультатаСопоставления = РезультатовСопоставленияЗначение.Характеристика;
				КонецЕсли;	
			КонецЕсли;
			
			Если НЕ РезультатовСопоставленияЗначение = Неопределено Тогда
				НоваяСтрокаСопоставления.СсылкаНаХранениеРезультатовПоиска = РезультатовСопоставленияЗначение;
				Если ХарактеристикиСуществуютИИспользуются() Тогда
					НоваяСтрокаСопоставления.ХарактеристикаНоменклатуры = ХарактеристикаРезультатаСопоставления;
				КонецЕсли;
			Иначе
				НоваяСтрокаСопоставления.СсылкаНаХранениеРезультатовПоиска = "Щелкните, чтобы создать";
			КонецЕсли;
			
			Если НЕ НоменклатураРезультатаСопоставления = Неопределено Тогда
				НоваяСтрокаСопоставления.Номенклатура = НоменклатураРезультатаСопоставления;
			КонецЕсли;	
			
		КонецЕсли;	
		
		#КонецОбласти
		
	КонецЕсли;
	
	#КонецОбласти
	
КонецПроцедуры
	
#КонецОбласти

#Область РаботаСМарками

&НаСервереБезКонтекста
Процедура ОбработатьИЗаполнитьИнформациюПоМаркам(ОбъектПриемник, XDTOСтруктураДанные, ФорматДокумента)

	Если НЕ ЗначениеЗаполнено(ФорматДокумента) Тогда
		Возврат;
	КонецЕсли;
	
	Если Метаданные.Константы.Найти("ВестиУчетОбувнойПродукцииИСМП") = Неопределено И Метаданные.Константы.Найти("ВестиУчетТабачнойПродукцииМОТП") = Неопределено 
		И Метаданные.Константы.Найти("ВестиУчетМаркируемойПродукцииИСМП") = Неопределено И Метаданные.Константы.Найти("ВестиУчетМаркировкиПродукцииВГИСМ") = Неопределено Тогда
		// Учет по маркам не поддерживается.
		Возврат;
	КонецЕсли;

	// УПД статуса 1 и статуса 2.
	Если ФорматДокумента = "ON_NSCHFDOPPR" Тогда
		
		СтрокиТоваров = XDTOСтруктураДанные.Документ.ТаблСчФакт.СведТов;
		
		Если ТипЗнч(СтрокиТоваров) = Тип("СписокXDTO") Тогда
			
			Для Каждого СтрокаТовара из XDTOСтруктураДанные.Документ.ТаблСчФакт.СведТов Цикл
				ОбработатьМаркиСтроки(ОбъектПриемник, СтрокаТовара);	
			КонецЦикла;	
			
		ИначеЕсли ТипЗнч(СтрокиТоваров) = Тип("ОбъектXDTO") Тогда
			
			СтрокаТовара = XDTOСтруктураДанные.Документ.ТаблСчФакт.СведТов;			
			ОбработатьМаркиСтроки(ОбъектПриемник, СтрокаТовара);	
			
		КонецЕсли;	
		
	КонецЕсли;	
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ОбработатьМаркиСтроки(ОбъектПриемник, XDTOСтруктураДанныеСтрокиТоваров)
	
	Если XDTOСтруктураДанныеСтрокиТоваров.Свойства().Получить("ДопСведТов") = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	// ГТИН
	Если НЕ XDTOСтруктураДанныеСтрокиТоваров.ДопСведТов.Свойства().Получить("ГТИН") = Неопределено Тогда	
		Если НЕ СокрЛП(XDTOСтруктураДанныеСтрокиТоваров.ДопСведТов.ГТИН) = "" Тогда 
			ДобавитьШтриход(ОбъектПриемник, "02"+XDTOСтруктураДанныеСтрокиТоваров.ДопСведТов.ГТИН+"37"+XDTOСтруктураДанныеСтрокиТоваров.КолТов);
			Возврат;
		КонецЕсли;  	
	КонецЕсли;
	
	Если XDTOСтруктураДанныеСтрокиТоваров.ДопСведТов.Свойства().Получить("НомСредИдентТов") = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ДанныеИдентификацииТоваров = XDTOСтруктураДанныеСтрокиТоваров.ДопСведТов.НомСредИдентТов;
	
	Если ТипЗнч(ДанныеИдентификацииТоваров) = Тип("СписокXDTO") Тогда
		
		Для Каждого ЭлементДанныхИдентификацииТоваров из XDTOСтруктураДанныеСтрокиТоваров.ДопСведТов.НомСредИдентТов Цикл
			ОбработатьЭлементДанныхИдентификацииТоваров(ОбъектПриемник, ЭлементДанныхИдентификацииТоваров);
		КонецЦикла; 
		
	ИначеЕсли ТипЗнч(ДанныеИдентификацииТоваров) = Тип("ОбъектXDTO") Тогда
		
		ЭлементДанныхИдентификацииТоваров = XDTOСтруктураДанныеСтрокиТоваров.ДопСведТов.НомСредИдентТов;
		ОбработатьЭлементДанныхИдентификацииТоваров(ОбъектПриемник, ЭлементДанныхИдентификацииТоваров);
		
	КонецЕсли;	
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ОбработатьЭлементДанныхИдентификацииТоваров(ОбъектПриемник, XDTOСтруктураДанныеИдентификацииТоваров)
	
	// Уникальный идентификатор всей транспортной упаковки.
	Если НЕ XDTOСтруктураДанныеИдентификацииТоваров.Свойства().Получить("ИдентТрансУпак") = Неопределено Тогда
		
		Если НЕ СокрЛП(XDTOСтруктураДанныеИдентификацииТоваров.ИдентТрансУпак) = "" Тогда
			ДобавитьШтриход(ОбъектПриемник, XDTOСтруктураДанныеИдентификацииТоваров.ИдентТрансУпак);
			Возврат;
		КонецЕсли;	
		
	КонецЕсли;
	
	// Контрольные идентификационные знаки товаров.
	Если НЕ XDTOСтруктураДанныеИдентификацииТоваров.Свойства().Получить("КИЗ") = Неопределено Тогда
		
		Если ТипЗнч(XDTOСтруктураДанныеИдентификацииТоваров.КИЗ) = Тип("СписокXDTO") Тогда
		
			Для Каждого КИЗТовара из XDTOСтруктураДанныеИдентификацииТоваров.КИЗ Цикл
				Если НЕ СокрЛП(КИЗТовара) = "" Тогда
					ДобавитьШтриход(ОбъектПриемник, КИЗТовара)
				КонецЕсли;	
			КонецЦикла; 
		
		ИначеЕсли ТипЗнч(XDTOСтруктураДанныеИдентификацииТоваров.КИЗ) = Тип("Строка") И НЕ СокрЛП(XDTOСтруктураДанныеИдентификацииТоваров.КИЗ) = "" Тогда
		
			ДобавитьШтриход(ОбъектПриемник, XDTOСтруктураДанныеИдентификацииТоваров.КИЗ);
		
		КонецЕсли; 
		
		Возврат;
		
	КонецЕсли;
	
	// Уникальные идентификаторы вторичной (потребительской)/третичной (заводской, транспортной) упаковки.
	Если НЕ XDTOСтруктураДанныеИдентификацииТоваров.Свойства().Получить("НомУпак") = Неопределено Тогда
		
		Если ТипЗнч(XDTOСтруктураДанныеИдентификацииТоваров.НомУпак) = Тип("СписокXDTO") Тогда
		
			Для Каждого НомУпакТовара из XDTOСтруктураДанныеИдентификацииТоваров.НомУпак Цикл
				Если НЕ СокрЛП(НомУпакТовара) = "" Тогда
					ДобавитьШтриход(ОбъектПриемник, НомУпакТовара)
				КонецЕсли;	
			КонецЦикла; 
		
		ИначеЕсли ТипЗнч(XDTOСтруктураДанныеИдентификацииТоваров.НомУпак) = Тип("Строка") И НЕ СокрЛП(XDTOСтруктураДанныеИдентификацииТоваров.НомУпак) = "" Тогда
		
			ДобавитьШтриход(ОбъектПриемник, XDTOСтруктураДанныеИдентификацииТоваров.НомУпак);
		
		КонецЕсли; 
		
		Возврат;
		
	КонецЕсли;	
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ДобавитьШтриход(ОбъектПриемник, Штрихкод)

	НоваяСтрокаШтрихкодов = ОбъектПриемник.ШтрихкодыУпаковок.Добавить();
	НоваяСтрокаШтрихкодов.ЗначениеШтрихкода = Штрихкод;
	
КонецПроцедуры	
	
#КонецОбласти
