
#Область СлужебныеПроцедурыФункции

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("ПрефиксКонфигурации") Тогда
		ПрефиксКонфигурации = Параметры.ПрефиксКонфигурации;
	КонецЕсли;
	
	КлиентскиеНастройкиМассив = ПолучитьСохраненныеКлиентскиеНастройки();
	
	Если ТипЗнч(КлиентскиеНастройкиМассив) = Тип("Массив") Тогда
		
		Для Каждого Элемент из КлиентскиеНастройкиМассив Цикл
			
			НоваяСтрока = КлиентскиеНастройки.Добавить();               
			НоваяСтрока.ИмяНастройки		= Элемент.ИмяНастройки;
			НоваяСтрока.ИмяФайлаНастройки	= Элемент.ИмяФайлаНастройки;
			НоваяСтрока.ОбъектНастройки		= Элемент.ОбъектНастройки;
			НоваяСтрока.ФорматВыгрузки		= Элемент.ФорматВыгрузки;
			НоваяСтрока.ПрименятьНастройку	= Элемент.Применять;
			НоваяСтрока.ТекстНастройки		= Элемент.ТекстНастройки;
			
		КонецЦикла;	
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура СвернутьТаблицуНастроек()
	
	КлиентскиеНастройкиТаблицаЗначений = КлиентскиеНастройки.Выгрузить();
	КлиентскиеНастройкиТаблицаЗначений.Свернуть("ИмяНастройки, ИмяФайлаНастройки, ОбъектНастройки, ФорматВыгрузки, ТекстНастройки", "ПрименятьНастройку");
	КлиентскиеНастройки.Загрузить(КлиентскиеНастройкиТаблицаЗначений);
	
КонецПроцедуры

&НаСервере
Функция ПолучитьСохраненныеКлиентскиеНастройки()
	
	КлиентскиеНастройкиМассив = Неопределено;
	
	МодульОбъектаОбработки = РеквизитФормыВЗначение("Объект");
	КлиентскиеНастройкиМассив = МодульОбъектаОбработки.ПолучитьСохраненныеКлиентскиеНастройки();		
			
	Возврат КлиентскиеНастройкиМассив;		
	
КонецФункции	

&НаКлиенте
Процедура ОтключитьОдноименныеФайлыНастройки(ИмяФайлаНастройки)
	
	Для Каждого Строка из КлиентскиеНастройки Цикл
		
		Если Строка.ИмяФайлаНастройки = ИмяФайлаНастройки Тогда
			Строка.ПрименятьНастройку = Ложь;
		КонецЕсли;	
		
	КонецЦикла;	
	
КонецПроцедуры	

&НаКлиенте
Функция СуществуютОдноименыеНастройки(ТекущиеДанныеСтрокиНастроек)
	
	ИмяНастройки = ТекущиеДанныеСтрокиНастроек.ИмяНастройки;
	ИмяФайлаНастройки = ТекущиеДанныеСтрокиНастроек.ИмяФайлаНастройки;
	
	Для Каждого Строка из КлиентскиеНастройки Цикл
		
		Если Строка.ИмяНастройки = ИмяНастройки И Строка.ИмяФайлаНастройки = ИмяФайлаНастройки И НЕ Строка = ТекущиеДанныеСтрокиНастроек Тогда
			Возврат Истина;
		КонецЕсли;	
		
	КонецЦикла;
	
	Возврат Ложь;
	
КонецФункции	
	
&НаСервере
Функция ПолучитьМакетНастроек()
	
	ОбработкаОбъект = РеквизитФормыВЗначение("Объект");
	Настройки = ОбработкаОбъект.ПолучитьМакет("Настройки");
	Возврат Настройки;
	
КонецФункции	

#КонецОбласти

#Область СобытияЭлементовФормы

&НаКлиенте
Процедура КлиентскиеНастройкиПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	
	Отказ = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура КлиентскиеНастройкиПрименятьНастройкуПриИзменении(Элемент)
	
	Если Элемент.Родитель.ТекущиеДанные.ПрименятьНастройку = Истина Тогда
		ОтключитьОдноименныеФайлыНастройки(Элемент.Родитель.ТекущиеДанные.ИмяФайлаНастройки);
		Элемент.Родитель.ТекущиеДанные.ПрименятьНастройку = Истина;
	КонецЕсли;
	
	СвернутьТаблицуНастроек();	
	
КонецПроцедуры

&НаКлиенте
Процедура КлиентскиеНастройкиИмяНастройкиПриИзменении(Элемент)
		
	Если СуществуютОдноименыеНастройки(Элемент.Родитель.ТекущиеДанные) = Истина Тогда
		Элемент.Родитель.ТекущиеДанные.ИмяНастройки = "";
	КонецЕсли;	
	
КонецПроцедуры

#КонецОбласти

#Область КнопкаЗагрузитьИзФайла

&НаКлиенте
Процедура ЗагрузитьИзФайла(Команда)
	
	Диалог = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
	Диалог.Заголовок = "Выбор файлов";
	Диалог.ИндексФильтра = 0;
	Диалог.ПредварительныйПросмотр = Ложь;
	Диалог.ПроверятьСуществованиеФайла = Истина;
	Диалог.МножественныйВыбор = Истина;
	Диалог.Фильтр = "Xml файлы(*.xml)|*xml";
	
	Если Диалог.Выбрать() Тогда
		
		МассивФайлов = Диалог.ВыбранныеФайлы;
		Для Каждого ИмяФайла Из МассивФайлов Цикл
			
			ИмяФайлаБезКаталога = Прав(ИмяФайла, СтрДлина(ИмяФайла)-СтрДлина(Диалог.Каталог));
			ИмяФайлаБезРасширения = Лев(ИмяФайлаБезКаталога, СтрДлина(ИмяФайлаБезКаталога) - 4); // ".xml" 

			Файл = Новый ТекстовыйДокумент;
			Файл.Прочитать(ИмяФайла);
			Настройка = Файл.ПолучитьТекст();
			
			ЧтениеXML = Новый ЧтениеXML;
			ЧтениеXML.УстановитьСтроку(Настройка);
			
			НастройкаXDTO = ФабрикаXDTO.ПрочитатьXML(ЧтениеXML);  
			
			Если НЕ НастройкаXDTO.ПрефиксКонфигурации = ПрефиксКонфигурации Тогда
				Сообщить("Настройка """+ИмяФайлаБезРасширения+""" не может быть загружена, поскольку префикс конфигурации "
						+Символы.ПС+"настройки не совдадает с текущим префиксом конфигурации 1С ("+ПрефиксКонфигурации+").");
				Продолжить;
			КонецЕсли;	
			
			ЭтоНастройкаЗагрузки = Ложь;
			Если НЕ НастройкаXDTO.Свойства().Получить("ЭтоНастройкаЗагрузки") = Неопределено И НастройкаXDTO.ЭтоНастройкаЗагрузки = "Истина" Тогда
				ЭтоНастройкаЗагрузки = Истина;
			КонецЕсли;	
			
			Если НЕ НастройкаXDTO.Свойства().Получить("ИмяОбъектаМетаданных") = Неопределено Тогда
				ОбъектНастройки = НастройкаXDTO.ИмяОбъектаМетаданных;  
			ИначеЕсли ЭтоНастройкаЗагрузки Тогда	
				Если НЕ НастройкаXDTO.Свойства().Получить("ОбъектПоиска") = Неопределено Тогда
					ОбъектНастройки = НастройкаXDTO.ОбъектПоиска.ИмяОбъектаМетаданных;
				ИначеЕсли НЕ НастройкаXDTO.Свойства().Получить("ОсновнойОбъектПриемник") = Неопределено Тогда	
					ОбъектНастройки = НастройкаXDTO.ОсновнойОбъектПриемник.ИмяОбъектаМетаданных;	
				КонецЕсли;			
			КонецЕсли;	
			
			Если НЕ НастройкаXDTO.Свойства().Получить("ФорматВыгрузки") = Неопределено Тогда 
				ФорматВыгрузки = НастройкаXDTO.ФорматВыгрузки;
			ИначеЕсли ОбъектНастройки = "Конфигурация" ИЛИ ОбъектНастройки = "ЗагрузкаВходящих" ИЛИ ЭтоНастройкаЗагрузки Тогда 
				ФорматВыгрузки = "";
			Иначе
				Сообщить("Настройка """+ИмяФайлаБезРасширения+""" не может быть загружена, поскольку в ней не указан формат формируемого файла.");
				Продолжить;
			КонецЕсли;
			
			ОтключитьОдноименныеФайлыНастройки(ИмяФайлаБезРасширения);
			
			НоваяСтрока = КлиентскиеНастройки.Добавить();
			НоваяСтрока.ИмяФайлаНастройки	= ИмяФайлаБезРасширения;
			НоваяСтрока.ОбъектНастройки		= ОбъектНастройки;
			НоваяСтрока.ФорматВыгрузки		= ФорматВыгрузки;
			НоваяСтрока.ПрименятьНастройку	= Истина;
			НоваяСтрока.ТекстНастройки		= Настройка;
			
		КонецЦикла;
		
		СвернутьТаблицуНастроек();	
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти     

#Область КнопкаВыгрузитьАрхивТиповыхНастроек

&НаКлиенте
Процедура ВыгрузитьАрхивТиповыхНастроек(Команда)
	
	Диалог = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.ВыборКаталога);
	Диалог.Заголовок = "Выбор каталога для сохранения";
	
	Если Диалог.Выбрать() Тогда
		
		ИмяФайлаАрхиваТиповыхНастроек = Диалог.Каталог + "/ТиповыеНастройкиОФДЭДО.zip";
		
		Настройки = ПолучитьМакетНастроек();
		Настройки.Записать(ИмяФайлаАрхиваТиповыхНастроек);
		
	КонецЕсли;	
		
КонецПроцедуры

#КонецОбласти 

#Область ВыгрузитьВФайл

&НаКлиенте
Процедура ВыгрузитьВФайл(Команда)
	
	Диалог = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Сохранение);
	Диалог.Заголовок = "Выбор каталога для сохранения";
	Диалог.ПолноеИмяФайла = Элементы.КлиентскиеНастройки.ТекущиеДанные.ИмяФайлаНастройки; 
	Диалог.Фильтр = "Xml файлы(*.xml)|*xml";                                             
	Диалог.МножественныйВыбор = Ложь;
	
	Если Диалог.Выбрать() Тогда
		
		ПутьКФайлу = Диалог.ПолноеИмяФайла;
		Файл = Новый ТекстовыйДокумент();                           
		Файл.ДобавитьСтроку(Элементы.КлиентскиеНастройки.ТекущиеДанные.ТекстНастройки);
		Файл.Записать(ПутьКФайлу+".xml");
		
	КонецЕсли;	
	
КонецПроцедуры

#КонецОбласти

#Область КнопкаПодтвердить

&НаКлиенте
Процедура Подтвердить(Команда)
	
	Если КлиентскиеНастройки.Количество() = 0 Тогда
		
		МассивТекущихКлиентскихНастроек = ПолучитьСохраненныеКлиентскиеНастройки();	
		
		Если НЕ МассивТекущихКлиентскихНастроек = Неопределено И ТипЗнч(МассивТекущихКлиентскихНастроек) = Тип("Массив") Тогда 
			
			Если МассивТекущихКлиентскихНастроек.Количество() > 0 Тогда
				Оповещение = Новый ОписаниеОповещения("ПослеЗакрытияВопроса", ЭтотОбъект);	
				ПоказатьВопрос(Оповещение, "Вы очищаете сохранённые настроки. Вы уверены?", РежимДиалогаВопрос.ДаНет, 0, КодВозвратаДиалога.Нет, "Вы уверены?");
			Иначе
				ЭтаФорма.Закрыть();
			КонецЕсли;	
				
		КонецЕсли;
			
	Иначе
	
		МассивНастроек = Новый Массив;
		
		Для Каждого Строка из КлиентскиеНастройки Цикл
			
			СтруктураПользовательскойНастройки = Новый Структура;
			СтруктураПользовательскойНастройки.Вставить("Применять", 			Строка.ПрименятьНастройку);
			СтруктураПользовательскойНастройки.Вставить("ИмяНастройки",			Строка.ИмяНастройки);
			СтруктураПользовательскойНастройки.Вставить("ИмяФайлаНастройки",	Строка.ИмяФайлаНастройки);
			СтруктураПользовательскойНастройки.Вставить("ОбъектНастройки",		Строка.ОбъектНастройки);
			СтруктураПользовательскойНастройки.Вставить("ФорматВыгрузки",		Строка.ФорматВыгрузки);
			СтруктураПользовательскойНастройки.Вставить("ТекстНастройки",		Строка.ТекстНастройки);
			
			МассивНастроек.Добавить(СтруктураПользовательскойНастройки);
		
		КонецЦикла;	
		
		ЭтаФорма.Закрыть(МассивНастроек);
	
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗакрытияВопроса(Результат, Параметры) Экспорт
 
    Если Результат = КодВозвратаДиалога.Да Тогда
		
		МассивНастроек = Новый Массив;
		ЭтаФорма.Закрыть(МассивНастроек);
		
    КонецЕсли;	
 
КонецПроцедуры

#КонецОбласти
