
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("ТекстСообщения") Тогда
		ТекстСообщения = Параметры.ТекстСообщения;
	КонецЕсли;
	Если Параметры.Свойство("ПолныйТехническийТекстСообщения") Тогда
		ПолныйТехническийТекстСообщения = Параметры.ПолныйТехническийТекстСообщения;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ТекущееИмяФормы = ЭтаФорма.ИмяФормы;
	
	ВсеОкна = ПолучитьОкна();
	
	Для Каждого ТекущееОкно Из ВсеОкна Цикл
		// Каждое окно может содержать одну или несколько форм
		Для Каждого ФормаОкна Из ТекущееОкно.Содержимое Цикл
			
			// Проверяем имя формы или тип основного реквизита
			Если ТипЗнч(ФормаОкна) = Тип("УправляемаяФорма") Тогда
				Если Найти(ФормаОкна.ИмяФормы, ТекущееИмяФормы) > 0 Тогда
					ЭтаФорма.Закрыть();
				КонецЕсли;
			КонецЕсли;
			
		КонецЦикла;
	КонецЦикла;
	
	Если НЕ ЗначениеЗаполнено(ПолныйТехническийТекстСообщения) Тогда
		Элементы.ГруппаПолныйТехническийТекст.Видимость = Ложь;
	Иначе
		НайтиОтобразитьИнтерпретацию();
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура НайтиОтобразитьИнтерпретацию()
	
	Если НЕ ЗначениеЗаполнено(ПолныйТехническийТекстСообщения) Тогда
		Возврат;
	КонецЕсли;
	
	ПриоритетИдентификаторовСписок = Новый СписокЗначений;
		
	ОбработкаОбъект = РеквизитФормыВЗначение("Объект");
	
	Макет = ОбработкаОбъект.ПолучитьМакет("ИнтерпретацииОшибок"); 
	
	Построитель = Новый ПостроительЗапроса;
	Построитель.ИсточникДанных = Новый ОписаниеИсточникаДанных(Макет.Область());
    Построитель.ДобавлениеПредставлений = ТипДобавленияПредставлений.НеДобавлять;
    Построитель.ЗаполнитьНастройки();
    Построитель.Выполнить();
	
	ТЗ = Построитель.Результат.Выгрузить(); 
	
	Для Каждого Строка из ТЗ Цикл
		Если НЕ ЗначениеЗаполнено(Строка.ПодстрокаПоиска) Тогда
			Продолжить;
		КонецЕсли;
		Если НЕ СтрНайти(ПолныйТехническийТекстСообщения, Строка.ПодстрокаПоиска) = 0 Тогда
			ТекстСообщения = Строка.ИнтерпретацияТекстаОшибки;
		КонецЕсли;	
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура КнопкаОК(Команда)
	
	ЭтаФорма.Закрыть();
	
КонецПроцедуры


