&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ПередаваемыйСписокЗначений = Параметры.ПередаваемыйСписокЗначений;
	
	Для Каждого ЭлементСписка Из ПередаваемыйСписокЗначений Цикл
		Элементы.ПолеСортировки.СписокВыбора.Добавить(ЭлементСписка.Значение, ЭлементСписка.Представление);
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ПодтвердитьВыбор(Команда)
	
	СтруктураОтвета = Новый Структура;
	СтруктураОтвета.Вставить("ПолеСортировки", ПолеСортировки);
	СтруктураОтвета.Вставить("НаправлениеСортировки", ?(НаправлениеСортировки = 0, "УБЫВ", "УВЕЛ"));
	
	ЭтаФорма.Закрыть(СтруктураОтвета);
	
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии(ЗавершениеРаботы)
	
	СтруктураОтвета = Новый Структура;
	СтруктураОтвета.Вставить("ПолеСортировки", ПолеСортировки);
	СтруктураОтвета.Вставить("НаправлениеСортировки", ?(НаправлениеСортировки = 0, "УБЫВ", "УВЕЛ"));
	
	ОповеститьОВыборе(СтруктураОтвета);
	
КонецПроцедуры