
#Область СобытияФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ПередаваемыйСписокЗначений = Параметры.ПередаваемыйСписокЗначений;
	ОбрабатываемыйСписокЗначений = ПередаваемыйСписокЗначений;
	
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаВыбранныхЗначенийПриОкончанииРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования)

	УдалитьДублиПустыеЗначенияСписка();

КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии(ЗавершениеРаботы)
	
	УдалитьДублиПустыеЗначенияСписка();
	ОповеститьОВыборе(ОбрабатываемыйСписокЗначений);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыФункции

&НаКлиенте
Процедура УдалитьДублиПустыеЗначенияСписка()

	ТекущийИндекс = 0; 
	ВсегоЭлементов = ОбрабатываемыйСписокЗначений.Количество(); 
	Пока ТекущийИндекс < ВсегоЭлементов Цикл
		
		Если НЕ ЗначениеЗаполнено(ОбрабатываемыйСписокЗначений[ТекущийИндекс].Значение) Тогда
			ОбрабатываемыйСписокЗначений.Удалить(ТекущийИндекс); 
			ВсегоЭлементов = ВсегоЭлементов - 1;
		КонецЕсли;	
		
		Индекс2 = ТекущийИндекс + 1; 
		Пока Индекс2 < ВсегоЭлементов Цикл 
			Если ОбрабатываемыйСписокЗначений[Индекс2].Значение = ОбрабатываемыйСписокЗначений[ТекущийИндекс].Значение Тогда 
				ОбрабатываемыйСписокЗначений.Удалить(Индекс2); 
				ВсегоЭлементов = ВсегоЭлементов - 1; 
			Иначе 
				Индекс2 = Индекс2 + 1; 
			КонецЕсли; 
		КонецЦикла; 
		ТекущийИндекс = ТекущийИндекс + 1;
		
	КонецЦикла;
	
КонецПроцедуры	

#КонецОбласти

#Область КнопкаПодтвердитьВыбор

&НаКлиенте
Процедура ПодтвердитьВыбор(Команда)
	
	УдалитьДублиПустыеЗначенияСписка();
	ЭтаФорма.Закрыть(ОбрабатываемыйСписокЗначений);
	
КонецПроцедуры

#КонецОбласти