
&НаКлиенте
Процедура ПоказатьPDF(ПутьКОбъекту)
 
 	ДокументPDF = Новый ДокументPDF;
	ДокументPDF.Прочитать(ПутьКОбъекту);
	ДокPDF = ДокументPDF; 
		
КонецПроцедуры

&НаКлиенте
Процедура СформироватьОтображениеПросмотраXML()
	
	ТекстXML = Новый ЧтениеТекста;
	ТекстXML.Открыть(ПутьКДокументуXML);
	
	ИсходныйТекстXML = ТекстXML.Прочитать();
		 
	ТекстПреобразованияXSL = ПолучитьТекстПреобразования(ПутьКДокументуXML);
	
	Преобразование = Новый ПреобразованиеXSL;
	Преобразование.ЗагрузитьТаблицуСтилейXSLИзСтроки(ТекстПреобразованияXSL);
	HTMLТекст = Преобразование.ПреобразоватьИзСтроки(ИсходныйТекстXML);
	Запись = Новый ЗаписьHTML;
	ВрФайл = ПолучитьИмяВременногоФайла(".html");
	ДокументHTML = ПолучитьДокументHTML(HTMLТекст);
	Запись.ОткрытьФайл(ВрФайл);
	ЗаписьDOM = Новый ЗаписьDOM;
	ЗаписьDOM.Записать(ДокументHTML, Запись);
	Запись.Закрыть(); 

	ОтображаемыйФайлXML = ВрФайл;
	
	Если НЕ ЗначениеЗаполнено(НомерМЧДПодписи) Тогда
		ПоложениеИнформацииОбМЧДВДокументе = СтрНайти(ОтображаемыйФайлXML, "ТекстИнф Идентиф=""МЧД""");
		Если НЕ ПоложениеИнформацииОбМЧДВДокументе = 0 Тогда
			ТекстДокументаПослеОбъявленияМЧД = Прав(ОтображаемыйФайлXML, СтрДлина(ОтображаемыйФайлXML) - ПоложениеИнформацииОбМЧДВДокументе);
			ПоложениеИнформацииОбМЧДВДокументе = СтрНайти(ТекстДокументаПослеОбъявленияМЧД, "Значен");
			Если НЕ ПоложениеИнформацииОбМЧДВДокументе = 0 Тогда 
				НомерМЧДПодписи = Сред(ТекстДокументаПослеОбъявленияМЧД, ПоложениеИнформацииОбМЧДВДокументе + 8, 36);
			КонецЕсли;	
		КонецЕсли;	
	КонецЕсли;
	
КонецПроцедуры 
	
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ОтображаемыйФайл = "";   
	ОтображаемыйФайлXML = "";
	НомерМЧДПодписи = "";
	ПричинаОтклонения = "";
	ПутьКДокументуXML = Параметры.ФайлXML;
	НомерМЧДПодписи = ?(Параметры.Свойство("НомерМЧДПодписи"), Параметры.НомерМЧДПодписи, "");
	ПричинаОтклонения = ?(Параметры.Свойство("ПричинаОтклонения"), Параметры.ПричинаОтклонения, "");
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	СформироватьОтображениеПросмотраXML();
	
	Элементы.НомерМЧД.Видимость = ЗначениеЗаполнено(НомерМЧДПодписи);
	Элементы.ПричинаОтклонения.Видимость = ЗначениеЗаполнено(ПричинаОтклонения);
	Если ЭтаФорма.Параметры.ОшибкаPDF тогда 
	Элементы.ГруппаPDF.Видимость = Ложь;
	Иначе
	ПоказатьPDF(Параметры.ФайлPDF); 
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии(ЗавершениеРаботы)
	//Очищаем поле, т.к. файл удаляется после закрытия формы
	ДокPDF = "";
КонецПроцедуры

Функция ПолучитьТекстПреобразования(ПутьКДокументу) 
	
	Обработка = РеквизитФормыВЗначение("Объект");
	Возврат Обработка.ПолучитьМакет("XSLПреобразование").ПолучитьТекст(); 
	
КонецФункции

&НаКлиенте
Функция ПолучитьДокументHTML(СтрокаHTML)
	
	ЧтениеHTML = Новый ЧтениеHTML;
	ЧтениеHTML.УстановитьСтроку(СтрокаHTML);
	
	ПостроительDOM = Новый ПостроительDOM;
	ДокументHTML = ПостроительDOM.Прочитать(ЧтениеHTML);
	ЧтениеHTML.Закрыть();
	 
	Возврат ДокументHTML;
	
КонецФункции

&НаКлиенте
Процедура XMLПриНажатии(Элемент, ДанныеСобытия, СтандартнаяОбработка)
	Данные = ДанныеСобытия;
КонецПроцедуры
