#Область СобытияФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("ИмяОбработки") Тогда
		ИмяОбработки = Параметры.ИмяОбработки;
	КонецЕсли;
	Если Параметры.Свойство("Организация") Тогда
		Организация = Параметры.Организация;
	КонецЕсли;
	Если Параметры.Свойство("АдресВременногоХранилищаКэш") Тогда
		АдресВременногоХранилищаКэш = Параметры.АдресВременногоХранилищаКэш;
	КонецЕсли;
	Если Параметры.Свойство("ИдентификаторОрганизацииВБД") Тогда
		ИдентификаторОрганизацииВБД = Параметры.ИдентификаторОрганизацииВБД;
	КонецЕсли;
	Если Параметры.Свойство("AccessToken") Тогда
		AccessToken = Параметры.AccessToken;
	КонецЕсли;
	Если Параметры.Свойство("RefreshToken") Тогда
		RefreshToken = Параметры.RefreshToken;
	КонецЕсли;
	Если Параметры.Свойство("ИспользоватьПодписание") Тогда
		ИспользоватьПодписание = Параметры.ИспользоватьПодписание;
	КонецЕсли;
	Если Параметры.Свойство("ВерсияНастроекОбработки") Тогда
		ВерсияНастроекОбработки = Параметры.ВерсияНастроекОбработки;
	КонецЕсли;
	Если Параметры.Свойство("ОтпечатокСертификатаBase64") Тогда
		ОтпечатокСертификатаBase64 = Параметры.ОтпечатокСертификатаBase64;
	КонецЕсли;
	Если Параметры.Свойство("ПарольДоступаКЗакрытомуКлючу") Тогда
		ПарольДоступаКЗакрытомуКлючу = Параметры.ПарольДоступаКЗакрытомуКлючу;
	КонецЕсли;
	Если Параметры.Свойство("ТипСубъектаПодписанта") Тогда
		ТипСубъектаПодписанта = Параметры.ТипСубъектаПодписанта;
	КонецЕсли;
	Если Параметры.Свойство("МчдGUIDПодписанта") Тогда
		МчдGUIDПодписанта = Параметры.МчдGUIDПодписанта;
	КонецЕсли;
	Если Параметры.Свойство("ДатаНачалаДействияМЧД") Тогда
		ДатаНачалаДействияМЧД = Параметры.ДатаНачалаДействияМЧД;
	КонецЕсли;
	Если Параметры.Свойство("ДолжностьФизлица") Тогда
		ДолжностьФизлица = Параметры.ДолжностьФизлица;
	КонецЕсли;
	
	ТекстПредупреждения = "Обработка списков большого объема занимает большое количества времени и системных ресурсов. "
								+"Рекомендуется делить файлы с большим количеством строк на части."
								+Символы.ПС+"На вход ожидается типовой CSV-файл, содержащий ИНН, КПП и идентификатор абонента, с разделителем в виде запятой или точки с запятой.";
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ВедущийФрагментАдресаKeycloak = ?(Объект.ЭтоТестоваяОбработка = Истина, "oauth-test", "oauth");
	realmФрагментАдресаKeycloak = ?(Объект.ЭтоТестоваяОбработка = Истина, "playground", "production");
		
КонецПроцедуры

#КонецОбласти

#Область СобытияЭлементовФормы

#Область КнопкаЗагрузитьТаблицуИзФайла

&НаКлиенте
Процедура ЗагрузитьТаблицуИзФайла(Команда)
	
	ТаблицаСопоставления.Очистить();
	
	Разделитель = ",";
	
	Диалог = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
	Диалог.Заголовок = "Выбор файла";
	Диалог.ИндексФильтра = 0;
	Диалог.ПредварительныйПросмотр = Ложь;
	Диалог.ПроверятьСуществованиеФайла = Истина;
	Диалог.МножественныйВыбор = Ложь;
	Диалог.Фильтр = "Файлы CSV(*.csv)|*.csv";
	
	Если Диалог.Выбрать() Тогда
		
		ИмяФайла = Диалог.ПолноеИмяФайла;
		
		Чтение = Новый ЧтениеТекста(ИмяФайла, КодировкаТекста.UTF8);
		
		СтрокаФайла = Чтение.ПрочитатьСтроку();
		Если СтрокаФайла = Неопределено Тогда
			СообщениеТекст = "В указанном CSV файле не обнаружено валидных данных.";
			ВывестиСообщениеВОтдельнойФорме(СообщениеТекст);
			Возврат;
		КонецЕсли;
		Если СтрНайти(СтрокаФайла, Разделитель) = 0 Тогда
			Если НЕ СтрНайти(СтрокаФайла, ";") = 0 Тогда
				Разделитель = ";";
			Иначе
				СообщениеТекст = "В выбранном CSV файле не обнаружены разделители строк ("","" или "";"").";
				ВывестиСообщениеВОтдельнойФорме(СообщениеТекст);
				Возврат;
			КонецЕсли;
		КонецЕсли;
		Пока СтрокаФайла <> Неопределено Цикл
			Поля = РазобратьСтрокуCSV(СтрокаФайла, Разделитель);
			НоваяСтрока = ТаблицаСопоставления.Добавить();
			НоваяСтрока.ИНН = Поля[0];
			НоваяСтрока.КПП = Поля[1];
			НоваяСтрока.Идентификатор = Поля[2];
			ДанныеОператора = ПолучитьПредставлениеИАвтороумингОператора(Лев(НоваяСтрока.Идентификатор, 3));
			Если НЕ ДанныеОператора = Неопределено Тогда 
				НоваяСтрока.Оператор = ДанныеОператора.Представление;
				Если ДанныеОператора.Автороуминг = "+" Тогда
					НоваяСтрока.Автороуминг = Истина;
				КонецЕсли;
			КонецЕсли;
			СтрокаФайла = Чтение.ПрочитатьСтроку();
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Функция РазобратьСтрокуCSV(Знач СтрокаCSV, Знач Разделитель = ";")
	
	Результат  = Новый Массив;
	Значение   = "";
	ВКавычках  = Ложь;
	Длина      = СтрДлина(СтрокаCSV);
	
	Индекс = 1;
	Пока Индекс <= Длина Цикл
		Символ = Сред(СтрокаCSV, Индекс, 1);
		
		Если Символ = """" Тогда
			Если ВКавычках И Сред(СтрокаCSV, Индекс + 1, 1) = """" Тогда
				Значение = Значение + """";
				Индекс = Индекс + 1;
			Иначе
				ВКавычках = НЕ ВКавычках;
			КонецЕсли;
		ИначеЕсли Символ = Разделитель И НЕ ВКавычках Тогда
			Результат.Добавить(Значение);
			Значение = "";
		Иначе
			Значение = Значение + Символ;
		КонецЕсли;
		
		Индекс = Индекс + 1;
	КонецЦикла;
	
	Результат.Добавить(Значение);
	Возврат Результат;
	
КонецФункции

#КонецОбласти

#Область КнопкаЗапуститьСопоставление

&НаКлиенте
Процедура ЗапуститьСопоставление(Команда)
	
	ЗаполнитьТаблицуСоответствиями();
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьТаблицуСоответствиями()
	
	СтруктураХранения1С = ПолучитьСтруктуруХранения1С();
	СвойствоИдентификатор = СтруктураХранения1С.СвойствоИдентификаторУчастника;
	
	Если СвойствоИдентификатор = Неопределено Тогда
		Сообщение = Новый СообщениеПользователю();
		Сообщение.Текст = "Не удалось определить дополнительное свойство для хранения идентификатора участника ЭДО.";
		Сообщение.Сообщить();
		Возврат;
	КонецЕсли;
	
	ТаблицаДляСоответствий = РеквизитФормыВЗначение("ТаблицаСопоставления");
	ТаблицаДляСоответствий = ТаблицаДляСоответствий.Скопировать(, "ИНН,КПП,Идентификатор,Оператор,Автороуминг");
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ВЫРАЗИТЬ(ТаблицаДляСопоставления.ИНН КАК СТРОКА(12)) КАК ИНН,
	               |	ВЫРАЗИТЬ(ТаблицаДляСопоставления.КПП КАК СТРОКА(9)) КАК КПП,
	               |	ТаблицаДляСопоставления.Идентификатор КАК Идентификатор,
	               |	ТаблицаДляСопоставления.Оператор КАК Оператор,
	               |	ТаблицаДляСопоставления.Автороуминг КАК Автороуминг
	               |ПОМЕСТИТЬ ТаблицаДляСопоставления
	               |ИЗ
	               |	&ТаблицаДляСопоставления КАК ТаблицаДляСопоставления
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ТаблицаДляСопоставления.ИНН КАК ИНН,
	               |	ТаблицаДляСопоставления.КПП КАК КПП,
	               |	ТаблицаДляСопоставления.Идентификатор КАК Идентификатор,
	               |	ТаблицаДляСопоставления.Оператор КАК Оператор,
	               |	ТаблицаДляСопоставления.Автороуминг КАК Автороуминг,
	               |	Контрагенты.Ссылка КАК Контрагент
	               |ПОМЕСТИТЬ ТаблицаКонтрагенты
	               |ИЗ
	               |	ТаблицаДляСопоставления КАК ТаблицаДляСопоставления
	               |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Контрагенты КАК Контрагенты
	               |		ПО ТаблицаДляСопоставления.ИНН = Контрагенты.ИНН
	               |			И ТаблицаДляСопоставления.КПП = Контрагенты.КПП
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ТаблицаКонтрагенты.ИНН КАК ИНН,
	               |	ТаблицаКонтрагенты.КПП КАК КПП,
	               |	ТаблицаКонтрагенты.Идентификатор КАК Идентификатор,
	               |	ТаблицаКонтрагенты.Оператор КАК Оператор,
	               |	ТаблицаКонтрагенты.Автороуминг КАК Автороуминг,
	               |	ЕСТЬNULL(ТаблицаКонтрагенты.Контрагент, ""Не обнаружен"") КАК Контрагент,
	               |	ДополнительныеСведения.Значение КАК ТекущийИдентификатор,
	               |	"""" КАК СостояниеРоуминга,
				   |	"""" КАК СтатусПриглашения,
	               |	ВЫБОР
	               |		КОГДА НЕ ТаблицаКонтрагенты.Контрагент ЕСТЬ NULL
	               |			ТОГДА ТаблицаКонтрагенты.Контрагент.ИНН
	               |		ИНАЧЕ """"
	               |	КОНЕЦ КАК КонтрагентИНН,
	               |	ВЫБОР
	               |		КОГДА НЕ ТаблицаКонтрагенты.Контрагент ЕСТЬ NULL
	               |			ТОГДА ТаблицаКонтрагенты.Контрагент.КПП
	               |		ИНАЧЕ """"
	               |	КОНЕЦ КАК КонтрагентКПП
	               |ИЗ
	               |	ТаблицаКонтрагенты КАК ТаблицаКонтрагенты
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ДополнительныеСведения КАК ДополнительныеСведения
	               |		ПО (НЕ ТаблицаКонтрагенты.Контрагент ЕСТЬ NULL)
	               |			И ТаблицаКонтрагенты.Контрагент = ДополнительныеСведения.Объект
	               |			И (ДополнительныеСведения.Свойство = &СвойстроИдентификаторАбонента)";
	Запрос.УстановитьПараметр("ТаблицаДляСопоставления", ТаблицаДляСоответствий);
	Запрос.УстановитьПараметр("СвойстроИдентификаторАбонента", СвойствоИдентификатор);
	Результат = Запрос.Выполнить().Выгрузить();
	
	ЗначениеВРеквизитФормы(Результат, "ТаблицаСопоставления");
	
КонецПроцедуры

#КонецОбласти

#Область КнопкаПерезаписатьИдентификаты

&НаКлиенте
Процедура ПерезаписатьИдентификаторы(Команда)
	
	ПерезаписатьИдентификаторыНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура ПерезаписатьИдентификаторыНаСервере()
	
	ОбновитьИдентификаторыУчастниковЭДОНаСервере();
	ЗаполнитьТаблицуСоответствиями();
	
КонецПроцедуры

#КонецОбласти

#Область КнопкаЗапроситьСостояниеРоуминга

&НаКлиенте
Процедура ЗапроситьСостоянияРоуминга(Команда)
	
	Если НЕ ЗначениеЗаполнено(ИдентификаторОрганизацииВБД) Тогда
		ТекстСообщения = "Идентификатор организации не заполнен."+Символы.ПС+"Заполните идентификатор на форме работы с контрагентами.";
		ВывестиСообщениеВОтдельнойФорме(ТекстСообщения);
	КонецЕсли;
	
	Для Каждого Строка из ТаблицаСопоставления Цикл
		
		Если Строка.Оператор = "Платформа ЭДО" Тогда
			Строка.СостояниеРоуминга = "Не требуется";
			Строка.СтатусПриглашения = "Не требуется";
			Продолжить;
		КонецЕсли;
		
		СостояниеРоуминга = ПолучитьСостояниеРоуминга(ИдентификаторОрганизацииВБД, Строка.ТекущийИдентификатор);
		Если НЕ СостояниеРоуминга = "Отсутствует" Тогда
			СтатусПриглашения = ПолучитьСостояниеПриглашения(ИдентификаторОрганизацииВБД, Строка.ТекущийИдентификатор);
		Иначе
			СтатусПриглашения = "";
		КонецЕсли;
		Строка.СостояниеРоуминга = СостояниеРоуминга;
		Строка.СтатусПриглашения = СтатусПриглашения;
		
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#Область КнопкаОтправитьПриглашения

&НаКлиенте
Процедура ОтправитьПриглашения(Команда)
	
	Для Каждого Строка из ТаблицаСопоставления Цикл
		
		Если Строка.СостояниеРоуминга = "Не требуется" ИЛИ Строка.СостояниеРоуминга = "Работает" ИЛИ Строка.СостояниеРоуминга = "Ожидает подтверждения" Тогда
			Продолжить;
		КонецЕсли;
		
		ОтправкаУспешна = ОтправитьПриглашениеКЭДО(ИдентификаторОрганизацииВБД, Строка.ТекущийИдентификатор);
		Если ОтправкаУспешна = Истина Тогда
			СтатусПриглашения = "Было отправлено";
		Иначе
			СтатусПриглашения = "Ошибка отправки";
		КонецЕсли;
		Строка.СтатусПриглашения = СтатусПриглашения;
		
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

&НаКлиенте
Процедура ТаблицаСопоставленияИдентификаторПриИзменении(Элемент)
	
	Если СтрДлина(Элементы.ТаблицаСопоставления.ТекущиеДанные.Идентификатор) > 3 Тогда 
		ДанныеОператора = ПолучитьПредставлениеИАвтороумингОператора(Лев(Элементы.ТаблицаСопоставления.ТекущиеДанные.Идентификатор, 3));
		Если НЕ ДанныеОператора = Неопределено Тогда 
			Элементы.ТаблицаСопоставления.ТекущиеДанные.Оператор = ДанныеОператора.Представление;
			Если ДанныеОператора.Автороуминг = "+" Тогда
				Элементы.ТаблицаСопоставления.ТекущиеДанные.Автороуминг = Истина;
			Иначе
				Элементы.ТаблицаСопоставления.ТекущиеДанные.Автороуминг = Ложь;
			КонецЕсли;
		Иначе
			Элементы.ТаблицаСопоставления.ТекущиеДанные.Оператор = "";
			Элементы.ТаблицаСопоставления.ТекущиеДанные.Автороуминг = Ложь;
		КонецЕсли;
	Иначе
		Элементы.ТаблицаСопоставления.ТекущиеДанные.Оператор = "";
		Элементы.ТаблицаСопоставления.ТекущиеДанные.Автороуминг = Ложь;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаСопоставленияКонтрагентПриИзменении(Элемент)

	ТаблицаСопоставленияКонтрагентПриИзмененииНаСервере();
	
	Если ЗначениеЗаполнено(Элементы.ТаблицаСопоставления.ТекущиеДанные.СостояниеРоуминга) Тогда
		СостояниеРоуминга = ПолучитьСостояниеРоуминга(ИдентификаторОрганизацииВБД, Элементы.ТаблицаСопоставления.ТекущиеДанные.ТекущийИдентификатор);
		СтатусПриглашения = ПолучитьСостояниеПриглашения(ИдентификаторОрганизацииВБД, Элементы.ТаблицаСопоставления.ТекущиеДанные.ТекущийИдентификатор);
		Элементы.ТаблицаСопоставления.ТекущиеДанные.СостояниеРоуминга = СостояниеРоуминга;
		Элементы.ТаблицаСопоставления.ТекущиеДанные.СтатусПриглашения = СтатусПриглашения;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ТаблицаСопоставленияКонтрагентПриИзмененииНаСервере()
	
	Если ТипЗнч(Элементы.ТаблицаСопоставления.ТекущиеДанные.Контрагент) = Тип("Строка") Тогда
		Элементы.ТаблицаСопоставления.ТекущиеДанные.КонтрагентИНН = "";
		Элементы.ТаблицаСопоставления.ТекущиеДанные.КонтрагентКПП = "";
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(Элементы.ТаблицаСопоставления.ТекущиеДанные.Контрагент) ИЛИ ТипЗнч(Элементы.ТаблицаСопоставления.ТекущиеДанные.Контрагент) = Тип("Строка") Тогда
		Возврат;
	КонецЕсли;
	
	Если НЕ ТипЗнч(Элементы.ТаблицаСопоставления.ТекущиеДанные.Контрагент) = Тип("Строка") Тогда
		Элементы.ТаблицаСопоставления.ТекущиеДанные.КонтрагентИНН = Элементы.ТаблицаСопоставления.ТекущиеДанные.Контрагент.ИНН;
		Элементы.ТаблицаСопоставления.ТекущиеДанные.КонтрагентКПП = Элементы.ТаблицаСопоставления.ТекущиеДанные.Контрагент.КПП;
	КонецЕсли;
	
	ИдентификаторКонтрагента = ПолучитьИдентификаторЭДОИз1СПоСсылке(Элементы.ТаблицаСопоставления.ТекущиеДанные.Контрагент);
	Если ЗначениеЗаполнено(ИдентификаторКонтрагента) Тогда
		Элементы.ТаблицаСопоставления.ТекущиеДанные.ТекущийИдентификатор = ИдентификаторКонтрагента;
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыФункции

&НаСервере
Процедура ИнициализацияКэш(Откат = Ложь)
	
	// Инициализируем Кэш 
	Кэш = ЗагрузитьКэш(Откат); 
	СохранитьКэш(Кэш); 
	
КонецПроцедуры

// Функция загрузки Кэш
// Если значение реквизита формы "АдресВременногоХранилищаКэш" заполнено, то берем Кэш из временного хранилища (ШтатныйЗапуск())
&НаСервере
Функция ЗагрузитьКэш(Откат = Ложь)       
	
	Если ЗначениеЗаполнено(ЭтаФорма.АдресВременногоХранилищаКэш) и Не Откат Тогда
		
		Кэш = ПолучитьИзВременногоХранилища(ЭтаФорма.АдресВременногоХранилищаКэш);
		
		Если НЕ ЗначениеЗаполнено(Кэш) Тогда
			МодульОбъектаОбработки = РеквизитФормыВЗначение("Объект");
			Кэш = МодульОбъектаОбработки.Инициализация(Откат);
			ЗначениеВРеквизитФормы(МодульОбъектаОбработки, "Объект");
		КонецЕсли;	
		
		Возврат Кэш;
		
	Иначе
		
		МодульОбъектаОбработки = РеквизитФормыВЗначение("Объект");
		Кэш = МодульОбъектаОбработки.Инициализация(Откат);
		ЗначениеВРеквизитФормы(МодульОбъектаОбработки, "Объект"); 
		
		Возврат Кэш;
		
	КонецЕсли;
	
КонецФункции

// Функция сохранения Кэш в процессе работы
// В текущий Кэш записываем только требуемые для выгрузки настройки, остальные динамически подргружаем по мере необходимости
&НаСервере
Процедура СохранитьКэш(Кэш)
	
	// Удаляем предыдущее значение Кэш из временного хранилища
	Если ЗначениеЗаполнено(ЭтаФорма.АдресВременногоХранилищаКэш) Тогда
		//УдалитьИзВременногоХранилища(ЭтаФорма.АдресВременногоХранилищаКэш);
		Адрес = ЭтаФорма.АдресВременногоХранилищаКэш;
	Иначе
		Адрес = ЭтаФорма.УникальныйИдентификатор;
	КонецЕсли;
	
	// Записываем новое значение Кэш во временное хранилище
	ЭтаФорма.АдресВременногоХранилищаКэш = ПоместитьВоВременноеХранилище(Кэш, Адрес);	
	
КонецПроцедуры

&НаКлиенте
Функция СкопироватьКоллекцию(ВходящаяКоллекция)
	
	Если ТипЗнч(ВходящаяКоллекция) = Тип("Структура") Тогда
		НоваяКоллекция = Новый Структура;
	ИначеЕсли ТипЗнч(ВходящаяКоллекция) = Тип("Соответствие") Тогда
		НоваяКоллекция = Новый Соответствие;
	КонецЕсли;
	
	Для Каждого ЭлементКоллекции из ВходящаяКоллекция Цикл
		
		Если ТипЗнч(ЭлементКоллекции.Значение) = Тип("Структура") ИЛИ ТипЗнч(ЭлементКоллекции.Значение) = Тип("Соответствие") Тогда				
			Значение = СкопироватьКоллекцию(ЭлементКоллекции.Значение);			
			НоваяКоллекция.Вставить(ЭлементКоллекции.Ключ, Значение);	
		Иначе
			НоваяКоллекция.Вставить(ЭлементКоллекции.Ключ, ЭлементКоллекции.Значение);
		КонецЕсли;
		
    КонецЦикла;
	
	Возврат НоваяКоллекция;
	
КонецФункции

&НаКлиенте
Процедура СохранитьПараметрыАвторизацииИПодписанияОрганизации(Организация, AccessTokenОрганизации, RefreshTokenОрганизации, ИспользоватьПодписание, ОтпечатокСертификатаBase64Организации, ПарольДоступаКЗакрытомуКлючуОрганизации, ТипСубъектаОрганизации, МчдGUIDОрганизации, ДатаНачалаДействияМЧДОрганизации, ДолжностьФизлицаОрганизации)

	ПараметрыАвторизацииИПодписанияОрганизации = Новый Структура;
	
	ПараметрыАвторизацииИПодписанияОрганизации.Вставить("AccessToken", AccessTokenОрганизации);
	ПараметрыАвторизацииИПодписанияОрганизации.Вставить("RefreshToken", RefreshTokenОрганизации);
	ПараметрыАвторизацииИПодписанияОрганизации.Вставить("ИспользуетсяПодписание", ИспользоватьПодписание);
	
	ПараметрыПодписания = Новый Структура;
	 
	ПараметрыПодписания.Вставить("ОтпечатокСертификатаBase64", ОтпечатокСертификатаBase64Организации);
	ПараметрыПодписания.Вставить("ПарольДоступаКЗакрытомуКлючу", ПарольДоступаКЗакрытомуКлючуОрганизации);
	Менеджер = ПолучитьМенеджерКриптографии(, Ложь);
	Сертификат  = ПолучитьЭЦППоОтпечатку(Менеджер, Base64Значение(ОтпечатокСертификатаBase64Организации), Ложь);
	Если ТипЗнч(Сертификат) = Тип("СертификатКриптографии") Тогда 
		ПараметрыПодписания.Вставить("Субъект", Сертификат.Субъект);
	Иначе
		ПараметрыПодписания.Вставить("Субъект", Неопределено);
	КонецЕсли;
	ПараметрыПодписания.Вставить("ТипСубъекта", ТипСубъектаОрганизации);
	ПараметрыПодписания.Вставить("МчдGUID", МчдGUIDОрганизации);
	ПараметрыПодписания.Вставить("ДатаНачалаДействияМЧД", ДатаНачалаДействияМЧДОрганизации);
	ПараметрыПодписания.Вставить("ДолжностьФизлица", ?(ЗначениеЗаполнено(ДолжностьФизлицаОрганизации), ДолжностьФизлицаОрганизации, Неопределено));
	
	ПараметрыАвторизацииИПодписанияОрганизации.Вставить("ПараметрыПодписания", ПараметрыПодписания);
	
	ОбновитьПараметрыАвторизацииИПодписанияОрганизации(Организация, ПараметрыАвторизацииИПодписанияОрганизации);	
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьПараметрыАвторизацииИПодписанияОрганизации(Организация, ПараметрыАвторизацииИПодписанияОрганизации)
	
	Интеграция = ПолучитьИнтеграциюНаСервере(ВерсияНастроекОбработки);
	
	Если НЕ Интеграция.Свойство("ПараметрыАвторизацииИПодписания") Тогда
		Интеграция.Вставить("ПараметрыАвторизацииИПодписания", Новый Соответствие);
	КонецЕсли;
		
	Интеграция.ПараметрыАвторизацииИПодписания.Вставить(Организация, ПараметрыАвторизацииИПодписанияОрганизации);	
	
	СохранитьИнтеграциюНаСервере(Интеграция);
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьИнтеграциюНаСервере(ВерсияНастроекОбработки) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	СписокЗначений = ХранилищеОбщихНастроек.ПолучитьСписок("ОФД_ЭДО_НастройкиОбработки", ПолучитьТекущегоПользователя());
	Интеграция = СписокЗначений.НайтиПоЗначению("Интеграция");
	
	// Информация об интеграции уже есть в хранилище значений 
	Если ТипЗнч(Интеграция) = Тип("ЭлементСпискаЗначений") Тогда
		
		Возврат ХранилищеОбщихНастроек.Загрузить("ОФД_ЭДО_НастройкиОбработки", 	// Ключ объекта
		"Интеграция",															// Ключ настройки 
		"Информация о способе интеграции обработки ОФД ЭДО.", 					// описание настройки
		ПолучитьТекущегоПользователя()); 										// Пользователь
		
	Иначе 
		// Это первый запуск, возвращаем пустую структуру
		Интеграция = Новый Структура;
		Интеграция.Вставить("СпособИнтеграции");
		Интеграция.Вставить("КаталогОбмена");
		Интеграция.Вставить("ИспользоватьКриптографию");
		Интеграция.Вставить("ПараметрыАвторизацииИПодписания", Новый Соответствие);
		Интеграция.Вставить("ВерсияНастроек", ВерсияНастроекОбработки);
		Интеграция.Вставить("МассоваяВыгрузка", Новый Структура);
		
		Возврат Интеграция;
		
	КонецЕсли; 	
	
	УстановитьПривилегированныйРежим(Ложь);
	
КонецФункции

&НаСервереБезКонтекста
Процедура СохранитьИнтеграциюНаСервере(Интеграция) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	ХранилищеОбщихНастроек.Сохранить("ОФД_ЭДО_НастройкиОбработки", 								// Ключ объекта
	"Интеграция",											// Ключ настройки 
	Интеграция,												// Настройка
	"Информация о способе интеграции обработки ОФД ЭДО.", 	// описание настройки
	ПолучитьТекущегоПользователя()); 						// Пользователь     
	
	УстановитьПривилегированныйРежим(Ложь);	
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьТекущегоПользователя()
	
	Возврат Неопределено;
	
	Если НЕ Метаданные.ОбщиеМодули.Найти("ПользователиИнформационнойБазы") = Неопределено Тогда
		ТекущийПользователь = ПользователиИнформационнойБазы.ТекущийПользователь();
	Иначе
		ТекущийПользователь = ПользователиКлиентСервер.ТекущийПользователь();
	КонецЕсли;	
	
	Возврат ТекущийПользователь;
	
КонецФункции

&НаКлиенте
Процедура ВывестиСообщениеВОтдельнойФорме(ТекстСообщения, ПолныйТехническийТекстСообщения = "")
	
	Если НЕ ЗначениеЗаполнено(ТекстСообщения) Тогда
		Возврат;
	КонецЕсли;
	
	ОповещениеОЗакрытии = Новый ОписаниеОповещения();
	ПараметрыОткрытияФормы = Новый Структура();
	ПараметрыОткрытияФормы.Вставить("ТекстСообщения", ТекстСообщения);
	Если ЗначениеЗаполнено(ПолныйТехническийТекстСообщения) Тогда
		ПараметрыОткрытияФормы.Вставить("ПолныйТехническийТекстСообщения", ПолныйТехническийТекстСообщения);
	КонецЕсли;
	ОповещениеОЗакрытии = Новый ОписаниеОповещения();
	ОткрытьФорму(ИмяОбработки + ".Форма.ФормаВыводаСообщений", ПараметрыОткрытияФормы, ЭтаФорма, , , , ОповещениеОЗакрытии, РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);
	
КонецПроцедуры

//Возвращаемое значение:
// Структура, ключ - Представление, значение - Автороуминг (булево)
&НаСервере
Функция ПолучитьПредставлениеИАвтороумингОператора(ИДОператора)
	
	СтруктураВозврата = Новый Структура;
		
	ОбработкаОбъект = РеквизитФормыВЗначение("Объект");
	
	Макет = ОбработкаОбъект.ПолучитьМакет("СлужебныеДанные"); 
	
	Построитель = Новый ПостроительЗапроса;
	Построитель.ИсточникДанных = Новый ОписаниеИсточникаДанных(Макет.Область());
    Построитель.ДобавлениеПредставлений = ТипДобавленияПредставлений.НеДобавлять;
    Построитель.ЗаполнитьНастройки();
    Построитель.Выполнить();
	
	ТЗ = Построитель.Результат.Выгрузить(); 
	ОтборСтрок = Новый Структура;
	
	ОтборСтрок.Вставить("Идентификатор", ИДОператора);
	
	НайденныеСтроки = ТЗ.НайтиСтроки(ОтборСтрок);
	
	Если НЕ НайденныеСтроки.Количество() = 0 тогда
		СтруктураВозврата.Вставить("Идентификатор", НайденныеСтроки[0].Идентификатор);
		СтруктураВозврата.Вставить("Представление", НайденныеСтроки[0].Представление);
		СтруктураВозврата.Вставить("Автороуминг", НайденныеСтроки[0].Автороуминг);
	Иначе
	    СтруктураВозврата = Неопределено;
	КонецЕсли;
	
	Возврат СтруктураВозврата;
	
КонецФункции

&НаСервере
Функция ПолучитьСтруктуруХранения1С() Экспорт
	
	ИмяМетаданных = "Конфигурация";
	Кэш = ПолучитьИзВременногоХранилища(АдресВременногоХранилищаКэш);    
	
	Если Кэш.НастройкиОбъект[Кэш.ПрефиксКонфигурации+ИмяМетаданных] = Неопределено Тогда				
		ИнициализацияКэш(Истина);
		Кэш = ПолучитьИзВременногоХранилища(АдресВременногоХранилищаКэш);		
	КонецЕсли;
	
	Настройка = Кэш.НастройкиОбъект[Кэш.ПрефиксКонфигурации+ИмяМетаданных].ХранениеИнформации1С;
	
	СтрокаВызоваСвойствоИдентификатор 			= Настройка.ОФД_ЭДО_ИдентификаторДокумента.ТипОбъектаМетаданных + "." + 
	Настройка.ОФД_ЭДО_ИдентификаторДокумента.Путь + ".НайтиПоНаименованию(" + Символ(034) + 
	Настройка.ОФД_ЭДО_ИдентификаторДокумента.Наименование + Символ(034) + ")";
	
	СтрокаВызоваСвойствоСтатус					= Настройка.ОФД_ЭДО_СтатусДокумента.ТипОбъектаМетаданных + "." + 
	Настройка.ОФД_ЭДО_СтатусДокумента.Путь + ".НайтиПоНаименованию(" + Символ(034) + 
	Настройка.ОФД_ЭДО_СтатусДокумента.Наименование + Символ(034) + ")";
	
	СтрокаВызоваСвойствоИдентификаторУчастника	= Настройка.ОФД_ЭДО_ИдентификаторУчастникаЭДО.ТипОбъектаМетаданных + "." + 
	Настройка.ОФД_ЭДО_ИдентификаторУчастникаЭДО.Путь + ".НайтиПоНаименованию(" + Символ(034) + 
	Настройка.ОФД_ЭДО_ИдентификаторУчастникаЭДО.Наименование + Символ(034) + ")";
	
	СвойствоИдентификатор 				= Вычислить(СтрокаВызоваСвойствоИдентификатор);									
	СвойствоСтатус						= Вычислить(СтрокаВызоваСвойствоСтатус);
	СвойствоИдентификаторУчастника		= Вычислить(СтрокаВызоваСвойствоИдентификаторУчастника);
	
	СтруктураХранения1С = Новый Структура;
	СтруктураХранения1С.Вставить("СвойствоИдентификатор",			СвойствоИдентификатор);
	СтруктураХранения1С.Вставить("СвойствоСтатус",					СвойствоСтатус);
	СтруктураХранения1С.Вставить("СвойствоИдентификаторУчастника",	СвойствоИдентификаторУчастника);
	СтруктураХранения1С.Вставить("НаименованиеРегистра",			Настройка.Путь);
	
	Возврат СтруктураХранения1С;
	
КонецФункции

#КонецОбласти

#Область ИнтеграцияAPI

&НаКлиенте
Функция ПолучитьСостояниеРоуминга(ИдентификаорОтправителя, ИдентификаторПолучателя)
	
	СостояниеРоуминга = "Не настроен";
	
	Если ЗначениеЗаполнено(ИдентификаторПолучателя) Тогда
		
		ПараметрыЗапроса = ПолучитьШаблонПараметровЗапроса();
		
		ПараметрыЗапроса.Параметры.Вставить("<sender_gid>", ИдентификаорОтправителя);
		ПараметрыЗапроса.Параметры.Вставить("<gids>", ИдентификаторПолучателя);
		
		СтатусРоумингаЭДО = ВыполнитьЗапросAPI("API_ПолучитьСтатусРоумингаЭДО", ПараметрыЗапроса);
		
		Если НЕ СтатусРоумингаЭДО.Ошибка Тогда
			
			Если НЕ СтатусРоумингаЭДО.Результат = Неопределено Тогда
				
				Для Каждого Результат Из СтатусРоумингаЭДО.Результат Цикл
					Если Результат.state.status = "ESTABLISHED" Тогда
						// Роуминг работает, отправка возможна.
						СостояниеРоуминга = "Работает";
						Продолжить;
					ИначеЕсли Результат.state.status = "AWAIT_APPROVAL" Тогда
						// Для установки связи требуется наличие приглашения от второй стороны.
						СостояниеРоуминга = "Ожидает подтверждения";
						Продолжить;
					ИначеЕсли Результат.state.status = "BROKEN" Тогда
						// Приглашение было обработано со стороны оператора-получателя.
						СостояниеРоуминга = "Был отменен";
						Продолжить;	
					КонецЕсли;	
				КонецЦикла; 
				
				Возврат СостояниеРоуминга;
				
			КонецЕсли;
			
		Иначе
					
			СостояниеРоуминга = "Ошибка получения данных о состоянии роуминга ЭДО.";
			Возврат СостояниеРоуминга;
				
		КонецЕсли;
		
	Иначе
		
		СостояниеРоуминга = "Отсутствует";
		
	КонецЕсли;
	
	Возврат СостояниеРоуминга;
	
КонецФункции

&НаКлиенте
Функция ПолучитьСостояниеПриглашения(ИдентификаорОтправителя, ИдентификаторПолучателя)
	
	СостояниеПриглашения = "Не отправлялось.";	
	
	ПараметрыЗапроса = ПолучитьШаблонПараметровЗапроса();
	
	ПараметрыЗапроса.Параметры.Вставить("<sender_gid>", ИдентификаорОтправителя);
	ПараметрыЗапроса.Параметры.Вставить("<recipient_gid>", ИдентификаторПолучателя);
	
	СтатусПриглашения = ВыполнитьЗапросAPI("API_ПолучитьСтатусПриглашенияКЭДО", ПараметрыЗапроса);
	
	Если НЕ СтатусПриглашения.Ошибка Тогда
		
		Если НЕ СтатусПриглашения.Результат = Неопределено Тогда
			
			Для Каждого Результат Из СтатусПриглашения.Результат Цикл
				Если Результат.type = "BREAK" Тогда
					// Приглашение было отклонено со стороны оператора-получателя.
					СостояниеПриглашения = "Отклонено. Отправка возможна.";
					Продолжить;
				ИначеЕсли НЕ Результат.type = "REQUEST" Тогда
					// Приглашение было обработано со стороны оператора-получателя.
					СостояниеПриглашения = "Было отправлено. Ответ еще не получен.";
					Продолжить;
				Иначе
					Если Результат.status = "SENDING" Тогда
						// В процессе отправки.	
						СостояниеПриглашения = "Было отправлено. Обрабатывается оператором получателя.";
						Продолжить;
					ИначеЕсли Результат.status = "SENT" Тогда
						// Отправлено.
						СтатусПриглашения = "Было доставлено.";
						Продолжить;
					ИначеЕсли Результат.status = "FAILED" Тогда
						// Произошла ошибка в процессе отправки.
						СостояниеПриглашения = "Ошибка отправки. Отправка возможна.";
						Продолжить;
					Иначе
						Продолжить;
					КонецЕсли;		
					Прервать;
				КонецЕсли;	
			КонецЦикла;	
			
		КонецЕсли;
		
	Иначе	
				
		СостояниеПриглашения = "Ошибка получения данных о пригашениях к ЭДО.";
		
	КонецЕсли;
	
	Возврат СостояниеПриглашения;
	
КонецФункции

&НаКлиенте
Функция ОтправитьПриглашениеКЭДО(ИдентификаорОтправителя, ИдентификаторПолучателя)
	
	ПриглашениеБылоОтправлено = Ложь;
	
	ПараметрыЗапроса = ПолучитьШаблонПараметровЗапроса();
	
	ПараметрыЗапроса.Параметры.Вставить("<sender_gid>", ИдентификаорОтправителя);
	ПараметрыЗапроса.Параметры.Вставить("<recipient_gid>", ИдентификаторПолучателя);
	
	ОтправкаПриглашения = ВыполнитьЗапросAPI("API_ОтправитьАбонентуПриглашениеКЭДО", ПараметрыЗапроса);
	
	Если НЕ ОтправкаПриглашения.Ошибка Тогда
		
		Если ОтправкаПриглашения.КодСостояния = 204 Тогда
			ПриглашениеБылоОтправлено = Истина;
		КонецЕсли;	
		
	Иначе	
		
		Сообщение = Новый СообщениеПользователю();
		Сообщение.Текст = "Не удалось сформировать приглашение в системе ЭДО."+Символы.ПС+"Описание ошибки:"+Символы.ПС+ОтправкаПриглашения.Описание;
		Сообщение.Сообщить();
				
	КонецЕсли;
	
	Возврат ПриглашениеБылоОтправлено;
	
КонецФункции

&НаКлиенте
Функция ВыполнитьЗапросAPI(ИмяФункцииЗапроса, ВходящиеПараметрыЗапроса) Экспорт
	
	РезультатЗапроса = ПолучитьШаблонСтруктурыОтвета();
	РезультатЗапроса.Ошибка = Истина;
	
	ПараметрыЗапроса = СкопироватьКоллекцию(ВходящиеПараметрыЗапроса);
	
	Выполнить("РезультатЗапроса = "+ИмяФункцииЗапроса+"(ПараметрыЗапроса);");
	
	Если РезультатЗапроса.КодСостояния = 401 ИЛИ РезультатЗапроса.КодСостояния = 500 Тогда
		
		// Ошибка авторизации.
		// Попытка обновить токен по сертификату.
		Если ИспользоватьПодписание = Истина И НЕ ЗначениеЗаполнено(RefreshToken) Тогда
			
			Если ПараметрыЗапроса.Свойство("Заголовки") И НЕ ПараметрыЗапроса.Заголовки.Получить("Authorization") = Неопределено Тогда	
				НовыйТокен = ПолучитьТокенПоОтпечаткуСертификата(Base64Значение(ОтпечатокСертификатаBase64), ПарольДоступаКЗакрытомуКлючу);
				Если НЕ НовыйТокен = Неопределено Тогда
					ПараметрыЗапроса = СкопироватьКоллекцию(ВходящиеПараметрыЗапроса);
					ПараметрыЗапроса.Заголовки.Вставить("Authorization", "Bearer "+ НовыйТокен);
					Выполнить("РезультатЗапроса = "+ИмяФункцииЗапроса+"(ПараметрыЗапроса);");
					Если РезультатЗапроса.КодСостояния = 200 Тогда
						AccessToken = НовыйТокен;
						RefreshToken = "";
						СохранитьПараметрыАвторизацииИПодписанияОрганизации(Организация, AccessToken, RefreshToken, ИспользоватьПодписание, ОтпечатокСертификатаBase64, ПарольДоступаКЗакрытомуКлючу, ТипСубъектаПодписанта, МчдGUIDПодписанта, ДатаНачалаДействияМЧД, ДолжностьФизлица);
					КонецЕсли;	
				КонецЕсли;	
			КонецЕсли;
			
		ИначеЕсли ЗначениеЗаполнено(AccessToken) И ЗначениеЗаполнено(RefreshToken) Тогда 	
			
			Если ПараметрыЗапроса.Свойство("Заголовки") И НЕ ПараметрыЗапроса.Заголовки.Получить("Authorization") = Неопределено Тогда
				FreshTokens = RefreshTokens(RefreshToken);
				Если НЕ FreshTokens = Неопределено Тогда
					НовыйAccessToken = FreshTokens.access_token;
					НовыйRefreshToken = FreshTokens.refresh_token;
					AccessToken = НовыйAccessToken;
					RefreshToken = НовыйRefreshToken;
					ПараметрыЗапроса = СкопироватьКоллекцию(ВходящиеПараметрыЗапроса);
					ПараметрыЗапроса.Заголовки.Вставить("Authorization", "Bearer "+ AccessToken);
					Выполнить("РезультатЗапроса = "+ИмяФункцииЗапроса+"(ПараметрыЗапроса);");
					Если РезультатЗапроса.КодСостояния = 200 Тогда	
						СохранитьПараметрыАвторизацииИПодписанияОрганизации(Организация, AccessToken, RefreshToken, ИспользоватьПодписание, ОтпечатокСертификатаBase64, ПарольДоступаКЗакрытомуКлючу, ТипСубъектаПодписанта, МчдGUIDПодписанта, ДатаНачалаДействияМЧД, ДолжностьФизлица);
					КонецЕсли;	
				КонецЕсли;
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли;	
	
	Возврат РезультатЗапроса;
	
КонецФункции

&НаКлиенте
Функция ПолучитьШаблонПараметровЗапроса() Экспорт
	
	Структура = Новый Структура;
	
	Структура.Вставить("Соединение", 	ПолучитьСоединение());
	Структура.Вставить("Заголовки", 	ПолучитьЗаголовки());
	Структура.Вставить("Параметры", 	Новый Соответствие);
	
	Возврат Структура;
	
КонецФункции

&НаКлиенте
Функция ПолучитьЗаголовки()
	
	Заголовки = Новый Соответствие;
	//Заголовки.Вставить("accept", "application/json;charset=UTF-8");
	Заголовки.Вставить("accept", "*/*");
	Заголовки.Вставить("Authorization", "Bearer "+ AccessToken);
	
	Возврат Заголовки;
	
КонецФункции

&НаКлиенте
Функция ПолучитьСоединение_Устаревшее() // Удалить
	
	СертификатКлиентаWin 	= Новый СертификатКлиентаWindows(СпособВыбораСертификатаWindows.Выбирать);
	СертификатУЦWin 		= Неопределено; //Новый СертификатыУдостоверяющихЦентровWindows();
	
	ssl = Новый ЗащищенноеСоединениеOpenSSL(СертификатКлиентаWin, СертификатУЦWin); 		
	
	Если Объект.ЭтоТестоваяОбработка Тогда		
		// Тест
		Соединение  =  Новый HTTPСоединение("edo-test.platformaofd.ru", //сервер
		443, 	//порт
		,		//логин
		,		//пароль
		,		//прокси
		20,		//таймаут
		ssl,);	//защищенное HTTPS соединение 			
	Иначе	
		// Бой
		Соединение  =  Новый HTTPСоединение("edo.platformaofd.ru", //сервер
		443,	//порт
		,		//логин
		,		//пароль
		,		//прокси
		20,		//таймаут
		ssl,);	//защищенное HTTPS соединение
	КонецЕсли; 	
	
	Возврат Соединение;
	
КонецФункции

&НаКлиенте
Функция ПолучитьСоединение()
	
	СертификатКлиентаWin 	= Новый СертификатКлиентаWindows(СпособВыбораСертификатаWindows.Выбирать);
	СертификатУЦWin 		= Неопределено; //Новый СертификатыУдостоверяющихЦентровWindows();
	
	ssl = Новый ЗащищенноеСоединениеOpenSSL(СертификатКлиентаWin, СертификатУЦWin); 		
	
	Если Объект.ЭтоТестоваяОбработка Тогда		
		// Тест
		Соединение  =  Новый HTTPСоединение("api-test.platformaofd.ru", //сервер
		443, 	//порт
		,		//логин
		,		//пароль
		,		//прокси
		20,		//таймаут
		ssl,);	//защищенное HTTPS соединение 			
	Иначе	
		// Бой
		Соединение  =  Новый HTTPСоединение("api.platformaofd.ru", //сервер
		443,	//порт
		,		//логин
		,		//пароль
		,		//прокси
		20,		//таймаут
		ssl,);	//защищенное HTTPS соединение
	КонецЕсли; 	
	
	Возврат Соединение;
	
КонецФункции

// Функция заполняет параметры запроса в строке запроса
&НаКлиенте
Функция ЗаполнитьПараметрыВЗапросе(СтрокаЗапроса, Параметры) Экспорт
	
	Для Каждого Параметр из Параметры Цикл
		
		Если НЕ СтрНайти(СтрокаЗапроса, Параметр.Ключ) = 0 Тогда
			СтрокаЗапроса = СтрЗаменить(СтрокаЗапроса, Параметр.Ключ, Параметр.Значение);
			Параметры.Удалить(Параметр.Ключ);
		КонецЕсли;
		
	КонецЦикла;	
	
	Возврат СтрокаЗапроса;
	
КонецФункции

// Функция подготавливает шаблон структуры ответа
&НаКлиенте
Функция ПолучитьШаблонСтруктурыОтвета()
	
	Структура = Новый Структура();
	
	Структура.Вставить("Результат", 	Неопределено);
	Структура.Вставить("Ошибка", 		Ложь);
	Структура.Вставить("Описание", 		""); 
	Структура.Вставить("КодСостояния",	"");
	
	Возврат Структура;
	
КонецФункции // ПолучитьШаблонСтруктурыОтвета()

// Функция обрабатывает ответ запроса по коду состояния
&НаКлиенте
Функция ОбработатьОтвет(Ответ, СтруктураОтвета, ЭтоФайл = Ложь) Экспорт 
	
	СтруктураОтвета.КодСостояния = Ответ.КодСостояния;
	ОтветОбработан = Ложь;
	Тело = Ответ.ПолучитьТелоКакСтроку();	
	
	ТекущаяДата = Строка(ТекущаяДата());
	
	Если СтруктураОтвета.КодСостояния = 200 Тогда
		
		Если Тело = "[]" или Тело = "" Тогда
			СтруктураОтвета.Описание 		= ТекущаяДата + " Пустой ответ.";
		Иначе 
			Если НЕ ЭтоФайл Тогда
				ЧтениеJSON = Новый ЧтениеJSON();
				ЧтениеJSON.УстановитьСтроку(Тело);
				СтруктураОтвета.Результат = ПрочитатьJSON(ЧтениеJSON);			
				ЧтениеJSON.Закрыть(); 
			Иначе
				ДвоичныеДанныеФайла = Ответ.ПолучитьТелоКакДвоичныеДанные();
				СтруктураОтвета.Результат = ДвоичныеДанныеФайла;
				СтруктураОтвета.Вставить("Тип", Ответ.Заголовки.Получить("Content-Type"));
			КонецЕсли;	
		КонецЕсли;
		
		Возврат СтруктураОтвета;
		
	КонецЕсли;
	
	
	Если СтруктураОтвета.КодСостояния = 201 Тогда 
		
		Если Тело = "[]" Тогда
			СтруктураОтвета.Описание 		= ТекущаяДата + " Вроде норм, но че-то непонятно.";
			СтруктураОтвета.КодСостояния 	= 0;
		Иначе 
			ЧтениеJSON = Новый ЧтениеJSON();
			ЧтениеJSON.УстановитьСтроку(Тело);
			СтруктураОтвета.Результат = ПрочитатьJSON(ЧтениеJSON);			
			ЧтениеJSON.Закрыть();  
		КонецЕсли;
		
		Возврат СтруктураОтвета;	
		
	КонецЕсли;
	
	
	Если СтруктураОтвета.КодСостояния = 400 Тогда
		СтруктураОтвета.Ошибка 		= Истина;
		СтруктураОтвета.Описание 	= ТекущаяДата + " Error 400. Ошибка выгружаемых данных." + ?(ЗначениеЗаполнено(Тело), " ("+Тело+")", ""); 	
		Возврат СтруктураОтвета; 	
	КонецЕсли;
	
	Если СтруктураОтвета.КодСостояния = 401 Тогда
		СтруктураОтвета.Ошибка 		= Истина;
		СтруктураОтвета.Описание 	= ТекущаяДата + " Error 401. Ошибка авторизации. Проверье авторизацию в разделе настройки и повторите запрос позднее." + ?(ЗначениеЗаполнено(Тело), " ("+Тело+")", "");		
		Возврат СтруктураОтвета;	
	КонецЕсли;	
	
	Если СтруктураОтвета.КодСостояния = 403 Тогда
		СтруктураОтвета.Ошибка 		= Истина;
		СтруктураОтвета.Описание 	= ТекущаяДата +" Error 403." + ?(ЗначениеЗаполнено(Тело), " ("+Тело+")", "");	
		Возврат СтруктураОтвета; 
	КонецЕсли; 	
	
	Если СтруктураОтвета.КодСостояния = 404 Тогда
		СтруктураОтвета.Ошибка 		= Истина;
		СтруктураОтвета.Описание 	= ТекущаяДата +" Error 404." + ?(ЗначениеЗаполнено(Тело), " ("+Тело+")", "");		
		Возврат СтруктураОтвета;		
	КонецЕсли;
	
	Если СтруктураОтвета.КодСостояния = 500 Тогда
		СтруктураОтвета.Ошибка 		= Истина;
		СтруктураОтвета.Описание 	= ТекущаяДата +" Error 500. Сервис недоступен. Повторите запрос позднее." + ?(ЗначениеЗаполнено(Тело), " ("+Тело+")", ""); 		
		Возврат СтруктураОтвета; 		
	КонецЕсли;
	
	Если СтруктураОтвета.КодСостояния = 204 Тогда
		СтруктураОтвета.Ошибка 		= Ложь;
		СтруктураОтвета.Описание 	= ТекущаяДата +" Успешно."; 		
		Возврат СтруктураОтвета; 		
	КонецЕсли;
	
	СтруктураОтвета.Ошибка 		= Истина;
	СтруктураОтвета.Описание 	= ТекущаяДата + " Error " + СтруктураОтвета.КодСостояния + ". Неизвестная ошибка сервиса." + ?(ЗначениеЗаполнено(Тело), " ("+Тело+")", "");      			
	Возврат СтруктураОтвета;
	
КонецФункции

&НаКлиенте
Функция API_ПолучитьТокенАвторизацииПоСертификату(Знач ПараметрыЗапроса) Экспорт
	
	ЗаголовкиЗапроса = Новый Соответствие;
	ЗаголовкиЗапроса.Вставить("Content-Type", "application/x-www-form-urlencoded");
	ЗаголовкиЗапроса.Вставить("x-client-id", ПараметрыЗапроса.Параметры.Получить("ИдентификаторКлиента"));
	ЗаголовкиЗапроса.Вставить("Content-Encoding", "utf-8");
	ПараметрыЗапроса.Заголовки = ЗаголовкиЗапроса;
	
	СтрокаЗапроса = "/edm-security/public/api/v3/oauth/token";
	
	СтруктураОтвета = ПолучитьШаблонСтруктурыОтвета();
	
	Запрос = Новый HTTPЗапрос(СтрокаЗапроса, ПараметрыЗапроса.Заголовки); 
	Запрос.УстановитьТелоИзСтроки(ПараметрыЗапроса.Параметры["<Тело>"], КодировкаТекста.UTF8, ИспользованиеByteOrderMark.НеИспользовать);
	
	Ответ = ПараметрыЗапроса.Соединение.ВызватьHTTPМетод("POST", Запрос);
	СтруктураОтвета = ОбработатьОтвет(Ответ, СтруктураОтвета);
	
	Возврат СтруктураОтвета;
	
КонецФункции

// /subscribers/{sender_gid}/contacts?{recipient_gids} 
&НаКлиенте
Функция API_ПолучитьСтатусРоумингаЭДО(Знач ПараметрыЗапроса) Экспорт
	
	СтрокаЗапроса = "/edm-roaming/public/api/v3/subscribers/<sender_gid>/contacts"; 
		
	СтрокаЗапроса = ЗаполнитьПараметрыВЗапросе(СтрокаЗапроса, ПараметрыЗапроса.Параметры);   
	
	Счетчик = 1;
	Для Каждого ПараметрЗапроса из ПараметрыЗапроса.Параметры Цикл
		Если НЕ ПараметрЗапроса.Значение = Неопределено И НЕ ПараметрЗапроса.Значение = Null И НЕ ПараметрЗапроса.Значение = "null" И НЕ ПараметрЗапроса.Значение = "Null" Тогда
			СтрокаЗапроса = СтрокаЗапроса + ?(Счетчик = 1, "?", ?(Счетчик = ПараметрыЗапроса.Количество(), "", "&")) + СтрЗаменить(СтрЗаменить(ПараметрЗапроса.Ключ, ">", ""), "<", "") + "=" +ПараметрЗапроса.Ключ;
		КонецЕсли;	
		Счетчик = Счетчик+1;
	КонецЦикла;
	
	СтрокаЗапроса = ЗаполнитьПараметрыВЗапросе(СтрокаЗапроса, ПараметрыЗапроса.Параметры); 
	
	ПараметрыЗапроса.Заголовки.Вставить("accept", "application/json");
	
	СтруктураОтвета = ПолучитьШаблонСтруктурыОтвета();
	
	Запрос = Новый HTTPЗапрос(СтрокаЗапроса, ПараметрыЗапроса.Заголовки); 
	
	Ответ = ПараметрыЗапроса.Соединение.ВызватьHTTPМетод("GET", Запрос);
	СтруктураОтвета = ОбработатьОтвет(Ответ, СтруктураОтвета);
	
	Возврат СтруктураОтвета;
	
КонецФункции

// /subscribers/{sender_gid}/invitations/{recipient_gid} 
&НаКлиенте
Функция API_ПолучитьСтатусПриглашенияКЭДО(Знач ПараметрыЗапроса) Экспорт
	
	СтрокаЗапроса = "/edm-subscriber/public/api/v3/subscribers/<sender_gid>/invitations/<recipient_gid>";
	СтрокаЗапроса = ЗаполнитьПараметрыВЗапросе(СтрокаЗапроса, ПараметрыЗапроса.Параметры);
	ПараметрыЗапроса.Заголовки.Вставить("accept", "application/json");
	
	СтруктураОтвета = ПолучитьШаблонСтруктурыОтвета();
	
	Запрос = Новый HTTPЗапрос(СтрокаЗапроса, ПараметрыЗапроса.Заголовки); 
	
	Ответ = ПараметрыЗапроса.Соединение.ВызватьHTTPМетод("GET", Запрос);;
	СтруктураОтвета = ОбработатьОтвет(Ответ, СтруктураОтвета);
	
	Возврат СтруктураОтвета;
	
КонецФункции

&НаКлиенте
Функция API_ОтправитьАбонентуПриглашениеКЭДО(Знач ПараметрыЗапроса) Экспорт
	
	СтрокаЗапроса = "/edm-subscriber/public/api/v3/subscribers/<sender_gid>/invitations/<recipient_gid>";
	СтрокаЗапроса = ЗаполнитьПараметрыВЗапросе(СтрокаЗапроса, ПараметрыЗапроса.Параметры);
	ПараметрыЗапроса.Заголовки.Вставить("accept", "application/json");
	
	СтруктураОтвета = ПолучитьШаблонСтруктурыОтвета();
	
	Запрос = Новый HTTPЗапрос(СтрокаЗапроса, ПараметрыЗапроса.Заголовки); 
	
	Ответ = ПараметрыЗапроса.Соединение.ВызватьHTTPМетод("PUT", Запрос);;
	СтруктураОтвета = ОбработатьОтвет(Ответ, СтруктураОтвета);
	
	Возврат СтруктураОтвета;
	
КонецФункции

#КонецОбласти

#Область Криптография

&НаКлиенте
Функция ПолучитьМенеджерКриптографии(ТипМенеджераКриптографии = 80, ВыводитьСообщенияОбОшибках = Истина) Экспорт 
	
	Попытка
		// Возврат Новый МенеджерКриптографии("", "", 75);      // Старый
		Возврат Новый МенеджерКриптографии("", "", ТипМенеджераКриптографии);  		// Новый
	Исключение
		Если ВыводитьСообщенияОбОшибках = Истина Тогда
			ТекстСообщения = "Не удалось получить доступ к модулю криптографии."+Символы.ПС+"Проверьте наличие и параметры/лицензию КриптоПро.";
			ВывестиСообщениеВОтдельнойФорме(ТекстСообщения);
		КонецЕсли;
		Возврат Неопределено;
	КонецПопытки	
	
КонецФункции

&НаКлиенте
Функция ПолучитьЭЦППоОтпечатку(Менеджер, Отпечаток, ВыводитьСообщенияОбОшибках = Истина) Экспорт
	
	Попытка
		Хранилище = Менеджер.ПолучитьХранилищеСертификатов(ТипХранилищаСертификатовКриптографии.ПерсональныеСертификаты);
		Сертификат = Хранилище.НайтиПоОтпечатку(Отпечаток);
		Если НЕ Сертификат = Неопределено Тогда
			Возврат Сертификат;
		Иначе
			Если ВыводитьСообщенияОбОшибках = Истина Тогда
				ТекстСообщения = "Не удалось получить доступ к сертификату электронной подписи."+Символы.ПС+"Проверьте наличие сертификата в порту USB/реестре операционной системы.";
				ВывестиСообщениеВОтдельнойФорме(ТекстСообщения);
			КонецЕсли;
			Возврат Неопределено;
		КонецЕсли;
	Исключение
		Если ВыводитьСообщенияОбОшибках = Истина Тогда
			ТекстСообщения = "Не удалось получить доступ к сертификату электронной подписи."+Символы.ПС+"Проверьте наличие сертификата в порту USB/реестре операционной системы.";
			ВывестиСообщениеВОтдельнойФорме(ТекстСообщения);
		КонецЕсли;
		Возврат Неопределено;
	КонецПопытки;  	
	
КонецФункции

&НаКлиенте
Функция ПолучитьТокенПоОтпечаткуСертификата(Отпечаток, ПарольДоступаКЗакрытомуКлючуСертификата = "") Экспорт
	
	СистемнаяИнформация = Новый СистемнаяИнформация;
	
	Менеджер = ПолучитьМенеджерКриптографии();
	Если Менеджер = Неопределено Тогда
		Возврат Неопределено;
	КонецЕсли;
	Менеджер.ПарольДоступаКЗакрытомуКлючу = ПарольДоступаКЗакрытомуКлючуСертификата;
	ЭЦП = ПолучитьЭЦППоОтпечатку(Менеджер, Отпечаток);
	Если ЭЦП = Неопределено Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	ПараметрыЗапроса = ПолучитьШаблонПараметровЗапроса(); 
		
	ЗаписьJSON = Новый ЗаписьJSON();
	
	ТекущаяДатаВUnixTime = Формат(УниверсальноеВремя(ТекущаяДата())- Дата(1970,1,1), "ЧГ=0"); 
	
	ЗаписьJSON.УстановитьСтроку();	    
	ЗаписьJSON.ЗаписатьНачалоОбъекта();
	ЗаписьJSON.ЗаписатьИмяСвойства("ts");
	ЗаписьJSON.ЗаписатьЗначение(ТекущаяДатаВUnixTime); 
	ЗаписьJSON.ЗаписатьИмяСвойства("nonce");
	ЗаписьJSON.ЗаписатьЗначение(Строка(Новый УникальныйИдентификатор()));  
	ЗаписьJSON.ЗаписатьКонецОбъекта();
	СтрокаJSON = ЗаписьJSON.Закрыть();
	
	Поток = Новый ПотокВПамяти;
	Текст = Новый ЗаписьТекста(Поток, КодировкаТекста.UTF8) ;
	Текст.Записать(СтрокаJSON);
	Текст.Закрыть();
	ДвоичныеДанные = Поток.ЗакрытьИПолучитьДвоичныеДанные();
	
	Отказ = Ложь;
	ОписаниеОшибки = "";
	Подпись = Менеджер.Подписать(ДвоичныеДанные, ЭЦП);
	РезультатПодписанияДвоичныеДанные = ПрисоединитьПодпись(Подпись, ДвоичныеДанные, Отказ, ОписаниеОшибки);
		
	ЭлектроннаяПодписьCMSBase64 = Base64Строка(РезультатПодписанияДвоичныеДанные);
	ЭлектроннаяПодписьCMSBase64 = СтрЗаменить(ЭлектроннаяПодписьCMSBase64, Символы.ПС, "");
	ЭлектроннаяПодписьCMSBase64 = СтрЗаменить(ЭлектроннаяПодписьCMSBase64, Символы.ВК, "");
	ЭлектроннаяПодписьCMSвDERвURL = КодироватьBase64СтрокуВСтрокуURLНаСервере(ЭлектроннаяПодписьCMSBase64);
	
	ПараметрыЗапроса.Параметры.Вставить("<Тело>", "grant_type=signature&signature="+ЭлектроннаяПодписьCMSвDERвURL);
	ПараметрыЗапроса.Параметры.Вставить("ИдентификаторКлиента", СистемнаяИнформация.ИдентификаторКлиента);
	
	РезультатЗапросаТокенаПоСертификату = API_ПолучитьТокенАвторизацииПоСертификату(ПараметрыЗапроса);
	
	Если НЕ РезультатЗапросаТокенаПоСертификату.Ошибка Тогда
		
		Возврат РезультатЗапросаТокенаПоСертификату.Результат.access_token;	
		
	Иначе
		
		Возврат Неопределено;
	
	КонецЕсли;
	
КонецФункции

&НаСервереБезКонтекста
Функция КодироватьBase64СтрокуВСтрокуURLНаСервере(ЭлектроннаяПодписьBase64)

	Возврат КодироватьСтроку(ЭлектроннаяПодписьBase64, СпособКодированияСтроки.КодировкаURL);
	
КонецФункции

#Область ПолучениеПрисоединеннойПодписи
// Менеджер криптографии в 1С не умеет делать присоединённые подписи.
// Выхода два: подписывать через COM-объект КриптоПро или воспользоваться сторонним решением.
// Стороннее решение: https://infostart.ru/public/1493281/, за авторством Сивина Алексея.

&НаКлиенте
Функция РазмерКонтейтера(Элемент)
	Результат = Элемент.Длина + 2;

	Если Элемент.Длина<=127 Тогда
		
	ИначеЕсли Элемент.Длина<=255 Тогда
		Результат = Результат + 1;
	ИначеЕсли Элемент.Длина<=65535 Тогда
		Результат = Результат + 2;
	ИначеЕсли Элемент.Длина<=16777215 Тогда
		Результат = Результат + 3;
	ИначеЕсли Элемент.Длина<=4294967295 Тогда
		Результат = Результат + 4;
	ИначеЕсли Элемент.Длина<=1099511627776 Тогда
		Результат = Результат + 5;
	КонецЕсли;

	Возврат Результат;
КонецФункции

&НаКлиенте
Процедура ЗаписатьЭлемент(Элемент,Поток,ТолькоЗаголовок);
	ВремБуфер = Новый БуферДвоичныхДанных(8);

	ВремБуфер[0] = Элемент.ПервыйБайт;
	Поток.Записать(ВремБуфер,0,1);
	
	Если Элемент.Длина<=127 Тогда
		ВремБуфер[0] = Элемент.Длина;
		Поток.Записать(ВремБуфер,0,1);
	Иначе
		Если Элемент.Длина<=255 Тогда
			К = 1;
		ИначеЕсли Элемент.Длина<=65535 Тогда
			К = 2;
		ИначеЕсли Элемент.Длина<=16777215 Тогда
			К = 3;
		ИначеЕсли Элемент.Длина<=4294967295 Тогда
			К = 4;
		ИначеЕсли Элемент.Длина<=1099511627776 Тогда
			К = 5;
		КонецЕсли;
		ВремБуфер[0] = К+128;
		Поток.Записать(ВремБуфер,0,1);

		ВремБуфер.ЗаписатьЦелое64(0,Элемент.Длина,ПорядокБайтов.BigEndian);
		Поток.Записать(ВремБуфер,8-К,К);		
	КонецЕсли;
	
	Если ТолькоЗаголовок<>Истина Тогда
		Поток.Записать(Элемент.Буфер,0,Элемент.Буфер.Размер);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Функция ПрочитатьЭлемент(Буфер,Позиция,Отказ,ОписаниеОшибки)
	
	Результат = Новый Структура;
	
	Если Позиция>=Буфер.Размер Тогда
		Отказ = Истина;
		ОписаниеОшибки = "Ошибка чтения подписи В0001";
		Возврат Неопределено;
	КонецЕсли;
	
	Результат.Вставить("ПервыйБайт",Буфер[Позиция]); Позиция = Позиция + 1;

	Длина = 0;
	Если Позиция>=Буфер.Размер Тогда
		Отказ = Истина;
		ОписаниеОшибки = "Ошибка чтения подписи В0002";
		Возврат Неопределено;
	КонецЕсли;

	Байт = Буфер[Позиция]; Позиция = Позиция + 1;

	Если Байт<=127 Тогда
		Длина = Байт;
	ИначеЕсли Байт=128 Тогда
		Отказ = Истина;
		ОписаниеОшибки = "Ошибка чтения подписи В0003";
		Возврат Неопределено;
	Иначе
		К = Байт-128;

		ВремБуфер = Новый БуферДвоичныхДанных(8);
		ВремБуфер.ЗаписатьЦелое64(0,0);

		М = Новый Массив;
		Для х=1 По К Цикл

			Если Позиция>=Буфер.Размер Тогда
				Отказ = Истина;
				ОписаниеОшибки = "Ошибка чтения подписи В0004";
				Возврат Неопределено;
			КонецЕсли;
			
			ВремБуфер[7-К+х] = Буфер[Позиция];
			Позиция = Позиция + 1;
		КонецЦикла;
		
		Длина = ВремБуфер.ПрочитатьЦелое64(0,ПорядокБайтов.BigEndian);
	КонецЕсли;
	
	Если (Позиция+Длина)>Буфер.Размер Тогда
		Отказ = Истина;
		ОписаниеОшибки = "Ошибка чтения подписи В0005";
		Возврат Неопределено;
	КонецЕсли;

	Результат.Вставить("Длина",Длина);
	Результат.Вставить("Буфер",Буфер.Прочитать(Позиция,Длина));
	Позиция = Позиция + Длина;
	
	Возврат Результат;
КонецФункции

&НаКлиенте
Функция ПрисоединитьПодпись(Подпись,ДвоичныеДанные,Отказ,ОписаниеОшибки) Экспорт

	//Разбираем
	ЧтениеДанных = Новый ЧтениеДанных(Подпись);
	Буфер = ЧтениеДанных.ПрочитатьВБуферДвоичныхДанных();
	
	ПозицияА = 0;
	А1 = ПрочитатьЭлемент(Буфер,ПозицияА,Отказ,ОписаниеОшибки);
	Если Отказ Тогда
		Возврат Неопределено;
	КонецЕсли;

	Если А1.ПервыйБайт<>48 Тогда //SEQUENCE
		Отказ = Истина;
		ОписаниеОшибки = "Ошибка чтения подписи А0001";
		Возврат Неопределено;
	КонецЕсли;
	
	Если ПозицияА<>Буфер.Размер Тогда
		Отказ = Истина;
		ОписаниеОшибки = "Ошибка чтения подписи А0002";
		Возврат Неопределено;
	КонецЕсли;
	
	ПозицияБ = 0;
	Б1 = ПрочитатьЭлемент(А1.Буфер,ПозицияБ,Отказ,ОписаниеОшибки);
	Если Отказ Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Если Б1.ПервыйБайт<>6 Тогда //OBJECT IDENTIFIER
		Отказ = Истина;
		ОписаниеОшибки = "Ошибка чтения подписи А0003";
		Возврат Неопределено;
	КонецЕсли;

	Если ПолучитьBase64СтрокуИзБуфераДвоичныхДанных(Б1.Буфер)<>"KoZIhvcNAQcC" Тогда //1.2.840.113549.1.7.2
		Отказ = Истина;
		ОписаниеОшибки = "Ошибка чтения подписи А0004";
		Возврат Неопределено;
	КонецЕсли;
	
	Б2 = ПрочитатьЭлемент(А1.Буфер,ПозицияБ,Отказ,ОписаниеОшибки);
	Если Отказ Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Если ПозицияБ<>А1.Буфер.Размер Тогда
		Отказ = Истина;
		ОписаниеОшибки = "Ошибка чтения подписи А0005";
		Возврат Неопределено;
	КонецЕсли;
	
	ПозицияВ = 0;
	В1 = ПрочитатьЭлемент(Б2.Буфер,ПозицияВ,Отказ,ОписаниеОшибки);
	Если Отказ Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Если В1.ПервыйБайт<>48 Тогда //SEQUENCE
		Отказ = Истина;
		ОписаниеОшибки = "Ошибка чтения подписи А0006";
		Возврат Неопределено;
	КонецЕсли;
	
	Если ПозицияВ<>Б2.Буфер.Размер Тогда
		Отказ = Истина;
		ОписаниеОшибки = "Ошибка чтения подписи А0007";
		Возврат Неопределено;
	КонецЕсли;
	
	ПозицияГ = 0;
	Г1 = ПрочитатьЭлемент(В1.Буфер,ПозицияГ,Отказ,ОписаниеОшибки);
	Если Отказ Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Если Г1.ПервыйБайт<>2 Тогда //INTEGER
		Отказ = Истина;
		ОписаниеОшибки = "Ошибка чтения подписи А0008";
		Возврат Неопределено;
	КонецЕсли;
	
	Г2 = ПрочитатьЭлемент(В1.Буфер,ПозицияГ,Отказ,ОписаниеОшибки);
	Если Отказ Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Если Г2.ПервыйБайт<>49 Тогда //SET
		Отказ = Истина;
		ОписаниеОшибки = "Ошибка чтения подписи А0009";
		Возврат Неопределено;
	КонецЕсли;
	
	Г3 = ПрочитатьЭлемент(В1.Буфер,ПозицияГ,Отказ,ОписаниеОшибки);
	Если Отказ Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Если Г3.ПервыйБайт<>48 Тогда //SEQUENCE
		Отказ = Истина;
		ОписаниеОшибки = "Ошибка чтения подписи А0010";
		Возврат Неопределено;
	КонецЕсли;
	
	ПозицияД = 0;
	Д1 = ПрочитатьЭлемент(Г3.Буфер,ПозицияД,Отказ,ОписаниеОшибки);
	Если Отказ Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Если Д1.ПервыйБайт<>6 Тогда //OBJECT IDENTIFIER
		Отказ = Истина;
		ОписаниеОшибки = "Ошибка чтения подписи А0011";
		Возврат Неопределено;
	КонецЕсли;

	Если ПолучитьBase64СтрокуИзБуфераДвоичныхДанных(Д1.Буфер)<>"KoZIhvcNAQcB" Тогда //1.2.840.113549.1.7.1
		Отказ = Истина;
		ОписаниеОшибки = "Ошибка чтения подписи А0012";
		Возврат Неопределено;
	КонецЕсли;
	
	Если ПозицияД<>Г3.Буфер.Размер Тогда
		Отказ = Истина;
		ОписаниеОшибки = "Ошибка чтения подписи А0013";
		Возврат Неопределено;
	КонецЕсли;

	Г4 = ПрочитатьЭлемент(В1.Буфер,ПозицияГ,Отказ,ОписаниеОшибки);
	Если Отказ Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Г5 = ПрочитатьЭлемент(В1.Буфер,ПозицияГ,Отказ,ОписаниеОшибки);
	Если Отказ Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Если ПозицияГ<>В1.Буфер.Размер Тогда
		Отказ = Истина;
		ОписаниеОшибки = "Ошибка чтения подписи А0014";
		Возврат Неопределено;
	КонецЕсли;
	
	//Собираем
	
	//Создаем новые элементы Д2 И Е1
	ЧТ = Новый ЧтениеДанных(ДвоичныеДанные);
	Е1 = Новый Структура;
	Е1.Вставить("ПервыйБайт",4);
	Е1.Вставить("Буфер", ЧТ.ПрочитатьВБуферДвоичныхДанных());	
	Е1.Вставить("Длина",Е1.Буфер.Размер);

	Д2 = Новый Структура;
	Д2.Вставить("ПервыйБайт",160);
	Д2.Вставить("Длина",РазмерКонтейтера(Е1));
	
	Г3.Длина = РазмерКонтейтера(Д1)+РазмерКонтейтера(Д2);
	В1.Длина = РазмерКонтейтера(Г1)+РазмерКонтейтера(Г2)+РазмерКонтейтера(Г3)+РазмерКонтейтера(Г4)+РазмерКонтейтера(Г5);
	Б2.Длина = РазмерКонтейтера(В1);
	А1.Длина = РазмерКонтейтера(Б1)+РазмерКонтейтера(Б2);
	
	Поток = Новый ПотокВПамяти();
	
	ЗаписатьЭлемент(А1,Поток,Истина);
	ЗаписатьЭлемент(Б1,Поток,Ложь);
	ЗаписатьЭлемент(Б2,Поток,Истина);
	ЗаписатьЭлемент(В1,Поток,Истина);
	ЗаписатьЭлемент(Г1,Поток,Ложь);
	ЗаписатьЭлемент(Г2,Поток,Ложь);
	ЗаписатьЭлемент(Г3,Поток,Истина);
	ЗаписатьЭлемент(Д1,Поток,Ложь);
	ЗаписатьЭлемент(Д2,Поток,Истина);
	ЗаписатьЭлемент(Е1,Поток,Ложь);
	ЗаписатьЭлемент(Г4,Поток,Ложь);
	ЗаписатьЭлемент(Г5,Поток,Ложь);

	Возврат Поток.ЗакрытьИПолучитьДвоичныеДанные();
КонецФункции

#КонецОбласти

#КонецОбласти

#Область Интеграция1С

&НаСервере
Функция ПолучитьИдентификаторЭДОИз1СПоСсылке(Ссылка) Экспорт
	
	СтруктураХранения1С = ПолучитьСтруктуруХранения1С();
	СвойствоИдентификатор = СтруктураХранения1С.СвойствоИдентификаторУчастника;
	
	Если СвойствоИдентификатор = Неопределено Тогда
		Сообщение = Новый СообщениеПользователю();
		Сообщение.Текст = "Не удалось определить дополнительное свойство для хранения идентификатора участника ЭДО. Отправка невозморжна.";
		Сообщение.Сообщить();
		Возврат Неопределено;
	КонецЕсли;
		
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
	|	ДополнительныеСведения.Значение КАК Идентификатор
	|ИЗ
	|	РегистрСведений."+СтруктураХранения1С.НаименованиеРегистра+ " КАК ДополнительныеСведения
	|ГДЕ
	|	ДополнительныеСведения.Свойство.Наименование = &НаименованиеСвойства
	|	И ДополнительныеСведения.Объект = &Ссылка";	
	Запрос.УстановитьПараметр("НаименованиеСвойства", СвойствоИдентификатор.Наименование);
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	Результат = Запрос.Выполнить();
	Если НЕ Результат.Пустой() Тогда
		Результат = Результат.Выбрать();
		Результат.Следующий();
		Возврат СокрЛП(Результат.Идентификатор);
	Иначе
		Возврат "";
	КонецЕсли;	
		
КонецФункции

&НаСервере
Процедура ОбновитьИдентификаторыУчастниковЭДОНаСервере()
	
	Адрес = ЭтаФорма.АдресВременногоХранилищаКэш;
	
	ИмяМетаданных = "Конфигурация";
	Кэш = ПолучитьИзВременногоХранилища(Адрес);    
	
	Если Кэш.НастройкиОбъект[Кэш.ПрефиксКонфигурации+ИмяМетаданных] = Неопределено Тогда				
		ИнициализацияКэш(Истина);
		Кэш = ПолучитьИзВременногоХранилища(Адрес);		
	КонецЕсли;
	
	Настройка = Кэш.НастройкиОбъект[Кэш.ПрефиксКонфигурации+ИмяМетаданных].ХранениеИнформации1С;
	
	СтрокаВызоваСвойство 	= 	Настройка.ОФД_ЭДО_ИдентификаторУчастникаЭДО.ТипОбъектаМетаданных + "." + 
	Настройка.ОФД_ЭДО_ИдентификаторУчастникаЭДО.Путь + ".НайтиПоНаименованию(" + Символ(034) + 
	Настройка.ОФД_ЭДО_ИдентификаторУчастникаЭДО.Наименование + Символ(034) + ")";
	
	СвойствоСсылка = Вычислить(СтрокаВызоваСвойство);
	Если ЗначениеЗаполнено(СвойствоСсылка) Тогда
		
		Для Каждого Строка из ТаблицаСопоставления Цикл
			
			// Если контрагент не найден в ЭДО, то оставляем идентификатор, созданный вручную
			Если НЕ ЗначениеЗаполнено(Строка.Контрагент) ИЛИ ТипЗнч(Строка.Контрагент) = Тип("Строка") Тогда  				
				Продолжить;				
			КонецЕсли;
			
			Если СокрЛП(Строка.Идентификатор) = СокрЛП(Строка.ТекущийИдентификатор) Тогда  				
				Продолжить;				
			КонецЕсли;
			
			РегистрСведений 	= РегистрыСведений[Настройка.Путь];
			МенеджерЗаписи 		= РегистрСведений.СоздатьМенеджерЗаписи();
			
			МенеджерЗаписи.Объект	= Строка.Контрагент;
			МенеджерЗаписи.Свойство	= СвойствоСсылка;
			МенеджерЗаписи.Прочитать();
			
			Если МенеджерЗаписи.Выбран() Тогда
				
				Если МенеджерЗаписи.Значение <> СокрЛП(Строка.Идентификатор) Тогда
					МенеджерЗаписи.Значение = СокрЛП(Строка.Идентификатор);				
					МенеджерЗаписи.Записать();
				КонецЕсли;
				
			Иначе
				
				МенеджерЗаписи.Объект	= Строка.Контрагент;
				МенеджерЗаписи.Свойство	= СвойствоСсылка;
				МенеджерЗаписи.Значение = СокрЛП(Строка.Идентификатор);				
				МенеджерЗаписи.Записать();
				
			КонецЕсли;
			
		КонецЦикла;
		
	Иначе 
		
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Возникла ошибка при обновлении идентификаторов контрагентов/организаций - не найдено свойство для хранения идентификаторов в 1С";
		Сообщение.Сообщить();
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область KeycloakВзаимодействие

&НаКлиенте
Функция RefreshTokens(RefreshToken)
	
	scope = "openid+groups+organization%3Aorg+upid+organization%3Aorg.write+profile+email";
	
	СтрокаПараметров = "grant_type=refresh_token&client_id=1c-sso&refresh_token="+RefreshToken+"&scope="+scope;
		
	headers = Новый Соответствие;
	headers.Вставить("Content-Type", "application/x-www-form-urlencoded");
	
	HTTPСоединение = Новый HTTPСоединение(""+ВедущийФрагментАдресаKeycloak+".platformaofd.ru", 443 ,,,, 15, Новый ЗащищенноеСоединениеOpenSSL);
	СтрокаЗапроса = "realms/"+realmФрагментАдресаKeycloak+"/protocol/openid-connect/token";
	
	Запрос = Новый HTTPЗапрос(СтрокаЗапроса, headers);
	
	Запрос.УстановитьТелоИзСтроки(СтрокаПараметров, КодировкаТекста.UTF8, ИспользованиеByteOrderMark.НеИспользовать);
	
	HTTPОтвет = HTTPСоединение.ОтправитьДляОбработки(Запрос);
	
	Если HTTPОтвет.КодСостояния = 200 Тогда
		Ответ = HTTPОтвет.ПолучитьТелоКакСтроку();
		Ответ = СтрЗаменить(Ответ, "not-before-policy", "not_before_policy");
		ЧтениеJSON = новый ЧтениеJSON();
		ЧтениеJSON.УстановитьСтроку(Ответ);
		Tokens = ПрочитатьJSON(ЧтениеJSON, Ложь);
		Возврат Tokens;
	 Иначе
		//Сообщить("Произошла ошибка обращения к серверу," + "Токен не получен" +
		//		Символы.ПС + "Статус ответа сервера: " + HTTPОтвет.КодСостояния);
		СообщениеТекст = "При попытке автоматически обновить токен авторизации произошла ошибка."++Символы.ПС+"Попробуйте заново ввести логин и пароль на форме авторизации.";
		ПолныйТехническийТекстОшибки = "Произошла ошибка обращения к серверу," + "Токен не получен" + Символы.ПС + "Статус ответа сервера: " + HTTPОтвет.КодСостояния;
		ВывестиСообщениеВОтдельнойФорме(СообщениеТекст, ПолныйТехническийТекстОшибки);
		Возврат Неопределено;
	КонецЕсли;
	
КонецФункции

#КонецОбласти