 
#Область СобытияФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ЗапрашиватьОтветныеПодписи = Истина;	
КонецПроцедуры

&НаКлиенте
Процедура ЗапрашиватьОтветныеПодписиПриИзменении(Элемент)
	
	Для каждого Строка из ФайлыНаОтправку цикл
		Строка.ЗапрашиватьОтветнуюПодпись = ЗапрашиватьОтветныеПодписи;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаФайлыНаОтправкуПриОкончанииРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования)
	
	УдалитьДублиПустыеЗначенияСтрок();
	
КонецПроцедуры

&НаКлиенте
Процедура ПолеПолучательПриИзменении(Элемент)
	
	ПолеПолучательПриИзмененииНаСервере();
	
	Элементы.ДекорацияОтправкаНевозможна.Видимость = НЕ ЗначениеЗаполнено(ИдентификаторПолучателяНеформализованногоОбъекта);
	
КонецПроцедуры

&НаСервере
Процедура ПолеПолучательПриИзмененииНаСервере()
	
	МодульОбработки = РеквизитФормыВЗначение("Объект");
	ИдентификаторПолучателяНеформализованногоОбъекта = МодульОбработки.ПолучитьИдентификаторЭДОИз1СПоСсылке(Получатель); 
	
КонецПроцедуры

&НаКлиенте
Процедура ФайлыНаОтправкуПутьКФайлуНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Диалог = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
	Диалог.Заголовок = "Выбор файла";
	Диалог.ИндексФильтра = 0;
	Диалог.ПредварительныйПросмотр = Ложь;
	Диалог.ПроверятьСуществованиеФайла = Истина;
	Диалог.МножественныйВыбор = Ложь; 
	
	Если Диалог.Выбрать() Тогда
		Для Каждого ВыбранныйФайл из Диалог.ВыбранныеФайлы Цикл
			НоваяСтрока = ФайлыНаОтправку.Добавить();
			НоваяСтрока.ПутьКФайлу = ВыбранныйФайл;
			НоваяСтрока.ВидДокумента = "Неформализованный";
		КонецЦикла;	
	КонецЕсли;
	
	УдалитьДублиПустыеЗначенияСтрок();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыФункции

&НаСервере
Процедура УдалитьДублиПустыеЗначенияСтрок()
	
	Таблица = ФайлыНаОтправку.Выгрузить();
	Таблица.Свернуть("ПутьКФайлу, Заголовок, Номер, Дата, ВидДокумента, ЗапрашиватьОтветнуюПодпись");
	
	Отбор = Новый Структура("ПутьКФайлу", "");
	МассивПустыхСтрок = Таблица.НайтиСтроки(Отбор);
	Для Каждого СтрокаМассива из МассивПустыхСтрок Цикл
	    Таблица.Удалить(СтрокаМассива);
	КонецЦикла;
	
	ФайлыНаОтправку.Загрузить(Таблица);
	
КонецПроцедуры

#КонецОбласти

#Область КнопкаДобавитьФайлы

&НаКлиенте
Процедура ВыбратьФайлы(Команда)
	
	Диалог = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
	Диалог.Заголовок = "Выбор файла";
	Диалог.ИндексФильтра = 0;
	Диалог.ПредварительныйПросмотр = Ложь;
	Диалог.ПроверятьСуществованиеФайла = Истина;
	Диалог.МножественныйВыбор = Истина; 
	
	Если Диалог.Выбрать() Тогда
		Для Каждого ВыбранныйФайл из Диалог.ВыбранныеФайлы Цикл
			НоваяСтрока = ФайлыНаОтправку.Добавить();
			НоваяСтрока.ПутьКФайлу = ВыбранныйФайл;
			НоваяСтрока.ВидДокумента = "Неформализованный";
			НоваяСтрока.ЗапрашиватьОтветнуюПодпись = ЗапрашиватьОтветныеПодписи;
		КонецЦикла;	
	КонецЕсли;
	
	УдалитьДублиПустыеЗначенияСтрок();
	
КонецПроцедуры

#КонецОбласти

#Область КнопкаПодтвердитьИЗакрыть

&НаКлиенте
Процедура ПодтвердитьИЗакрыть(Команда)
	
	Если НЕ ЗначениеЗаполнено(ИдентификаторПолучателяНеформализованногоОбъекта) Тогда
		Сообщить("Для отправки неформализованных документов требуется указать контрагента с заполненным идентификатором абонента ЭДО.");
		Возврат;
	КонецЕсли;	
	
	СтруктураОбработкиВыбора = Новый Структура;
	
	СтруктураОбработкиВыбора.Вставить("ПолучательНеформализованногоОбъекта", Получатель);
	СтруктураОбработкиВыбора.Вставить("ИдентификаторПолучателяНеформализованногоОбъекта", ИдентификаторПолучателяНеформализованногоОбъекта);
	
	МассивНеформализованныхДокументов = Новый Массив;
		
	Для Каждого Строка из ФайлыНаОтправку Цикл
		СтруктураНеформализованногоФайла = Новый Структура;
		СтруктураНеформализованногоФайла.Вставить("ПутьКФайлу", Строка.ПутьКФайлу);
		СтруктураНеформализованногоФайла.Вставить("Заголовок", Строка.Заголовок);
		СтруктураНеформализованногоФайла.Вставить("Номер", Строка.Номер);
		СтруктураНеформализованногоФайла.Вставить("Дата", Строка.Дата);
		СтруктураНеформализованногоФайла.Вставить("ВидДокумента", Строка.ВидДокумента);
		СтруктуранеформализованногоФайла.Вставить("ЗапрашиватьОтветнуюПодпись", Строка.ЗапрашиватьОтветнуюПодпись);
		МассивНеформализованныхДокументов.Добавить(СтруктураНеформализованногоФайла);
	КонецЦикла;	
	
	СтруктураОбработкиВыбора.Вставить("ВыбранныеДокументы", МассивНеформализованныхДокументов);
	
	ЭтаФорма.Закрыть(СтруктураОбработкиВыбора);
	
КонецПроцедуры	

#КонецОбласти