
#Область СлужебныеПроцедурыФункции

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	    
	Если Параметры.Свойство("ИспользоватьПодписание") Тогда
		ИспользоватьПодписание = Параметры.ИспользоватьПодписание;
	КонецЕсли;
	Если Параметры.Свойство("ВерсияНастроекОбработки") Тогда
		ВерсияНастроекОбработки = Параметры.ВерсияНастроекОбработки;
	КонецЕсли;
	Если Параметры.Свойство("АдресВременногоХранилищаКэш") Тогда
		АдресВременногоХранилищаКэш = Параметры.АдресВременногоХранилищаКэш;
	КонецЕсли;
	
	ОпределитьИспользованиеТестовогоКонтура();
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ВедущийФрагментАдресаKeycloak = ?(Объект.ЭтоТестоваяОбработка = Истина, "oauth-test", "oauth");
	realmФрагментАдресаKeycloak = ?(Объект.ЭтоТестоваяОбработка = Истина, "playground", "production");
	
    ЗаполнитьИнформациюПоАктивнымЛицензиям();
	
КонецПроцедуры

&НаСервере
Функция ПолучитьСтруктуруХранения1С() Экспорт
	
	ИмяМетаданных = "Конфигурация";
	Кэш = ПолучитьИзВременногоХранилища(АдресВременногоХранилищаКэш);    
	
	Если Кэш.НастройкиОбъект[Кэш.ПрефиксКонфигурации+ИмяМетаданных] = Неопределено Тогда				
		ИнициализацияКэш(Истина);
		Кэш = ПолучитьИзВременногоХранилища(АдресВременногоХранилищаКэш);		
	КонецЕсли;
	
	Настройка = Кэш.НастройкиОбъект[Кэш.ПрефиксКонфигурации+ИмяМетаданных].ХранениеИнформации1С;
	
	СтрокаВызоваСвойствоИдентификатор 			= Настройка.ОФД_ЭДО_ИдентификаторДокумента.ТипОбъектаМетаданных + "." + 
	Настройка.ОФД_ЭДО_ИдентификаторДокумента.Путь + ".НайтиПоНаименованию(" + Символ(034) + 
	Настройка.ОФД_ЭДО_ИдентификаторДокумента.Наименование + Символ(034) + ")";
	
	СтрокаВызоваСвойствоСтатус					= Настройка.ОФД_ЭДО_СтатусДокумента.ТипОбъектаМетаданных + "." + 
	Настройка.ОФД_ЭДО_СтатусДокумента.Путь + ".НайтиПоНаименованию(" + Символ(034) + 
	Настройка.ОФД_ЭДО_СтатусДокумента.Наименование + Символ(034) + ")";
	
	СтрокаВызоваСвойствоИдентификаторУчастника	= Настройка.ОФД_ЭДО_ИдентификаторУчастникаЭДО.ТипОбъектаМетаданных + "." + 
	Настройка.ОФД_ЭДО_ИдентификаторУчастникаЭДО.Путь + ".НайтиПоНаименованию(" + Символ(034) + 
	Настройка.ОФД_ЭДО_ИдентификаторУчастникаЭДО.Наименование + Символ(034) + ")";
	
	СвойствоИдентификатор 				= Вычислить(СтрокаВызоваСвойствоИдентификатор);									
	СвойствоСтатус						= Вычислить(СтрокаВызоваСвойствоСтатус);
	СвойствоИдентификаторУчастника		= Вычислить(СтрокаВызоваСвойствоИдентификаторУчастника);
	
	СтруктураХранения1С = Новый Структура;
	СтруктураХранения1С.Вставить("СвойствоИдентификатор",			СвойствоИдентификатор);
	СтруктураХранения1С.Вставить("СвойствоСтатус",					СвойствоСтатус);
	СтруктураХранения1С.Вставить("СвойствоИдентификаторУчастника",	СвойствоИдентификаторУчастника);
	СтруктураХранения1С.Вставить("НаименованиеРегистра",			Настройка.Путь);
	
	Возврат СтруктураХранения1С;
	
КонецФункции

&НаСервере
Процедура ИнициализацияКэш(Откат = Ложь)
	
	// Инициализируем Кэш 
	Кэш = ЗагрузитьКэш(Откат); 
	СохранитьКэш(Кэш);
	// Инициализируем Кэш 
	
КонецПроцедуры

// Функция загрузки Кэш
// Если значение реквизита формы "АдресВременногоХранилищаКэш" заполнено, то берем Кэш из временного хранилища (ШтатныйЗапуск())
&НаСервере
Функция ЗагрузитьКэш(Откат = Ложь)       
	
	Если ЗначениеЗаполнено(ЭтаФорма.АдресВременногоХранилищаКэш) и Не Откат Тогда
		
		Возврат ПолучитьИзВременногоХранилища(ЭтаФорма.АдресВременногоХранилищаКэш);
		
	Иначе
		
		МодульОбъектаОбработки = РеквизитФормыВЗначение("Объект");
		Кэш = МодульОбъектаОбработки.Инициализация(Откат);
		ЗначениеВРеквизитФормы(МодульОбъектаОбработки, "Объект"); 
		
		Возврат Кэш;
		
	КонецЕсли;
	
КонецФункции

// Функция сохранения Кэш в процессе работы
// В текущий Кэш записываем только требуемые для выгрузки настройки, остальные динамически подргружаем по мере необходимости
&НаСервере
Процедура СохранитьКэш(Кэш)
	
	// Удаляем предыдущее значение Кэш из временного хранилища
	Если ЗначениеЗаполнено(ЭтаФорма.АдресВременногоХранилищаКэш) Тогда
		//УдалитьИзВременногоХранилища(ЭтаФорма.АдресВременногоХранилищаКэш);
		Адрес = ЭтаФорма.АдресВременногоХранилищаКэш;
	Иначе
		Адрес = ЭтаФорма.УникальныйИдентификатор;
	КонецЕсли;
	
	// Записываем новое значение Кэш во временное хранилище
	ЭтаФорма.АдресВременногоХранилищаКэш = ПоместитьВоВременноеХранилище(Кэш, Адрес);	
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьИнтеграциюНаСервере(ВерсияНастроекОбработки) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	СписокЗначений = ХранилищеОбщихНастроек.ПолучитьСписок("ОФД_ЭДО_НастройкиОбработки", ПолучитьТекущегоПользователя());
	Интеграция = СписокЗначений.НайтиПоЗначению("Интеграция");
	
	// Информация об интеграции уже есть в хранилище значений 
	Если ТипЗнч(Интеграция) = Тип("ЭлементСпискаЗначений") Тогда
		
		Возврат ХранилищеОбщихНастроек.Загрузить("ОФД_ЭДО_НастройкиОбработки", 	// Ключ объекта
		"Интеграция",															// Ключ настройки 
		"Информация о способе интеграции обработки ОФД ЭДО.", 					// описание настройки
		ПолучитьТекущегоПользователя()); 										// Пользователь
		
	Иначе 
		// Это первый запуск, возвращаем пустую структуру
		Интеграция = Новый Структура;
		Интеграция.Вставить("СпособИнтеграции");
		Интеграция.Вставить("КаталогОбмена");
		Интеграция.Вставить("ИспользоватьКриптографию");
		Интеграция.Вставить("ПараметрыАвторизацииИПодписания", Новый Соответствие);
		Интеграция.Вставить("ВерсияНастроек", ВерсияНастроекОбработки);
		Интеграция.Вставить("МассоваяВыгрузка", Новый Структура);
		
		Возврат Интеграция;
		
	КонецЕсли; 	
	
	УстановитьПривилегированныйРежим(Ложь);
	
КонецФункции

// Функция сохраняет параметры интеграции в хранилище общих настроек
// Параметры интеграции хранятся относительно текущего пользователя
&НаСервереБезКонтекста
Процедура СохранитьИнтеграциюНаСервере(Интеграция) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	ХранилищеОбщихНастроек.Сохранить("ОФД_ЭДО_НастройкиОбработки",	// Ключ объекта
	"Интеграция",													// Ключ настройки 
	Интеграция,														// Настройка
	"Информация о способе интеграции обработки ОФД ЭДО.", 			// описание настройки
	ПолучитьТекущегоПользователя()); 								// Пользователь     
	
	УстановитьПривилегированныйРежим(Ложь);	
	
КонецПроцедуры

&НаКлиенте
Функция ПолучитьПараметрыАвторизацииИПодписания()
	
	Интеграция = ПолучитьИнтеграциюНаСервере(ВерсияНастроекОбработки);
	Если (Интеграция <> Неопределено) Тогда
		Если Интеграция.Свойство("ПараметрыАвторизацииИПодписания") Тогда
			Возврат Интеграция.ПараметрыАвторизацииИПодписания; 	
		КонецЕсли;	   			
	КонецЕсли; 	

	Возврат Неопределено;
	
КонецФункции

&НаКлиенте
Процедура СохранитьПараметрыАвторизацииИПодписанияОрганизации(Организация, AccessTokenОрганизации, RefreshTokenОрганизации, ИспользоватьПодписание, ОтпечатокСертификатаBase64Организации, ПарольДоступаКЗакрытомуКлючуОрганизации, ТипСубъектаОрганизации, МчдGUIDОрганизации, ДолжностьФизлицаОрганизации)

	ПараметрыАвторизацииИПодписанияОрганизации = Новый Структура;
	
	ПараметрыАвторизацииИПодписанияОрганизации.Вставить("AccessToken", AccessTokenОрганизации);
	ПараметрыАвторизацииИПодписанияОрганизации.Вставить("RefreshToken", RefreshTokenОрганизации);
	
	ПараметрыПодписания = Новый Структура;
	
	ПараметрыПодписания.Вставить("ИспользуетсяПодписание", ИспользоватьПодписание);
	ПараметрыПодписания.Вставить("ОтпечатокСертификатаBase64", ОтпечатокСертификатаBase64Организации);
	ПараметрыПодписания.Вставить("ПарольДоступаКЗакрытомуКлючу", ПарольДоступаКЗакрытомуКлючуОрганизации);
	Менеджер = ПолучитьМенеджерКриптографии();
	Сертификат  = ПолучитьЭЦППоОтпечатку(Менеджер, Base64Значение(ОтпечатокСертификатаBase64Организации));
	Если ТипЗнч(Сертификат) = Тип("СертификатКриптографии") Тогда 
		ПараметрыПодписания.Вставить("Субъект", Сертификат.Субъект);
	Иначе
		ПараметрыПодписания.Вставить("Субъект", Неопределено);
	КонецЕсли;
	ПараметрыПодписания.Вставить("ТипСубъекта", ТипСубъектаОрганизации);
	ПараметрыПодписания.Вставить("МчдGUID", МчдGUIDОрганизации);
	ПараметрыПодписания.Вставить("ДолжностьФизлица", ?(ЗначениеЗаполнено(ДолжностьФизлицаОрганизации), ДолжностьФизлицаОрганизации, Неопределено));
	
	ПараметрыАвторизацииИПодписанияОрганизации.Вставить("ПараметрыПодписания", ПараметрыПодписания);
	
	ОбновитьПараметрыАвторизацииИПодписанияОрганизации(Организация, ПараметрыАвторизацииИПодписанияОрганизации);	
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьПараметрыАвторизацииИПодписанияОрганизации(Организация, ПараметрыАвторизацииИПодписанияОрганизации)
	
	Интеграция = ПолучитьИнтеграциюНаСервере(ВерсияНастроекОбработки);
	
	Если НЕ Интеграция.Свойство("ПараметрыАвторизацииИПодписания") Тогда
		Интеграция.Вставить("ПараметрыАвторизацииИПодписания", Новый Соответствие);
	КонецЕсли;
		
	Интеграция.ПараметрыАвторизацииИПодписания.Вставить(Организация, ПараметрыАвторизацииИПодписанияОрганизации);	
	
	СохранитьИнтеграциюНаСервере(Интеграция);
	
КонецПроцедуры

&НаКлиенте
Функция СкопироватьКоллекцию(ВходящаяКоллекция)
	
	Если ТипЗнч(ВходящаяКоллекция) = Тип("Структура") Тогда
		НоваяКоллекция = Новый Структура;
	ИначеЕсли ТипЗнч(ВходящаяКоллекция) = Тип("Соответствие") Тогда
		НоваяКоллекция = Новый Соответствие;
	КонецЕсли;
	
	Для Каждого ЭлементКоллекции из ВходящаяКоллекция Цикл
		
		Если ТипЗнч(ЭлементКоллекции.Значение) = Тип("Структура") ИЛИ ТипЗнч(ЭлементКоллекции.Значение) = Тип("Соответствие") Тогда				
			Значение = СкопироватьКоллекцию(ЭлементКоллекции.Значение);			
			НоваяКоллекция.Вставить(ЭлементКоллекции.Ключ, Значение);	
		Иначе
			НоваяКоллекция.Вставить(ЭлементКоллекции.Ключ, ЭлементКоллекции.Значение);
		КонецЕсли;
		
    КонецЦикла;
	
	Возврат НоваяКоллекция;
	
КонецФункции

&НаСервереБезКонтекста
Функция ПолучитьТекущегоПользователя()
	
	Возврат Неопределено;
	
	Если НЕ Метаданные.ОбщиеМодули.Найти("ПользователиИнформационнойБазы") = Неопределено Тогда
		ТекущийПользователь = ПользователиИнформационнойБазы.ТекущийПользователь();
	Иначе
		ТекущийПользователь = ПользователиКлиентСервер.ТекущийПользователь();
	КонецЕсли;	
	
	Возврат ТекущийПользователь;
	
КонецФункции

&НаСервере
Процедура ОпределитьИспользованиеТестовогоКонтура()

	Объект.ЭтоТестоваяОбработка = ХранилищеОбщихНастроек.Загрузить("ОФД_ЭДО_НастройкиОбработки", 	// Ключ объекта
				"ЭтоТестовыйКонтур",																// Ключ настройки 
				"Служебный параметр, определяющий соединение с тестовым контуром", 					// описание настройки
				ПолучитьТекущегоПользователя());
				
				
	Если Объект.ЭтоТестоваяОбработка = Неопределено тогда
		
		Объект.ЭтоТестоваяОбработка = Ложь;
		
	КонецЕсли; 
		
КонецПроцедуры

#КонецОбласти

#Область ИнтеграцияAPI

&НаКлиенте
Функция ПолучитьЗаголовки(AccessToken = "")
	
	Заголовки = Новый Соответствие;
	//Заголовки.Вставить("accept", "application/json;charset=UTF-8");
	Заголовки.Вставить("accept", "*/*");
	Заголовки.Вставить("Authorization", "Bearer "+ AccessToken);
	
	Возврат Заголовки;
	
КонецФункции

&НаКлиенте
Функция ПолучитьСоединение_Устаревшее() // Удалить
	
	СертификатКлиентаWin 	= Новый СертификатКлиентаWindows(СпособВыбораСертификатаWindows.Выбирать);
	СертификатУЦWin 		= Неопределено; //Новый СертификатыУдостоверяющихЦентровWindows();
	
	ssl = Новый ЗащищенноеСоединениеOpenSSL(СертификатКлиентаWin, СертификатУЦWin); 		
	
	Если Объект.ЭтоТестоваяОбработка Тогда		
		// Тест
		Соединение  =  Новый HTTPСоединение("edo-v2.platformaofd.ru", //сервер
		443, 	//порт
		,		//логин
		,		//пароль
		,		//прокси
		20,		//таймаут
		ssl,);	//защищенное HTTPS соединение 			
	Иначе	
		// Бой
		Соединение  =  Новый HTTPСоединение("edo.platformaofd.ru", //сервер
		443,	//порт
		,		//логин
		,		//пароль
		,		//прокси
		20,		//таймаут
		ssl,);	//защищенное HTTPS соединение
	КонецЕсли;
	
	// Коля
	//Соединение  =  Новый HTTPСоединение("10.14.29.10", //сервер
	//8282,//порт
	//,	//логин
	//, //пароль
	//, //прокси
	//, //таймаут
	//,); //защищенное HTTPS соединение
	
	Возврат Соединение;
	
КонецФункции

&НаКлиенте
Функция ПолучитьСоединение()
	
	СертификатКлиентаWin 	= Новый СертификатКлиентаWindows(СпособВыбораСертификатаWindows.Выбирать);
	СертификатУЦWin 		= Неопределено; //Новый СертификатыУдостоверяющихЦентровWindows();
	
	ssl = Новый ЗащищенноеСоединениеOpenSSL(СертификатКлиентаWin, СертификатУЦWin); 		
	
	Если Объект.ЭтоТестоваяОбработка Тогда		
		// Тест
		Соединение  =  Новый HTTPСоединение("api-test.platformaofd.ru", //сервер
		443, 	//порт
		,		//логин
		,		//пароль
		,		//прокси
		20,		//таймаут
		ssl,);	//защищенное HTTPS соединение 			
	Иначе	
		// Бой
		Соединение  =  Новый HTTPСоединение("api.platformaofd.ru", //сервер
		443,	//порт
		,		//логин
		,		//пароль
		,		//прокси
		20,		//таймаут
		ssl,);	//защищенное HTTPS соединение
	КонецЕсли;
		
	Возврат Соединение;
	
КонецФункции

// Функция возвращает результат любой функции обращения к API. Обращение к функциям напрямую возможно.
// Основная особенность функции - автоматический релогин, если метод требует авторизацию и первый ответ на запрос вернул ошибку 401.
// Автоматический релогин возможен только в том случае, если пользователь зарегистрировал свой сертификат в ЛК ЭДО.
&НаКлиенте
Функция ВыполнитьЗапросAPI(ИмяФункцииЗапроса, ВходящиеПараметрыЗапроса, Организация = Неопределено, ПараметрыАвторизацииИПодписанияОрганизации = Неопределено) Экспорт
	
	РезультатЗапроса = ПолучитьШаблонСтруктурыОтвета();
	РезультатЗапроса.Ошибка = Истина;
	
	ПараметрыЗапроса = СкопироватьКоллекцию(ВходящиеПараметрыЗапроса);
	
	Выполнить("РезультатЗапроса = "+ИмяФункцииЗапроса+"(ПараметрыЗапроса);");
	
	Если РезультатЗапроса.КодСостояния = 401 ИЛИ РезультатЗапроса.КодСостояния = 500 Тогда
		
		// Ошибка авторизации.
		// Попытка обновить токен по сертификату.                                
		Если ПараметрыЗапроса.Свойство("Заголовки") И НЕ ПараметрыЗапроса.Заголовки.Получить("Authorization") = Неопределено Тогда
			Если НЕ ПараметрыАвторизацииИПодписанияОрганизации = Неопределено Тогда
				
				Если ПараметрыАвторизацииИПодписанияОрганизации.ИспользуетсяПодписание = Истина И НЕ ЗначениеЗаполнено(ПараметрыАвторизацииИПодписанияОрганизации.RefreshToken) Тогда 
					
					Если ПараметрыАвторизацииИПодписанияОрганизации.Свойство("ПараметрыПодписания") И ПараметрыАвторизацииИПодписанияОрганизации.ПараметрыПодписания.Свойство("ОтпечатокСертификатаBase64") Тогда
						ОтпечатокСертификатаBase64 = ПараметрыАвторизацииИПодписанияОрганизации.ПараметрыПодписания.ОтпечатокСертификатаBase64;
						Если ПараметрыАвторизацииИПодписанияОрганизации.ПараметрыПодписания.Свойство("ПарольДоступаКЗакрытомуКлючу") Тогда
							ПарольДоступаКЗакрытомуКлючу = ПараметрыАвторизацииИПодписанияОрганизации.ПараметрыПодписания.ПарольДоступаКЗакрытомуКлючу;	
						Иначе	
							ПарольДоступаКЗакрытомуКлючу = "";
						КонецЕсли;	
						НовыйТокен = ПолучитьТокенПоОтпечаткуСертификата(Base64Значение(ОтпечатокСертификатаBase64), ПарольДоступаКЗакрытомуКлючу);
						Если НЕ НовыйТокен = Неопределено Тогда
							ПараметрыЗапроса = СкопироватьКоллекцию(ВходящиеПараметрыЗапроса);
							ПараметрыЗапроса.Заголовки.Вставить("Authorization", "Bearer "+ НовыйТокен);
							Выполнить("РезультатЗапроса = "+ИмяФункцииЗапроса+"(ПараметрыЗапроса);");
							Если РезультатЗапроса.КодСостояния = 200 Тогда
								AccessToken = НовыйТокен;
								RefreshToken = "";
								СохранитьПараметрыАвторизацииИПодписанияОрганизации(Организация, AccessToken, RefreshToken,
									ПараметрыАвторизацииИПодписанияОрганизации.ИспользуетсяПодписание,
									ПараметрыАвторизацииИПодписанияОрганизации.ПараметрыПодписания.ОтпечатокСертификатаBase64, 
									ПараметрыАвторизацииИПодписанияОрганизации.ПараметрыПодписания.ПарольДоступаКЗакрытомуКлючу,
									ПараметрыАвторизацииИПодписанияОрганизации.ПараметрыПодписания.ТипСубъекта,
									ПараметрыАвторизацииИПодписанияОрганизации.ПараметрыПодписания.МчдGUID,
									ПараметрыАвторизацииИПодписанияОрганизации.ПараметрыПодписания.ДолжностьФизлица);
							КонецЕсли;
						КонецЕсли;
					КонецЕсли;
					
				ИначеЕсли ЗначениеЗаполнено(ПараметрыАвторизацииИПодписанияОрганизации.AccessToken) И ЗначениеЗаполнено(ПараметрыАвторизацииИПодписанияОрганизации.RefreshToken) Тогда
					
					FreshTokens = RefreshTokens(ПараметрыАвторизацииИПодписанияОрганизации.RefreshToken);
					Если НЕ FreshTokens = Неопределено Тогда
						НовыйAccessToken = FreshTokens.access_token;
						НовыйRefreshToken = FreshTokens.refresh_token;
						AccessToken = НовыйAccessToken;
						RefreshToken = НовыйRefreshToken;
						ПараметрыЗапроса = СкопироватьКоллекцию(ВходящиеПараметрыЗапроса);
						ПараметрыЗапроса.Заголовки.Вставить("Authorization", "Bearer "+ AccessToken);
						Выполнить("РезультатЗапроса = "+ИмяФункцииЗапроса+"(ПараметрыЗапроса);");
						Если РезультатЗапроса.КодСостояния = 200 Тогда	
							СохранитьПараметрыАвторизацииИПодписанияОрганизации(Организация, AccessToken, RefreshToken, 
								ПараметрыАвторизацииИПодписанияОрганизации.ИспользуетсяПодписание,
								ПараметрыАвторизацииИПодписанияОрганизации.ПараметрыПодписания.ОтпечатокСертификатаBase64, 
								ПараметрыАвторизацииИПодписанияОрганизации.ПараметрыПодписания.ПарольДоступаКЗакрытомуКлючу,
								ПараметрыАвторизацииИПодписанияОрганизации.ПараметрыПодписания.ТипСубъекта,
								ПараметрыАвторизацииИПодписанияОрганизации.ПараметрыПодписания.МчдGUID,
								ПараметрыАвторизацииИПодписанияОрганизации.ПараметрыПодписания.ДолжностьФизлица);
						КонецЕсли;	
					КонецЕсли;
					
				КонецЕсли;
				
			КонецЕсли;	
		КонецЕсли;
		
	КонецЕсли;	
	
	Возврат РезультатЗапроса;
	
КонецФункции 

&НаКлиенте
Функция ПолучитьШаблонПараметровЗапроса(AccessToken = "") Экспорт
	
	Структура = Новый Структура;
	
	Структура.Вставить("Соединение", 	ПолучитьСоединение());
	Структура.Вставить("Заголовки", 	ПолучитьЗаголовки(AccessToken));
	Структура.Вставить("Параметры", 	Новый Соответствие);
	
	Возврат Структура;
	
КонецФункции

&НаКлиенте
Функция ЗаполнитьПараметрыВЗапросе(СтрокаЗапроса, Параметры) Экспорт
	
	Для Каждого Параметр из Параметры Цикл
		
		СтрокаЗапроса = СтрЗаменить(СтрокаЗапроса, Параметр.Ключ, Параметр.Значение);
		
	КонецЦикла;	
	
	Возврат СтрокаЗапроса;
	
КонецФункции

&НаКлиенте
Функция ПолучитьШаблонСтруктурыОтвета()
	
	Структура = Новый Структура();
	
	Структура.Вставить("Результат", 	Неопределено);
	Структура.Вставить("Ошибка", 		Ложь);
	Структура.Вставить("Описание", 		""); 
	Структура.Вставить("КодСостояния",	"");
	
	Возврат Структура;
	
КонецФункции

&НаКлиенте
Функция ОбработатьОтвет(Ответ, СтруктураОтвета, ЭтоФайл = Ложь) Экспорт 
	
	СтруктураОтвета.КодСостояния = Ответ.КодСостояния;
	ОтветОбработан = Ложь;
	Тело = Ответ.ПолучитьТелоКакСтроку();	
	
	ТекущаяДата = Строка(ТекущаяДата());
	
	Если СтруктураОтвета.КодСостояния = 200 Тогда
		
		Если Тело = "[]" или Тело = "" Тогда
			СтруктураОтвета.Описание 		= ТекущаяДата + " Пустой ответ.";
		Иначе 
			Если НЕ ЭтоФайл Тогда
				ЧтениеJSON = Новый ЧтениеJSON();
				ЧтениеJSON.УстановитьСтроку(Тело);
				СтруктураОтвета.Результат = ПрочитатьJSON(ЧтениеJSON);			
				ЧтениеJSON.Закрыть(); 
			Иначе
				ДвоичныеДанныеФайла = Ответ.ПолучитьТелоКакДвоичныеДанные();
				СтруктураОтвета.Результат = ДвоичныеДанныеФайла;
				СтруктураОтвета.Вставить("Тип", Ответ.Заголовки.Получить("Content-Type"));
			КонецЕсли;	
		КонецЕсли;
		
		Возврат СтруктураОтвета;
		
	КонецЕсли;
	
	
	Если СтруктураОтвета.КодСостояния = 201 Тогда 
		
		Если Тело = "[]" Тогда
			СтруктураОтвета.Описание 		= ТекущаяДата + " Вроде норм, но че-то непонятно.";
			СтруктураОтвета.КодСостояния 	= 0;
		Иначе 
			ЧтениеJSON = Новый ЧтениеJSON();
			ЧтениеJSON.УстановитьСтроку(Тело);
			СтруктураОтвета.Результат = ПрочитатьJSON(ЧтениеJSON);			
			ЧтениеJSON.Закрыть();  
		КонецЕсли;
		
		Возврат СтруктураОтвета;	
		
	КонецЕсли;
	
	
	Если СтруктураОтвета.КодСостояния = 400 Тогда
		СтруктураОтвета.Ошибка 		= Истина;
		СтруктураОтвета.Описание 	= ТекущаяДата + " Error 400. Ошибка выгружаемых данных." + ?(ЗначениеЗаполнено(Тело), " ("+Тело+")", ""); 	
		Возврат СтруктураОтвета; 	
	КонецЕсли;
	
	Если СтруктураОтвета.КодСостояния = 401 Тогда
		СтруктураОтвета.Ошибка 		= Истина;
		СтруктураОтвета.Описание 	= ТекущаяДата + " Error 401. Ошибка авторизации. Проверье авторизацию в разделе настройки и повторите запрос позднее." + ?(ЗначениеЗаполнено(Тело), " ("+Тело+")", "");		
		Возврат СтруктураОтвета;	
	КонецЕсли;	
	
	Если СтруктураОтвета.КодСостояния = 403 Тогда
		СтруктураОтвета.Ошибка 		= Истина;
		СтруктураОтвета.Описание 	= ТекущаяДата +" Error 403." + ?(ЗначениеЗаполнено(Тело), " ("+Тело+")", "");	
		Возврат СтруктураОтвета; 
	КонецЕсли; 	
	
	Если СтруктураОтвета.КодСостояния = 404 Тогда
		СтруктураОтвета.Ошибка 		= Истина;
		СтруктураОтвета.Описание 	= ТекущаяДата +" Error 404." + ?(ЗначениеЗаполнено(Тело), " ("+Тело+")", "");		
		Возврат СтруктураОтвета;		
	КонецЕсли;
	
	Если СтруктураОтвета.КодСостояния = 500 Тогда
		СтруктураОтвета.Ошибка 		= Истина;
		СтруктураОтвета.Описание 	= ТекущаяДата +" Error 500. Сервис недоступен. Повторите запрос позднее." + ?(ЗначениеЗаполнено(Тело), " ("+Тело+")", ""); 		
		Возврат СтруктураОтвета; 		
	КонецЕсли;
	
	Если СтруктураОтвета.КодСостояния = 204 Тогда
		СтруктураОтвета.Ошибка 		= Ложь;
		СтруктураОтвета.Описание 	= ТекущаяДата +" Успешно."; 		
		Возврат СтруктураОтвета; 		
	КонецЕсли;
	
	СтруктураОтвета.Ошибка 		= Истина;
	СтруктураОтвета.Описание 	= ТекущаяДата + " Error " + СтруктураОтвета.КодСостояния + ". Неизвестная ошибка сервиса." + ?(ЗначениеЗаполнено(Тело), " ("+Тело+")", "");      			
	Возврат СтруктураОтвета;
	
КонецФункции

// licenses
&НаКлиенте
Функция API_ПолучитьИнформациюПоЛицензиям(Знач ПараметрыЗапроса) Экспорт
	
	СтрокаЗапроса = "/edm-billing/public/api/v3/licenses";
	
	Счетчик = 1;
	Для Каждого ПараметрЗапроса из ПараметрыЗапроса.Параметры Цикл
		СтрокаЗапроса = СтрокаЗапроса + ?(Счетчик = 1, "?", ?(Счетчик = ПараметрыЗапроса.Количество(), "", "&")) + СтрЗаменить(СтрЗаменить(ПараметрЗапроса.Ключ, ">", ""), "<", "") + "=" +ПараметрЗапроса.Ключ;
		Счетчик = Счетчик+1;
	КонецЦикла;	
	
	СтрокаЗапроса = ЗаполнитьПараметрыВЗапросе(СтрокаЗапроса, ПараметрыЗапроса.Параметры);
	
	СтруктураОтвета = ПолучитьШаблонСтруктурыОтвета();
	
	Запрос = Новый HTTPЗапрос(СтрокаЗапроса, ПараметрыЗапроса.Заголовки); 
	
	Ответ = ПараметрыЗапроса.Соединение.ВызватьHTTPМетод("GET", Запрос);
	СтруктураОтвета = ОбработатьОтвет(Ответ, СтруктураОтвета);
	
	Возврат СтруктураОтвета;
	
КонецФункции

// subscribers/le
&НаКлиенте
Функция API_ИнформацияОбУчастникеЭДО(Знач ПараметрыЗапроса) Экспорт
	
	СтрокаЗапроса = "/edm-subscriber/public/api/v3/subscribers";
	
	Счетчик = 1;
	Для Каждого ПараметрЗапроса из ПараметрыЗапроса.Параметры Цикл
		Если НЕ ПараметрЗапроса.Значение = Неопределено И НЕ ПараметрЗапроса.Значение = Null И НЕ ПараметрЗапроса.Значение = "null" И НЕ ПараметрЗапроса.Значение = "Null" Тогда
			СтрокаЗапроса = СтрокаЗапроса + ?(Счетчик = 1, "?", ?(Счетчик = ПараметрыЗапроса.Количество(), "", "&")) + СтрЗаменить(СтрЗаменить(ПараметрЗапроса.Ключ, ">", ""), "<", "") + "=" +ПараметрЗапроса.Ключ;
		КонецЕсли;	
		Счетчик = Счетчик+1;
	КонецЦикла;
	
	СтрокаЗапроса = ЗаполнитьПараметрыВЗапросе(СтрокаЗапроса, ПараметрыЗапроса.Параметры);
	
	СтруктураОтвета = ПолучитьШаблонСтруктурыОтвета();
	
	Запрос = Новый HTTPЗапрос(СтрокаЗапроса, ПараметрыЗапроса.Заголовки);    	
	
	Ответ = ПараметрыЗапроса.Соединение.Получить(Запрос);
	СтруктураОтвета = ОбработатьОтвет(Ответ, СтруктураОтвета);
	
	Возврат СтруктураОтвета;     
	
КонецФункции

// security/.../oauth/token
&НаКлиенте
Функция API_ПолучитьТокенАвторизацииПоСертификату(Знач ПараметрыЗапроса) Экспорт
	
	ЗаголовкиЗапроса = Новый Соответствие;
	ЗаголовкиЗапроса.Вставить("Content-Type", "application/x-www-form-urlencoded");
	ЗаголовкиЗапроса.Вставить("x-client-id", ПараметрыЗапроса.Параметры.Получить("ИдентификаторКлиента"));
	ЗаголовкиЗапроса.Вставить("Content-Encoding", "utf-8");
	ПараметрыЗапроса.Заголовки = ЗаголовкиЗапроса;
	
	СтрокаЗапроса = "/edm-security/public/api/v3/oauth/token";
	
	СтруктураОтвета = ПолучитьШаблонСтруктурыОтвета();
	
	Запрос = Новый HTTPЗапрос(СтрокаЗапроса, ПараметрыЗапроса.Заголовки); 
	Запрос.УстановитьТелоИзСтроки(ПараметрыЗапроса.Параметры["<Тело>"], КодировкаТекста.UTF8, ИспользованиеByteOrderMark.НеИспользовать);
	
	Ответ = ПараметрыЗапроса.Соединение.ВызватьHTTPМетод("POST", Запрос);
	СтруктураОтвета = ОбработатьОтвет(Ответ, СтруктураОтвета);
	
	Возврат СтруктураОтвета;
	
КонецФункции

#КонецОбласти

#Область РаботаСЛицензиями

&НаКлиенте
Процедура ЗаполнитьИнформациюПоАктивнымЛицензиям()
	
	СтруктураХранения1С = ПолучитьСтруктуруХранения1С();
	
	МассивОрганизаций = ПолучитьДоступныеОрганизации1С();	
	
	ЛицензийОбнаружено = 0;
	
	ПараметрыАвторизацииИПодписания = ПолучитьПараметрыАвторизацииИПодписания();
	
	Если ПараметрыАвторизацииИПодписания = Неопределено Тогда
		ОтобразитьИнформациюОЛицензии(Ложь);
		Возврат;
	КонецЕсли;	
	
	Для каждого Организация ИЗ МассивОрганизаций Цикл
		
		ИдентификаторОрганизации = ПолучитьИдентификаторУчастникаЭДО(Организация.Ссылка, СтруктураХранения1С);
		
		ПараметрыАвторизацииИПодписанияОрганизации = ПараметрыАвторизацииИПодписания.Получить(Организация.Ссылка);
		
		Если ИдентификаторОрганизации = Неопределено ИЛИ ПараметрыАвторизацииИПодписанияОрганизации = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		Если НЕ ПараметрыАвторизацииИПодписанияОрганизации.Свойство("AccessToken") Тогда
			Продолжить;
		КонецЕсли;
		
		AccessToken = ПараметрыАвторизацииИПодписанияОрганизации.AccessToken; 
		
		ПараметрыЗапроса = ПолучитьШаблонПараметровЗапроса(AccessToken);
		ПараметрыЗапроса.Параметры.Вставить("<subscriber-gid>", ИдентификаторОрганизации);
		ПараметрыЗапроса.Параметры.Вставить("<status>", "ACTIVE");
		
		РезультатЛицензии = ВыполнитьЗапросAPI("API_ПолучитьИнформациюПоЛицензиям", ПараметрыЗапроса, Организация.Ссылка, ПараметрыАвторизацииИПодписанияОрганизации);
		
		Если НЕ РезультатЛицензии.Ошибка И НЕ РезультатЛицензии.Результат = Неопределено Тогда 
			Для Каждого Элемент Из РезультатЛицензии.Результат Цикл
				
				ПараметрыЗапроса = ПолучитьШаблонПараметровЗапроса(AccessToken);
				ПараметрыЗапроса.Параметры.Вставить("<gid>", Элемент.subscriberGid);	
	
				ДанныеПоАбонентуЛицензии = ВыполнитьЗапросAPI("API_ИнформацияОбУчастникеЭДО", ПараметрыЗапроса, Организация.Ссылка, ПараметрыАвторизацииИПодписанияОрганизации); 
				
				Если ДанныеПоАбонентуЛицензии.Ошибка ИЛИ ДанныеПоАбонентуЛицензии.Результат = Неопределено Тогда
					Продолжить;
				КонецЕсли;
				
				ОтобразитьИнформациюОЛицензии(Элемент, ДанныеПоАбонентуЛицензии.Результат[0], ЛицензийОбнаружено);
				ЛицензийОбнаружено = ЛицензийОбнаружено + 1;
				
			КонецЦикла;			
		КонецЕсли;
	
	КонецЦикла;
	
	Если ЛицензийОбнаружено = 0 Тогда
		ОтобразитьИнформациюОЛицензии(Ложь);
	КонецЕсли;	
	
КонецПроцедуры	

&НаСервере
Процедура ОтобразитьИнформациюОЛицензии(Лицензия, Абонент = Неопределено, ПорядковыйНомерЛицензии = 0)
	
	Если Лицензия = Ложь Тогда
		
		//Если Элементы.Найти("ГруппаЛицензийНеОбнаружено") = Неопределено Тогда
			ГруппаЛицензийНеОбнаружено = Элементы.Добавить("ГруппаЛицензийНеОбнаружено", Тип("ГруппаФормы"));
			ГруппаЛицензийНеОбнаружено.Вид = ВидГруппыФормы.ОбычнаяГруппа;
			ГруппаЛицензийНеОбнаружено.Отображение = ОтображениеОбычнойГруппы.Нет;
			ГруппаЛицензийНеОбнаружено.ОтображатьЗаголовок = Ложь; 
			ГруппаЛицензийНеОбнаружено.Группировка = ГруппировкаПодчиненныхЭлементовФормы.Вертикальная;
			ГруппаЛицензийНеОбнаружено.Видимость = Истина;
			
			НадписьЛицензийНеОбнаружено = Элементы.Добавить("ЛицензийНеОбнаружено", Тип("ДекорацияФормы"), ГруппаЛицензийНеОбнаружено);
			НадписьЛицензийНеОбнаружено.Вид = ВидДекорацииФормы.Надпись;
			НадписьЛицензийНеОбнаружено.Заголовок = "Активных лицензий, соответствующих организациям и текущим параметрам авторизации в данной информационной базе не обнаружено.";
			ГруппаЛицензийНеОбнаружено.Видимость = Истина;
		//КонецЕсли;		
		
		Возврат;
		
	КонецЕсли;
		
	ГруппаЛицензииОрганизации = Элементы.Добавить("ГруппаЛицензия"+ПорядковыйНомерЛицензии, Тип("ГруппаФормы"));
	ГруппаЛицензииОрганизации.Вид = ВидГруппыФормы.ОбычнаяГруппа;
	ГруппаЛицензииОрганизации.Отображение = ОтображениеОбычнойГруппы.Нет;
	ГруппаЛицензииОрганизации.ОтображатьЗаголовок = Истина;
	ГруппаЛицензииОрганизации.Заголовок = Абонент.details.name;
	ГруппаЛицензииОрганизации.Группировка = ГруппировкаПодчиненныхЭлементовФормы.Вертикальная;
	ГруппаЛицензииОрганизации.Видимость = Истина;
		
	НадписьТарифОрганизации = Элементы.Добавить("Тариф"+ПорядковыйНомерЛицензии, Тип("ДекорацияФормы"), ГруппаЛицензииОрганизации); 
	НадписьТарифОрганизации.Вид = ВидДекорацииФормы.Надпись;
	НадписьТарифОрганизации.Заголовок = "Тариф: "+Лицензия.type.name;
	НадписьТарифОрганизации.Видимость = Истина;
	
	НадписьДатаАктивацииЛицензии = Элементы.Добавить("ДатаАктивации"+ПорядковыйНомерЛицензии, Тип("ДекорацияФормы"), ГруппаЛицензииОрганизации); 
	НадписьДатаАктивацииЛицензии.Вид = ВидДекорацииФормы.Надпись;
	НадписьДатаАктивацииЛицензии.Заголовок = "Активирована: "+ПрочитатьДатуJSON(Лицензия.activationInstant, ФорматДатыJSON.ISO);
	НадписьДатаАктивацииЛицензии.Видимость = Истина;
	
	НадписьДатаДеактивацииЛицензии = Элементы.Добавить("ДатаДеактивации"+ПорядковыйНомерЛицензии, Тип("ДекорацияФормы"), ГруппаЛицензииОрганизации); 
	НадписьДатаДеактивацииЛицензии.Вид = ВидДекорацииФормы.Надпись;
	НадписьДатаДеактивацииЛицензии.Заголовок = "Действует до: "+ПрочитатьДатуJSON(Лицензия.deactivationInstant, ФорматДатыJSON.ISO);
	НадписьДатаДеактивацииЛицензии.Видимость = Истина;

	НадписьКоличествоДокументов = Элементы.Добавить("КоличествоДокументов"+ПорядковыйНомерЛицензии, Тип("ДекорацияФормы"), ГруппаЛицензииОрганизации); 
	НадписьКоличествоДокументов.Вид = ВидДекорацииФормы.Надпись;
	НадписьКоличествоДокументов.Заголовок = "Документов в тарифе: "+Лицензия.type.documentLimit+Символы.ПС+"Осталось: "+Лицензия.documentBalance;
	НадписьКоличествоДокументов.Видимость = Истина;
	
	НадписьЛицензияЗаблокирована = Элементы.Добавить("ЛицензияЗаблокирована"+ПорядковыйНомерЛицензии, Тип("ДекорацияФормы"), ГруппаЛицензииОрганизации); 
	НадписьЛицензияЗаблокирована.Вид = ВидДекорацииФормы.Надпись;
	НадписьЛицензияЗаблокирована.Заголовок = "Заблокирована: "+?(Лицензия.blocked = Истина, "Да", "Нет");
	НадписьЛицензияЗаблокирована.Видимость = Истина;
	
КонецПроцедуры	

#КонецОбласти

#Область Криптография

&НаКлиенте
Функция ПолучитьМенеджерКриптографии(ТипМенеджераКриптографии = 80) Экспорт 
	
	// Возврат Новый МенеджерКриптографии("", "", 75);      // Старый
	Возврат Новый МенеджерКриптографии("", "", ТипМенеджераКриптографии);  		// Новый	
	
КонецФункции

&НаКлиенте
Функция ПолучитьЭЦППоОтпечатку(Менеджер, Отпечаток) Экспорт
	
	Хранилище = Менеджер.ПолучитьХранилищеСертификатов(ТипХранилищаСертификатовКриптографии.ПерсональныеСертификаты);			
	Возврат Хранилище.НайтиПоОтпечатку(Отпечаток);  	
	
КонецФункции

&НаКлиенте
Функция ПолучитьТокенПоОтпечаткуСертификата(Отпечаток, ПарольДоступаКЗакрытомуКлючуСертификата = "") Экспорт
	
	СистемнаяИнформация = Новый СистемнаяИнформация;
	
	Менеджер = ПолучитьМенеджерКриптографии();
	Менеджер.ПарольДоступаКЗакрытомуКлючу = ПарольДоступаКЗакрытомуКлючуСертификата;
	ЭЦП = ПолучитьЭЦППоОтпечатку(Менеджер, Отпечаток);
	
	ПараметрыЗапроса = ПолучитьШаблонПараметровЗапроса(); 
		
	ЗаписьJSON = Новый ЗаписьJSON();
	
	ТекущаяДатаВUnixTime = Формат(УниверсальноеВремя(ТекущаяДата())- Дата(1970,1,1), "ЧГ=0"); 
	
	ЗаписьJSON.УстановитьСтроку();	    
	ЗаписьJSON.ЗаписатьНачалоОбъекта();
	ЗаписьJSON.ЗаписатьИмяСвойства("ts");
	ЗаписьJSON.ЗаписатьЗначение(ТекущаяДатаВUnixTime); 
	ЗаписьJSON.ЗаписатьИмяСвойства("nonce");
	ЗаписьJSON.ЗаписатьЗначение(Строка(Новый УникальныйИдентификатор()));  
	ЗаписьJSON.ЗаписатьКонецОбъекта();
	СтрокаJSON = ЗаписьJSON.Закрыть();
	
	Поток = Новый ПотокВПамяти;
	Текст = Новый ЗаписьТекста(Поток, КодировкаТекста.UTF8) ;
	Текст.Записать(СтрокаJSON);
	Текст.Закрыть();
	ДвоичныеДанные = Поток.ЗакрытьИПолучитьДвоичныеДанные();
	
	Отказ = Ложь;
	ОписаниеОшибки = "";
	Подпись = Менеджер.Подписать(ДвоичныеДанные, ЭЦП);
	РезультатПодписанияДвоичныеДанные = ПрисоединитьПодпись(Подпись, ДвоичныеДанные, Отказ, ОписаниеОшибки);
		
	ЭлектроннаяПодписьCMSBase64 = Base64Строка(РезультатПодписанияДвоичныеДанные);
	ЭлектроннаяПодписьCMSBase64 = СтрЗаменить(ЭлектроннаяПодписьCMSBase64, Символы.ПС, "");
	ЭлектроннаяПодписьCMSBase64 = СтрЗаменить(ЭлектроннаяПодписьCMSBase64, Символы.ВК, "");
	ЭлектроннаяПодписьCMSвDERвURL = КодироватьBase64СтрокуВСтрокуURLНаСервере(ЭлектроннаяПодписьCMSBase64);
	
	ПараметрыЗапроса.Параметры.Вставить("<Тело>", "grant_type=signature&signature="+ЭлектроннаяПодписьCMSвDERвURL);
	ПараметрыЗапроса.Параметры.Вставить("ИдентификаторКлиента", СистемнаяИнформация.ИдентификаторКлиента);
	
	РезультатЗапросаТокенаПоСертификату = API_ПолучитьТокенАвторизацииПоСертификату(ПараметрыЗапроса);
	
	Если НЕ РезультатЗапросаТокенаПоСертификату.Ошибка Тогда
		
		Возврат РезультатЗапросаТокенаПоСертификату.Результат.access_token;	
		
	Иначе
		
		Возврат Неопределено;
	
	КонецЕсли;
	
КонецФункции

&НаСервереБезКонтекста
Функция КодироватьBase64СтрокуВСтрокуURLНаСервере(ЭлектроннаяПодписьBase64)

	Возврат КодироватьСтроку(ЭлектроннаяПодписьBase64, СпособКодированияСтроки.КодировкаURL);
	
КонецФункции

#Область ПолучениеПрисоединеннойПодписи
// Менеджер криптографии в 1С не умеет делать присоединённые подписи.
// Выхода два: подписывать через COM-объект КриптоПро или воспользоваться сторонним решением.
// Стороннее решение: https://infostart.ru/public/1493281/, за авторством Сивина Алексея.

&НаКлиенте
Функция РазмерКонтейтера(Элемент)
	Результат = Элемент.Длина + 2;

	Если Элемент.Длина<=127 Тогда
		
	ИначеЕсли Элемент.Длина<=255 Тогда
		Результат = Результат + 1;
	ИначеЕсли Элемент.Длина<=65535 Тогда
		Результат = Результат + 2;
	ИначеЕсли Элемент.Длина<=16777215 Тогда
		Результат = Результат + 3;
	ИначеЕсли Элемент.Длина<=4294967295 Тогда
		Результат = Результат + 4;
	ИначеЕсли Элемент.Длина<=1099511627776 Тогда
		Результат = Результат + 5;
	КонецЕсли;

	Возврат Результат;
КонецФункции

&НаКлиенте
Процедура ЗаписатьЭлемент(Элемент,Поток,ТолькоЗаголовок);
	ВремБуфер = Новый БуферДвоичныхДанных(8);

	ВремБуфер[0] = Элемент.ПервыйБайт;
	Поток.Записать(ВремБуфер,0,1);
	
	Если Элемент.Длина<=127 Тогда
		ВремБуфер[0] = Элемент.Длина;
		Поток.Записать(ВремБуфер,0,1);
	Иначе
		Если Элемент.Длина<=255 Тогда
			К = 1;
		ИначеЕсли Элемент.Длина<=65535 Тогда
			К = 2;
		ИначеЕсли Элемент.Длина<=16777215 Тогда
			К = 3;
		ИначеЕсли Элемент.Длина<=4294967295 Тогда
			К = 4;
		ИначеЕсли Элемент.Длина<=1099511627776 Тогда
			К = 5;
		КонецЕсли;
		ВремБуфер[0] = К+128;
		Поток.Записать(ВремБуфер,0,1);

		ВремБуфер.ЗаписатьЦелое64(0,Элемент.Длина,ПорядокБайтов.BigEndian);
		Поток.Записать(ВремБуфер,8-К,К);		
	КонецЕсли;
	
	Если ТолькоЗаголовок<>Истина Тогда
		Поток.Записать(Элемент.Буфер,0,Элемент.Буфер.Размер);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Функция ПрочитатьЭлемент(Буфер,Позиция,Отказ,ОписаниеОшибки)
	
	Результат = Новый Структура;
	
	Если Позиция>=Буфер.Размер Тогда
		Отказ = Истина;
		ОписаниеОшибки = "Ошибка чтения подписи В0001";
		Возврат Неопределено;
	КонецЕсли;
	
	Результат.Вставить("ПервыйБайт",Буфер[Позиция]); Позиция = Позиция + 1;

	Длина = 0;
	Если Позиция>=Буфер.Размер Тогда
		Отказ = Истина;
		ОписаниеОшибки = "Ошибка чтения подписи В0002";
		Возврат Неопределено;
	КонецЕсли;

	Байт = Буфер[Позиция]; Позиция = Позиция + 1;

	Если Байт<=127 Тогда
		Длина = Байт;
	ИначеЕсли Байт=128 Тогда
		Отказ = Истина;
		ОписаниеОшибки = "Ошибка чтения подписи В0003";
		Возврат Неопределено;
	Иначе
		К = Байт-128;

		ВремБуфер = Новый БуферДвоичныхДанных(8);
		ВремБуфер.ЗаписатьЦелое64(0,0);

		М = Новый Массив;
		Для х=1 По К Цикл

			Если Позиция>=Буфер.Размер Тогда
				Отказ = Истина;
				ОписаниеОшибки = "Ошибка чтения подписи В0004";
				Возврат Неопределено;
			КонецЕсли;
			
			ВремБуфер[7-К+х] = Буфер[Позиция];
			Позиция = Позиция + 1;
		КонецЦикла;
		
		Длина = ВремБуфер.ПрочитатьЦелое64(0,ПорядокБайтов.BigEndian);
	КонецЕсли;
	
	Если (Позиция+Длина)>Буфер.Размер Тогда
		Отказ = Истина;
		ОписаниеОшибки = "Ошибка чтения подписи В0005";
		Возврат Неопределено;
	КонецЕсли;

	Результат.Вставить("Длина",Длина);
	Результат.Вставить("Буфер",Буфер.Прочитать(Позиция,Длина));
	Позиция = Позиция + Длина;
	
	Возврат Результат;
КонецФункции

&НаКлиенте
Функция ПрисоединитьПодпись(Подпись,ДвоичныеДанные,Отказ,ОписаниеОшибки) Экспорт

	//Разбираем
	ЧтениеДанных = Новый ЧтениеДанных(Подпись);
	Буфер = ЧтениеДанных.ПрочитатьВБуферДвоичныхДанных();
	
	ПозицияА = 0;
	А1 = ПрочитатьЭлемент(Буфер,ПозицияА,Отказ,ОписаниеОшибки);
	Если Отказ Тогда
		Возврат Неопределено;
	КонецЕсли;

	Если А1.ПервыйБайт<>48 Тогда //SEQUENCE
		Отказ = Истина;
		ОписаниеОшибки = "Ошибка чтения подписи А0001";
		Возврат Неопределено;
	КонецЕсли;
	
	Если ПозицияА<>Буфер.Размер Тогда
		Отказ = Истина;
		ОписаниеОшибки = "Ошибка чтения подписи А0002";
		Возврат Неопределено;
	КонецЕсли;
	
	ПозицияБ = 0;
	Б1 = ПрочитатьЭлемент(А1.Буфер,ПозицияБ,Отказ,ОписаниеОшибки);
	Если Отказ Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Если Б1.ПервыйБайт<>6 Тогда //OBJECT IDENTIFIER
		Отказ = Истина;
		ОписаниеОшибки = "Ошибка чтения подписи А0003";
		Возврат Неопределено;
	КонецЕсли;

	Если ПолучитьBase64СтрокуИзБуфераДвоичныхДанных(Б1.Буфер)<>"KoZIhvcNAQcC" Тогда //1.2.840.113549.1.7.2
		Отказ = Истина;
		ОписаниеОшибки = "Ошибка чтения подписи А0004";
		Возврат Неопределено;
	КонецЕсли;
	
	Б2 = ПрочитатьЭлемент(А1.Буфер,ПозицияБ,Отказ,ОписаниеОшибки);
	Если Отказ Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Если ПозицияБ<>А1.Буфер.Размер Тогда
		Отказ = Истина;
		ОписаниеОшибки = "Ошибка чтения подписи А0005";
		Возврат Неопределено;
	КонецЕсли;
	
	ПозицияВ = 0;
	В1 = ПрочитатьЭлемент(Б2.Буфер,ПозицияВ,Отказ,ОписаниеОшибки);
	Если Отказ Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Если В1.ПервыйБайт<>48 Тогда //SEQUENCE
		Отказ = Истина;
		ОписаниеОшибки = "Ошибка чтения подписи А0006";
		Возврат Неопределено;
	КонецЕсли;
	
	Если ПозицияВ<>Б2.Буфер.Размер Тогда
		Отказ = Истина;
		ОписаниеОшибки = "Ошибка чтения подписи А0007";
		Возврат Неопределено;
	КонецЕсли;
	
	ПозицияГ = 0;
	Г1 = ПрочитатьЭлемент(В1.Буфер,ПозицияГ,Отказ,ОписаниеОшибки);
	Если Отказ Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Если Г1.ПервыйБайт<>2 Тогда //INTEGER
		Отказ = Истина;
		ОписаниеОшибки = "Ошибка чтения подписи А0008";
		Возврат Неопределено;
	КонецЕсли;
	
	Г2 = ПрочитатьЭлемент(В1.Буфер,ПозицияГ,Отказ,ОписаниеОшибки);
	Если Отказ Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Если Г2.ПервыйБайт<>49 Тогда //SET
		Отказ = Истина;
		ОписаниеОшибки = "Ошибка чтения подписи А0009";
		Возврат Неопределено;
	КонецЕсли;
	
	Г3 = ПрочитатьЭлемент(В1.Буфер,ПозицияГ,Отказ,ОписаниеОшибки);
	Если Отказ Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Если Г3.ПервыйБайт<>48 Тогда //SEQUENCE
		Отказ = Истина;
		ОписаниеОшибки = "Ошибка чтения подписи А0010";
		Возврат Неопределено;
	КонецЕсли;
	
	ПозицияД = 0;
	Д1 = ПрочитатьЭлемент(Г3.Буфер,ПозицияД,Отказ,ОписаниеОшибки);
	Если Отказ Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Если Д1.ПервыйБайт<>6 Тогда //OBJECT IDENTIFIER
		Отказ = Истина;
		ОписаниеОшибки = "Ошибка чтения подписи А0011";
		Возврат Неопределено;
	КонецЕсли;

	Если ПолучитьBase64СтрокуИзБуфераДвоичныхДанных(Д1.Буфер)<>"KoZIhvcNAQcB" Тогда //1.2.840.113549.1.7.1
		Отказ = Истина;
		ОписаниеОшибки = "Ошибка чтения подписи А0012";
		Возврат Неопределено;
	КонецЕсли;
	
	Если ПозицияД<>Г3.Буфер.Размер Тогда
		Отказ = Истина;
		ОписаниеОшибки = "Ошибка чтения подписи А0013";
		Возврат Неопределено;
	КонецЕсли;

	Г4 = ПрочитатьЭлемент(В1.Буфер,ПозицияГ,Отказ,ОписаниеОшибки);
	Если Отказ Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Г5 = ПрочитатьЭлемент(В1.Буфер,ПозицияГ,Отказ,ОписаниеОшибки);
	Если Отказ Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Если ПозицияГ<>В1.Буфер.Размер Тогда
		Отказ = Истина;
		ОписаниеОшибки = "Ошибка чтения подписи А0014";
		Возврат Неопределено;
	КонецЕсли;
	
	//Собираем
	
	//Создаем новые элементы Д2 И Е1
	ЧТ = Новый ЧтениеДанных(ДвоичныеДанные);
	Е1 = Новый Структура;
	Е1.Вставить("ПервыйБайт",4);
	Е1.Вставить("Буфер", ЧТ.ПрочитатьВБуферДвоичныхДанных());	
	Е1.Вставить("Длина",Е1.Буфер.Размер);

	Д2 = Новый Структура;
	Д2.Вставить("ПервыйБайт",160);
	Д2.Вставить("Длина",РазмерКонтейтера(Е1));
	
	Г3.Длина = РазмерКонтейтера(Д1)+РазмерКонтейтера(Д2);
	В1.Длина = РазмерКонтейтера(Г1)+РазмерКонтейтера(Г2)+РазмерКонтейтера(Г3)+РазмерКонтейтера(Г4)+РазмерКонтейтера(Г5);
	Б2.Длина = РазмерКонтейтера(В1);
	А1.Длина = РазмерКонтейтера(Б1)+РазмерКонтейтера(Б2);
	
	Поток = Новый ПотокВПамяти();
	
	ЗаписатьЭлемент(А1,Поток,Истина);
	ЗаписатьЭлемент(Б1,Поток,Ложь);
	ЗаписатьЭлемент(Б2,Поток,Истина);
	ЗаписатьЭлемент(В1,Поток,Истина);
	ЗаписатьЭлемент(Г1,Поток,Ложь);
	ЗаписатьЭлемент(Г2,Поток,Ложь);
	ЗаписатьЭлемент(Г3,Поток,Истина);
	ЗаписатьЭлемент(Д1,Поток,Ложь);
	ЗаписатьЭлемент(Д2,Поток,Истина);
	ЗаписатьЭлемент(Е1,Поток,Ложь);
	ЗаписатьЭлемент(Г4,Поток,Ложь);
	ЗаписатьЭлемент(Г5,Поток,Ложь);

	Возврат Поток.ЗакрытьИПолучитьДвоичныеДанные();
КонецФункции

#КонецОбласти

#КонецОбласти

#Область Интеграция1С

&НаСервере
Функция ПолучитьДоступныеОрганизации1С()
	
	ЗапросОрганизаций = Новый Запрос;
	ЗапросОрганизаций.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	                          |	Организации.Ссылка,
	                          |	Организации.ПометкаУдаления,
	                          |	Организации.Предопределенный,
	                          |	Организации.ИНН,
	                          |	Организации.КПП
	                          |ИЗ
	                          |	Справочник.Организации КАК Организации
	                          |ГДЕ
	                          |	Организации.ПометкаУдаления = ЛОЖЬ";
	
	Результат = ЗапросОрганизаций.Выполнить();
	
	Если НЕ Результат.Пустой() Тогда
		Результат = Результат.Выбрать();
		МассивОрганизаций = Новый Массив;
		Пока Результат.Следующий() Цикл
			ДанныеПоОрганизации = Новый Структура;
			ДанныеПоОрганизации.Вставить("Ссылка", Результат.Ссылка);
			ДанныеПоОрганизации.Вставить("ИНН", Результат.ИНН);
			ДанныеПоОрганизации.Вставить("КПП", Результат.КПП);
			МассивОрганизаций.Добавить(ДанныеПоОрганизации);	
		КонецЦикла;
		Возврат МассивОрганизаций; 
	Иначе	
		Возврат Неопределено;
	КонецЕсли;
	
КонецФункции

&НаСервере
Функция ПолучитьИдентификаторУчастникаЭДО(Участник, ХранениеИнформации1С) 
	
	МодульОбъекта = РеквизитФормыВЗначение("Объект");
	Возврат МодульОбъекта.ПолучитьИдентификаторЭДОПоСсылке(Участник, МодульОбъекта.ПолучитьОбъектНастройкиПоИмениМетаданных("Конфигурация", ПолучитьИзВременногоХранилища(АдресВременногоХранилищаКэш)).ХранениеИнформации1С, Ложь); 
	
КонецФункции

#КонецОбласти

#Область KeycloakВзаимодействие

&НаКлиенте
Функция RefreshTokens(RefreshToken)
	
	scope = "openid+groups+organization%3Aorg+upid+organization%3Aorg.write+profile+email";
	
	СтрокаПараметров = "grant_type=refresh_token&client_id=1c-sso&refresh_token="+RefreshToken+"&scope="+scope;
		
	headers = Новый Соответствие;
	headers.Вставить("Content-Type", "application/x-www-form-urlencoded");
	
	HTTPСоединение = Новый HTTPСоединение(""+ВедущийФрагментАдресаKeycloak+".platformaofd.ru", 443 ,,,, 15, Новый ЗащищенноеСоединениеOpenSSL);
	СтрокаЗапроса = "realms/"+realmФрагментАдресаKeycloak+"/protocol/openid-connect/token";
	
	Запрос = Новый HTTPЗапрос(СтрокаЗапроса, headers);
	
	Запрос.УстановитьТелоИзСтроки(СтрокаПараметров, КодировкаТекста.UTF8, ИспользованиеByteOrderMark.НеИспользовать);
	
	HTTPОтвет = HTTPСоединение.ОтправитьДляОбработки(Запрос);
	
	Если HTTPОтвет.КодСостояния = 200 Тогда
		Ответ = HTTPОтвет.ПолучитьТелоКакСтроку();
		Ответ = СтрЗаменить(Ответ, "not-before-policy", "not_before_policy");
		ЧтениеJSON = новый ЧтениеJSON();
		ЧтениеJSON.УстановитьСтроку(Ответ);
		Tokens = ПрочитатьJSON(ЧтениеJSON, Ложь);
		Возврат Tokens;
	 Иначе
		Сообщить("Произошла ошибка обращения к серверу," + "Токен не получен" +
				Символы.ПС + "Статус ответа сервера: " + HTTPОтвет.КодСостояния);
		Возврат Неопределено;
	КонецЕсли;
	
КонецФункции

#КонецОбласти
