
#Область СобытияФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("ВерсияНастроекОбработки") Тогда
		ВерсияНастроекОбработки = Параметры.ВерсияНастроекОбработки;
	КонецЕсли;
	Если Параметры.Свойство("ОтпечатокСертификатаBase64") Тогда
		ОтпечатокСертификатаBase64 = Параметры.ОтпечатокСертификатаBase64;
	КонецЕсли;
	Если Параметры.Свойство("ПарольДоступаКЗакрытомуКлючу") Тогда
		ПарольДоступаКЗакрытомуКлючу = Параметры.ПарольДоступаКЗакрытомуКлючу;
	КонецЕсли;
	Если Параметры.Свойство("АдресВременногоХранилищаКэш") Тогда
		АдресВременногоХранилищаКэш = Параметры.АдресВременногоХранилищаКэш;
	КонецЕсли;
	Если Параметры.Свойство("Организация") Тогда
		Организация = Параметры.Организация;
		ОтобразитьИдентификаторОрганизации();
	КонецЕсли;
	Если Параметры.Свойство("ИмяОбработки") Тогда
		ИмяОбработки = Параметры.ИмяОбработки;
	КонецЕсли;
	
	Если ИдентификаторОрганизацииВБД = "" Тогда
		Элементы.НадписьОрганизацияБезИдентификатора.Видимость = Истина;
	КонецЕсли;	
	
	Для Каждого ДокументМетаданные Из Метаданные.Документы Цикл
		Если ОбщегоНазначения.ЕстьРеквизитОбъекта("Организация", ДокументМетаданные) И ОбщегоНазначения.ЕстьРеквизитОбъекта("Контрагент", ДокументМетаданные) Тогда
			СписокТипов.Добавить(Тип("ДокументСсылка."+ДокументМетаданные.Имя));
		КонецЕсли;
	КонецЦикла;
	
	ЗапрашиватьОтветныеПодписи = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаНеформализованныхПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	
	Отказ = Истина;
	
КонецПроцедуры

#КонецОбласти 

#Область СобытияРеквизитовФормы

&НаКлиенте
Процедура ЗапрашиватьОтветныеПодписиПриИзменении(Элемент)

	Для Каждого Строка Из ТаблицаНеформализованных цикл
		Строка.ЗапрашиватьОтветнуюПодпись = ЗапрашиватьОтветныеПодписи;
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#Область КнопкаДополнитьСписок

&НаКлиенте
Процедура ДополнитьСписокПодборомДокументов(Команда)
	
	Оповещение = Новый ОписаниеОповещения("ОбработкаВыбораТипаДанных", ЭтотОбъект);
		
	СписокТипов.ПоказатьВыборЭлемента(Оповещение, "Выбор типа данных");
	
КонецПроцедуры

#КонецОбласти

#Область КнопкаТестФормированияПФ

&НаКлиенте
Процедура ТестФормированияПФ(Команда)
	
    ОписаниеПФ = Элементы.ТаблицаНеформализованных.ТекущиеДанные;
	
	МассивОбъектов = Новый Массив();
	МассивОбъектов.Добавить(ОписаниеПФ.Документ);
	
	ИмяМенеджераПечати				= ОписаниеПФ.ИмяМенеджераПечати;
	ИменаМакетов					= ?(ИмяМенеджераПечати = "СтандартныеПодсистемы.ДополнительныеОтчетыИОбработки", "ВнешняяПечатнаяФорма."+ОписаниеПФ.ИмяМакета, ОписаниеПФ.ИмяМакета);
	ИдентификаторОтправителя		= ПолучитьИдентификаторЭДОИз1СПоСсылке(Организация);
	ИдентификаторПолучателя			= ОписаниеПФ.ИдентификаторПолучателя;
	ПараметрыПечати					= ?(ЗначениеЗаполнено(ОписаниеПФ.ДополнительныеПараметры), ОписаниеПФ.ДополнительныеПараметры, Новый Структура());
	ФорматФайла						= ?(ЗначениеЗаполнено(ОписаниеПФ.ФорматФайла), ОписаниеПФ.ФорматФайла, "pdf");
	ТипФорматаФайла					= ТипФайлаТабличногоДокумента.PDF;
	ДопустимыеТипыОбъектовПечати	= Неопределено;
	ИмяФайла						= СтрЗаменить(ОписаниеПФ.Документ, ":", ".") + ИменаМакетов;
	
	ПараметрыПечати.Вставить("ДополнитьКомплектВнешнимиПечатнымиФормами", Истина);
	ТабличныйДокументРезультат = ВызовФормированияПечатныхФормБСП(ИмяМенеджераПечати, ИменаМакетов, МассивОбъектов, ПараметрыПечати, ДопустимыеТипыОбъектовПечати);
	
	Если ТабличныйДокументРезультат = Неопределено Тогда
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Печатная форма """+ОписаниеПФ.ПредставлениеПечатнойФормы+""" по документу """+ОписаниеПФ.Документ+""""
		+Символы.ПС+"для получателя """+ОписаниеПФ.Получатель+""" не была сформирована и отправлена."
		+Символы.ПС+"Не удалось сформировать табличный документ.";
		Сообщение.Сообщить();
		Возврат;
	КонецЕсли;  
	
	Если ТабличныйДокументРезультат.ВысотаТаблицы = 0 Тогда
		// Пустой табличный документ.
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Печатная форма """+ОписаниеПФ.ПредставлениеПечатнойФормы+""" по документу """+ОписаниеПФ.Документ+""""
		+Символы.ПС+"для получателя """+ОписаниеПФ.Получатель+""" не была сформирована и отправлена."
		+Символы.ПС+"Эта печатная форма к указанному документу не применяется.";
		Сообщение.Сообщить();
		Возврат;
	КонецЕсли;
	
	ТабличныйДокументРезультат.Показать();
	
КонецПроцедуры

&НаСервере
Функция ВызовФормированияПечатныхФормБСП(ИмяМенеджераПечати, ИменаМакетов, МассивОбъектов, ПараметрыПечати, ДопустимыеТипыОбъектовПечати)
	
	Попытка
		ПечатныеФормы = УправлениеПечатью.СформироватьПечатныеФормы(ИмяМенеджераПечати, ИменаМакетов, МассивОбъектов, ПараметрыПечати, ДопустимыеТипыОбъектовПечати);
		ТабличныйДокументРезультат = ПечатныеФормы.КоллекцияПечатныхФорм[0].ТабличныйДокумент;
		Возврат ТабличныйДокументРезультат;	
	Исключение
		Возврат Неопределено;
	КонецПопытки; 
	
КонецФункции

#КонецОбласти

#Область КнопкаНачатьОтправку

&НаКлиенте
Процедура НачатьОтправку(Команда)
	
	ЭтаФорма.Закрыть(ТаблицаНеформализованных);	
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыФункции

&НаСервере
Функция ПолучитьСтруктуруХранения1С() Экспорт
	
	ИмяМетаданных = "Конфигурация";
	Кэш = ПолучитьИзВременногоХранилища(АдресВременногоХранилищаКэш);    
	
	Если Кэш.НастройкиОбъект[Кэш.ПрефиксКонфигурации+ИмяМетаданных] = Неопределено Тогда				
		ИнициализацияКэш(Истина);
		Кэш = ПолучитьИзВременногоХранилища(АдресВременногоХранилищаКэш);		
	КонецЕсли;
	
	Настройка = Кэш.НастройкиОбъект[Кэш.ПрефиксКонфигурации+ИмяМетаданных].ХранениеИнформации1С;
	
	СтрокаВызоваСвойствоИдентификатор 			= Настройка.ОФД_ЭДО_ИдентификаторДокумента.ТипОбъектаМетаданных + "." + 
	Настройка.ОФД_ЭДО_ИдентификаторДокумента.Путь + ".НайтиПоНаименованию(" + Символ(034) + 
	Настройка.ОФД_ЭДО_ИдентификаторДокумента.Наименование + Символ(034) + ")";
	
	СтрокаВызоваСвойствоСтатус					= Настройка.ОФД_ЭДО_СтатусДокумента.ТипОбъектаМетаданных + "." + 
	Настройка.ОФД_ЭДО_СтатусДокумента.Путь + ".НайтиПоНаименованию(" + Символ(034) + 
	Настройка.ОФД_ЭДО_СтатусДокумента.Наименование + Символ(034) + ")";
	
	СтрокаВызоваСвойствоИдентификаторУчастника	= Настройка.ОФД_ЭДО_ИдентификаторУчастникаЭДО.ТипОбъектаМетаданных + "." + 
	Настройка.ОФД_ЭДО_ИдентификаторУчастникаЭДО.Путь + ".НайтиПоНаименованию(" + Символ(034) + 
	Настройка.ОФД_ЭДО_ИдентификаторУчастникаЭДО.Наименование + Символ(034) + ")";
	
	СвойствоИдентификатор 				= Вычислить(СтрокаВызоваСвойствоИдентификатор);									
	СвойствоСтатус						= Вычислить(СтрокаВызоваСвойствоСтатус);
	СвойствоИдентификаторУчастника		= Вычислить(СтрокаВызоваСвойствоИдентификаторУчастника);
	
	СтруктураХранения1С = Новый Структура;
	СтруктураХранения1С.Вставить("СвойствоИдентификатор",			СвойствоИдентификатор);
	СтруктураХранения1С.Вставить("СвойствоСтатус",					СвойствоСтатус);
	СтруктураХранения1С.Вставить("СвойствоИдентификаторУчастника",	СвойствоИдентификаторУчастника);
	СтруктураХранения1С.Вставить("НаименованиеРегистра",			Настройка.Путь);
	
	Возврат СтруктураХранения1С;
	
КонецФункции

&НаСервере
Процедура ИнициализацияКэш(Откат = Ложь)
	
	// Инициализируем Кэш 
	//МодульОбъектаОбработки = РеквизитФормыВЗначение("Объект");
	Кэш = ЗагрузитьКэш(Откат);
	//ЗначениеВРеквизитФормы(МодульОбъектаОбработки, "Объект"); 
	СохранитьКэш(Кэш);
	// Инициализируем Кэш 
	
КонецПроцедуры

// Функция загрузки Кэш
// Если значение реквизита формы "АдресВременногоХранилищаКэш" заполнено, то берем Кэш из временного хранилища (ШтатныйЗапуск())
&НаСервере
Функция ЗагрузитьКэш(Откат = Ложь)       
	
	Если ЗначениеЗаполнено(ЭтаФорма.АдресВременногоХранилищаКэш) и Не Откат Тогда
		
		Возврат ПолучитьИзВременногоХранилища(ЭтаФорма.АдресВременногоХранилищаКэш);
		
	Иначе
		
		МодульОбъектаОбработки = РеквизитФормыВЗначение("Объект");
		Кэш = МодульОбъектаОбработки.Инициализация(Откат);
		ЗначениеВРеквизитФормы(МодульОбъектаОбработки, "Объект"); 
		
		Возврат Кэш;
		
	КонецЕсли;
	
КонецФункции

// Функция сохранения Кэш в процессе работы
// В текущий Кэш записываем только требуемые для выгрузки настройки, остальные динамически подргружаем по мере необходимости
&НаСервере
Процедура СохранитьКэш(Кэш)
	
	// Удаляем предыдущее значение Кэш из временного хранилища
	Если ЗначениеЗаполнено(ЭтаФорма.АдресВременногоХранилищаКэш) Тогда
		//УдалитьИзВременногоХранилища(ЭтаФорма.АдресВременногоХранилищаКэш);
		Адрес = ЭтаФорма.АдресВременногоХранилищаКэш;
	Иначе
		Адрес = ЭтаФорма.УникальныйИдентификатор;
	КонецЕсли;
	
	// Записываем новое значение Кэш во временное хранилище
	ЭтаФорма.АдресВременногоХранилищаКэш = ПоместитьВоВременноеХранилище(Кэш, Адрес);	
	
КонецПроцедуры

&НаСервере
Процедура ОтобразитьИдентификаторОрганизации()
	
	// Отобразим текущий идентификатор в БД, при наличии.
	ИдентификаторОрганизацииВБД = ПолучитьИдентификаторЭДОИз1СПоСсылке(Организация);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВыбораТипаДанных(ВыбранныйЭлемент, СписокПараметров) Экспорт
	
	Если ВыбранныйЭлемент <> Неопределено Тогда
				
		ИмяОткрываемойФормы = "Документ."+ПолучитьИмяОбъектаМетаданных(ВыбранныйЭлемент.Значение)+".ФормаВыбора";	
		
		ПараметрыПодбора = Новый Структура;    
    	ПараметрыПодбора.Вставить("ЗакрыватьПриВыборе", Истина);
    	ПараметрыПодбора.Вставить("МножественныйВыбор", Истина);
		ПараметрыПодбора.Вставить("РежимВыбора", Истина);
		
		Оповещение = Новый ОписаниеОповещения("ОписаниеЗакрытияФормыВыбора", ЭтотОбъект);				
		ОткрытьФорму(ИмяОткрываемойФормы, ПараметрыПодбора, ЭтаФорма, , , , Оповещение);
				
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ПолучитьИмяОбъектаМетаданных(Тип)
	
	Возврат Метаданные.НайтиПоТипу(Тип).Имя;	
	
КонецФункции	

&НаКлиенте
Процедура ОписаниеЗакрытияФормыВыбора(РезультатЗакрытия, ДополнительныеПараметры) Экспорт
	
	Если НЕ РезультатЗакрытия = Неопределено Тогда
		
		Для Каждого ОбъектДляПФ из РезультатЗакрытия Цикл
			СписокОбъектовДляВыбораПФ.Добавить(ОбъектДляПФ);
		КонецЦикла;	
		
		ПараметрыОткрытияФормы = Новый Структура();
		ПараметрыОткрытияФормы.Вставить("ЭкземплярДокумента", РезультатЗакрытия[0]);
		ОповещениеОЗакрытии = Новый ОписаниеОповещения("ОписаниеЗакрытияФормыВыбораПФ", ЭтаФорма);
		ОткрытьФорму(ИмяОбработки + ".Форма.ФормаВыбораПФДляНеформалки", ПараметрыОткрытияФормы, ЭтаФорма, , , , ОповещениеОЗакрытии, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
			
	КонецЕсли;	
	
КонецПроцедуры

&НаКлиенте
Процедура ОписаниеЗакрытияФормыВыбораПФ(РезультатЗакрытия, ДополнительныеПараметры) Экспорт
		
	Если НЕ РезультатЗакрытия = Неопределено Тогда
		
		Для Каждого ОбъектПФ из СписокОбъектовДляВыбораПФ Цикл
			
			ДокументИсточникПечати	= ОбъектПФ.Значение;
			ПолучательПоДокументу	= ПолучитьКонтрагентаИзДокумента(ДокументИсточникПечати);
			ИдентификаторПолучателя	= ПолучитьИдентификаторЭДОИз1СПоСсылке(ПолучательПоДокументу);
			
			Для Каждого ПФ из РезультатЗакрытия Цикл
				
				Если ЗначениеЗаполнено(ПФ.Идентификатор) И ЗначениеЗаполнено(ПФ.МенеджерПечати) Тогда
					
					НоваяСтрока = ТаблицаНеформализованных.Добавить();
					
					НоваяСтрока.Документ					= ДокументИсточникПечати;
					НоваяСтрока.Получатель					= ПолучательПоДокументу;
					НоваяСтрока.ИдентификаторПолучателя		= ИдентификаторПолучателя;
					НоваяСтрока.ПредставлениеПечатнойФормы	= ПФ.Представление;
					НоваяСтрока.ФорматФайла					= ПФ.ФорматФайла;
					НоваяСтрока.ИмяМенеджераПечати			= ПФ.МенеджерПечати;
					НоваяСтрока.ИмяМакета					= ПФ.Идентификатор;
					НоваяСтрока.ДополнительныеПараметры		= ПФ.ДополнительныеПараметры;
					НоваяСтрока.ВидДокумента				= "Неформализованный";
					НоваяСтрока.ЗапрашиватьОтветнуюПодпись  = ЗапрашиватьОтветныеПодписи;
					
				КонецЕсли;
				
			КонецЦикла;	
			
		КонецЦикла;	
			
	КонецЕсли;
	
	СписокОбъектовДляВыбораПФ.Очистить();
	
КонецПроцедуры

&НаСервере
Функция ПолучитьКонтрагентаИзДокумента(Документ)
	
	Возврат Документ.Контрагент;
	
КонецФункции	

#КонецОбласти

#Область Интеграция1С

&НаСервере
Функция ПолучитьИдентификаторЭДОИз1СПоСсылке(Ссылка) Экспорт
	
	СтруктураХранения1С = ПолучитьСтруктуруХранения1С();
	СвойствоИдентификатор = СтруктураХранения1С.СвойствоИдентификаторУчастника;
	
	Если СвойствоИдентификатор = Неопределено Тогда
		Сообщение = Новый СообщениеПользователю();
		Сообщение.Текст = "Не удалось определить дополнительное свойство для хранения идентификатора участника ЭДО. Отправка невозморжна.";
		Сообщение.Сообщить();
		Возврат Неопределено;
	КонецЕсли;
		
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
	|	ДополнительныеСведения.Значение КАК Идентификатор
	|ИЗ
	|	РегистрСведений."+СтруктураХранения1С.НаименованиеРегистра+ " КАК ДополнительныеСведения
	|ГДЕ
	|	ДополнительныеСведения.Свойство.Наименование = &НаименованиеСвойства
	|	И ДополнительныеСведения.Объект = &Ссылка";	
	Запрос.УстановитьПараметр("НаименованиеСвойства", СвойствоИдентификатор.Наименование);
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	Результат = Запрос.Выполнить();
	Если НЕ Результат.Пустой() Тогда
		Результат = Результат.Выбрать();
		Результат.Следующий();
		Возврат Результат.Идентификатор;
	Иначе
		Возврат "";
	КонецЕсли;	
		
КонецФункции

#КонецОбласти
