//&НаКлиенте
//Перем ЭтоТестоваяОбработка;

#Область СлужебныеПроцедурыФункции

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("ИмяОбработки") Тогда
		ИмяОбработки = Параметры.ИмяОбработки;
	КонецЕсли;
	Если Параметры.Свойство("ПрефиксКонфигурации") Тогда
		ПрефиксКонфигурации = Параметры.ПрефиксКонфигурации;
	КонецЕсли;
	Если Параметры.Свойство("ВерсияНастроекОбработки") Тогда
		ВерсияНастроекОбработки = Параметры.ВерсияНастроекОбработки;
	КонецЕсли;
	Если Параметры.Свойство("АдресВременногоХранилищаКэш") Тогда
		АдресВременногоХранилищаКэш = Параметры.АдресВременногоХранилищаКэш;
	КонецЕсли;
	Если Параметры.Свойство("ПоказыватьНастройкиРазработчика") Тогда 
		ПоказыватьНастройкиРазработчика = Параметры.ПоказыватьНастройкиРазработчика;
	КонецЕсли;	
	
	Объект.ЭтоТестоваяОбработка = ХранилищеОбщихНастроек.Загрузить("ОФД_ЭДО_НастройкиОбработки", 	// Ключ объекта
				"ЭтоТестовыйКонтур",																// Ключ настройки 
				"Служебный параметр, определяющий соединение с тестовым контуром", 					// описание настройки
				ПолучитьТекущегоПользователя()); 
				
	Если Объект.ЭтоТестоваяОбработка = Неопределено тогда
		
		Объект.ЭтоТестоваяОбработка = Ложь;
		
	КонецЕсли; 
	
	ОпределитьВерсиюБЭД();
	
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)	
	
	ВедущийФрагментАдресаKeycloak = ?(Объект.ЭтоТестоваяОбработка = Истина, "oauth-test", "oauth");
	realmФрагментАдресаKeycloak = ?(Объект.ЭтоТестоваяОбработка = Истина, "playground", "production");
	
	ЗаполнитьТекущегоПользователя();
	
	Интеграция = ПолучитьИнтеграциюНаСервере(ВерсияНастроекОбработки);
	
	СпособИнтеграции = Интеграция.СпособИнтеграции;
	КаталогОбмена = Интеграция.КаталогОбмена;
	
	ИнтерактивноОбновлятьСтатусыДО = ?(Интеграция.Свойство("ИнтерактивноОбновлятьСтатусыДО"), Интеграция.ИнтерактивноОбновлятьСтатусыДО, Ложь);
	
	//Удалить++
	РаботаемПоУС = ?(Интеграция.Свойство("РаботаПоУС"), Интеграция.РаботаПоУС, Ложь);
	//Удалить--
	
	ОтобразитьОрганизацииИСертификатыПриОткрытии(Интеграция);
	
	//work in progress
	//ПоказыватьСлужебныеРеквизитыПриИзмененииНаСервере();
	
	Если СпособИнтеграции = 0 Тогда
		СпособИнтеграции = 1;
	КонецЕсли;
		
	Если НЕ Параметры.ЭтоМастерНастроек тогда
		
		ОтобразитьСправкуОМетодеРаботы();		
		ОбновитьВидимостьЭлементовФормы();
		
	Иначе
		
		НомерШагаМастера = 1;
		ОтобразитьМастерНастроек();
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьИнтеграциюНаСервере(ВерсияНастроекОбработки) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	СписокЗначений = ХранилищеОбщихНастроек.ПолучитьСписок("ОФД_ЭДО_НастройкиОбработки", ПолучитьТекущегоПользователя());
	Интеграция = СписокЗначений.НайтиПоЗначению("Интеграция");
	
	// Информация об интеграции уже есть в хранилище значений 
	Если ТипЗнч(Интеграция) = Тип("ЭлементСпискаЗначений") Тогда
		
		Возврат ХранилищеОбщихНастроек.Загрузить("ОФД_ЭДО_НастройкиОбработки", 	// Ключ объекта
		"Интеграция",															// Ключ настройки 
		"Информация о способе интеграции обработки ОФД ЭДО.", 					// описание настройки
		ПолучитьТекущегоПользователя()); 										// Пользователь
		
	Иначе 
		// Это первый запуск, возвращаем пустую структуру
		Интеграция = Новый Структура;
		Интеграция.Вставить("СпособИнтеграции", 1);
		Интеграция.Вставить("КаталогОбмена");
		Интеграция.Вставить("ИспользоватьКриптографию", Ложь);
		Интеграция.Вставить("ИнтерактивноОбновлятьСтатусыДО", Ложь);
		Интеграция.Вставить("ПараметрыАвторизацииИПодписания", Новый Соответствие);
		Интеграция.Вставить("ВерсияНастроек", ВерсияНастроекОбработки);
		Интеграция.Вставить("МассоваяВыгрузка", Новый Структура);
		// Удалить++
		Интеграция.Вставить("РаботаПоУС", Ложь);
		// Удалить--
		
		Возврат Интеграция;
		
	КонецЕсли; 	
	
	УстановитьПривилегированныйРежим(Ложь);
	
КонецФункции

// Функция сохраняет параметры интеграции в хранилище общих настроек
// Параметры интеграции хранятся относительно текущего пользователя
&НаСервереБезКонтекста
Процедура СохранитьИнтеграциюНаСервере(Интеграция) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	ХранилищеОбщихНастроек.Сохранить("ОФД_ЭДО_НастройкиОбработки", 	// Ключ объекта
	"Интеграция",											// Ключ настройки 
	Интеграция,												// Настройка
	"Информация о способе интеграции обработки ОФД ЭДО.", 	// описание настройки
	ПолучитьТекущегоПользователя()); 						// Пользователь     
	
	УстановитьПривилегированныйРежим(Ложь);	
	
КонецПроцедуры

// Диалог выбора каталога обмена
&НаКлиенте
Функция ВыбратьКаталог(СтароеЗначение)
	
	ДиалогОткрытия 				= Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.ВыборКаталога); 
	ДиалогОткрытия.Каталог		= СтароеЗначение;
	ДиалогОткрытия.Заголовок	= "Выберите каталог обмена"; 
	
	Если ДиалогОткрытия.Выбрать() Тогда 
		Возврат ДиалогОткрытия.Каталог + "\"; 
	КонецЕсли;
	
	Возврат	СтароеЗначение;
	
КонецФункции

&НаКлиенте
Процедура ОтобразитьСправкуОМетодеРаботы()
	
	Если СпособИнтеграции = 1 Тогда
		
		СправкаОМетодеРаботы = "При выборе метода работы ""Каталог"" формируемые эл. документы будут помещаться в указанный каталог обмена."
		+Символы.ПС+" - При выбранном сертификате организации, в случае наличия сертификата, данные о подписанте "
		+"документа и его должности будут взяты из данных сертификата."
		+Символы.ПС+" - При пустом значении сертификата, данные о подписанте и его должности будут "
		+"заполнены из данных о руководителе организации в 1С.";
		
	ИначеЕсли СпособИнтеграции = 2 Тогда
		
		СправкаОМетодеРаботы = "При выборе метода работы ""API"" формируемые эл. документы будут сразу загружаться в сервис ЭДО."
		+Символы.ПС+" - При установленном сертификате организации, документ будет загружен и отправлен получателю. "
		+"Данные о подписанте документа и его должности будут взяты из данных сертификата."
		+Символы.ПС+" - При пустом значении сертификата, документ будет загружен в сервис как черновик. "
		+"Данные о подписанте и его должности будут заполнены из данных о руководителе организации в 1С.";
		
	Иначе
		
		СправкаОМетодеРаботы = "";
		
	КонецЕсли;	
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьВидимостьЭлементовФормы()
	
	//Каталог
	Если СпособИнтеграции = 1 Тогда		
		ЭтаФорма.Элементы.КаталогОбмена.Видимость = Истина;	
		ЭтаФорма.Элементы.ИнтерактивноОбновлятьСтатусыДО.Видимость = Ложь;
		// Удалить++
		ЭтаФорма.Элементы.РаботаемПоУС.Видимость = Ложь;
		// Удалить--
		Счетчик = 1;	
		Пока НЕ Счетчик = ОбработаноОрганизаций Цикл		
			Элементы["AccessTokenОрганизации"+Счетчик].Видимость = Ложь;
			Счетчик = Счетчик+1;
		КонецЦикла;		
	КонецЕсли;	
	
	//API
	Если СпособИнтеграции = 2 Тогда	
		ЭтаФорма.Элементы.КаталогОбмена.Видимость = Ложь;
		ЭтаФорма.Элементы.ИнтерактивноОбновлятьСтатусыДО.Видимость = Истина;
		// Удалить++
		//ЭтаФорма.Элементы.РаботаемПоУС.Видимость = Истина;
		// Удалить--
		Счетчик = 1;	
		Пока НЕ Счетчик = ОбработаноОрганизаций Цикл		
			Элементы["AccessTokenОрганизации"+Счетчик].Видимость = Истина;
			Счетчик = Счетчик+1;
		КонецЦикла;	
	КонецЕсли;
	
	Счетчик = 1;	
	Пока НЕ Счетчик = ОбработаноОрганизаций Цикл
		Если ЭтаФорма["ПриРаботеСОрганизациейИспользуетсяПодписание"+Счетчик] = Истина Тогда
			Элементы["АвторизацияПоСертификату"+Счетчик].Доступность = Истина;
			Элементы["СертификатОрганизации"+Счетчик].Видимость = Истина;
			Элементы["ПарольДоступаКЗакрытомуКлючу"+Счетчик].Видимость = Истина;
			Элементы["GUIDДоверенности"+Счетчик].Видимость = Истина;
			Если СпособИнтеграции = 2 Тогда
				Элементы["АвторизацияПоСертификату"+Счетчик].Видимость = Истина;
				Если ЭтаФорма["АвторизацияПоСертификату"+Счетчик] = Истина Тогда
					Элементы["КнопкаПолучитьТокенАвторизацииПоПодписи"+Счетчик].Видимость = Истина;
					Элементы["КнопкаОткрытьФормуАвторизации"+Счетчик].Видимость = Ложь;
				Иначе
					Элементы["КнопкаПолучитьТокенАвторизацииПоПодписи"+Счетчик].Видимость = Ложь;
					Элементы["КнопкаОткрытьФормуАвторизации"+Счетчик].Видимость = Истина;
				КонецЕсли;	
			Иначе
				Элементы["АвторизацияПоСертификату"+Счетчик].Видимость = Ложь;
				Элементы["КнопкаПолучитьТокенАвторизацииПоПодписи"+Счетчик].Видимость = Ложь;
				Элементы["КнопкаОткрытьФормуАвторизации"+Счетчик].Видимость = Ложь;
			КонецЕсли;
		Иначе
			Элементы["СертификатОрганизации"+Счетчик].Видимость = Истина;
			Элементы["ПарольДоступаКЗакрытомуКлючу"+Счетчик].Видимость = Ложь;
			Элементы["GUIDДоверенности"+Счетчик].Видимость = Ложь;
			Элементы["КнопкаПолучитьТокенАвторизацииПоПодписи"+Счетчик].Видимость = Ложь;
			ЭтаФорма["АвторизацияПоСертификату"+Счетчик] = Ложь;
			Элементы["АвторизацияПоСертификату"+Счетчик].Доступность = Ложь;
			Если СпособИнтеграции = 2 Тогда
				Элементы["АвторизацияПоСертификату"+Счетчик].Видимость = Истина;
				Элементы["КнопкаОткрытьФормуАвторизации"+Счетчик].Видимость = Истина;
			Иначе
				Элементы["АвторизацияПоСертификату"+Счетчик].Видимость = Ложь;
				Элементы["КнопкаОткрытьФормуАвторизации"+Счетчик].Видимость = Ложь;
			КонецЕсли;	
		КонецЕсли;
		Счетчик = Счетчик+1;
	КонецЦикла;
	
	Элементы.НастройкиРазработчика.Видимость = ЭтотОбъект.ПоказыватьНастройкиРазработчика;

КонецПроцедуры

&НаКлиенте
Функция СкопироватьКоллекцию(ВходящаяКоллекция)
	
	Если ТипЗнч(ВходящаяКоллекция) = Тип("Структура") Тогда
		НоваяКоллекция = Новый Структура;
	ИначеЕсли ТипЗнч(ВходящаяКоллекция) = Тип("Соответствие") Тогда
		НоваяКоллекция = Новый Соответствие;
	КонецЕсли;
	
	Для Каждого ЭлементКоллекции из ВходящаяКоллекция Цикл
		
		Если ТипЗнч(ЭлементКоллекции.Значение) = Тип("Структура") ИЛИ ТипЗнч(ЭлементКоллекции.Значение) = Тип("Соответствие") Тогда				
			Значение = СкопироватьКоллекцию(ЭлементКоллекции.Значение);			
			НоваяКоллекция.Вставить(ЭлементКоллекции.Ключ, Значение);	
		Иначе
			НоваяКоллекция.Вставить(ЭлементКоллекции.Ключ, ЭлементКоллекции.Значение);
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат НоваяКоллекция;
	
КонецФункции

&НаСервере
Процедура СохранитьКлиентскиеНастройкиРаботыСДокументами(МассивНастроек)
	
	ПользовательВладелецНастроек = ПолучитьТекущегоПользователя();
	
	УстановитьПривилегированныйРежим(Истина);
	ХранилищеОбщихНастроек.Сохранить("ОФД_ЭДО_НастройкиОбработки", 												// Ключ объекта
	"КлиентскиеНастройки",																				// Ключ настройки 
	МассивНастроек,																						// Настройка
	"Клиентские настройки формирования исходящих эл. документов и загрузки входящих эл. документов.", 	// описание настройки
	ПользовательВладелецНастроек); 																		// Пользователь     
	
	УстановитьПривилегированныйРежим(Ложь);	
	
КонецПроцедуры	

&НаСервере
Процедура ОбновитьКэш()       
	
	Кэш = ЗагрузитьКэш(); 
	СохранитьКэш(Кэш); 
	
КонецПроцедуры

&НаСервере
Функция ЗагрузитьКэш()       
	
	МодульОбъектаОбработки = РеквизитФормыВЗначение("Объект");
	Кэш = МодульОбъектаОбработки.Инициализация(Ложь);
	
	Возврат Кэш; 
	
КонецФункции

&НаСервере
Процедура СохранитьКэш(Кэш)
	
	// Записываем новое значение Кэш во временное хранилище
	ПоместитьВоВременноеХранилище(Кэш, АдресВременногоХранилищаКэш);	
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьТекущегоПользователя()
	
	Возврат Неопределено;
	
	Если НЕ Метаданные.ОбщиеМодули.Найти("ПользователиИнформационнойБазы") = Неопределено Тогда
		ТекущийПользователь = ПользователиИнформационнойБазы.ТекущийПользователь();
	Иначе
		ТекущийПользователь = ПользователиКлиентСервер.ТекущийПользователь();
	КонецЕсли;	
	
	Возврат ТекущийПользователь;
	
КонецФункции

&НаСервере
Процедура ЗаполнитьТекущегоПользователя()
	
	Если НЕ Метаданные.ОбщиеМодули.Найти("ПользователиИнформационнойБазы") = Неопределено Тогда
		ТекущийПользователь = ПользователиИнформационнойБазы.ТекущийПользователь();
	Иначе
		ТекущийПользователь = ПользователиКлиентСервер.ТекущийПользователь();
	КонецЕсли;
	
КонецПроцедуры

Функция ПолучитьСтруктуруХранения1С(Кэш = Неопределено) Экспорт
	
	Если Кэш = Неопределено Тогда
		Кэш = ЗагрузитьКэш();	
	КонецЕсли;	
	
	ИмяМетаданных = "Конфигурация";    
	
	Настройка = Кэш.НастройкиОбъект[Кэш.ПрефиксКонфигурации+ИмяМетаданных].ХранениеИнформации1С;
	
	СтрокаВызоваСвойствоИдентификатор 			= Настройка.ОФД_ЭДО_ИдентификаторДокумента.ТипОбъектаМетаданных + "." + 
	Настройка.ОФД_ЭДО_ИдентификаторДокумента.Путь + ".НайтиПоНаименованию(" + Символ(034) + 
	Настройка.ОФД_ЭДО_ИдентификаторДокумента.Наименование + Символ(034) + ")";
	
	СтрокаВызоваСвойствоСтатус					= Настройка.ОФД_ЭДО_СтатусДокумента.ТипОбъектаМетаданных + "." + 
	Настройка.ОФД_ЭДО_СтатусДокумента.Путь + ".НайтиПоНаименованию(" + Символ(034) + 
	Настройка.ОФД_ЭДО_СтатусДокумента.Наименование + Символ(034) + ")";
	
	СтрокаВызоваСвойствоИдентификаторУчастника	= Настройка.ОФД_ЭДО_ИдентификаторУчастникаЭДО.ТипОбъектаМетаданных + "." + 
	Настройка.ОФД_ЭДО_ИдентификаторУчастникаЭДО.Путь + ".НайтиПоНаименованию(" + Символ(034) + 
	Настройка.ОФД_ЭДО_ИдентификаторУчастникаЭДО.Наименование + Символ(034) + ")";
	
	СвойствоИдентификатор 				= Вычислить(СтрокаВызоваСвойствоИдентификатор);									
	СвойствоСтатус						= Вычислить(СтрокаВызоваСвойствоСтатус);
	СвойствоИдентификаторУчастника		= Вычислить(СтрокаВызоваСвойствоИдентификаторУчастника);
	
	СтруктураХранения1С = Новый Структура;
	СтруктураХранения1С.Вставить("СвойствоИдентификатор",			СвойствоИдентификатор);
	СтруктураХранения1С.Вставить("СвойствоСтатус",					СвойствоСтатус);
	СтруктураХранения1С.Вставить("СвойствоИдентификаторУчастника",	СвойствоИдентификаторУчастника);
	СтруктураХранения1С.Вставить("НаименованиеРегистра",			Настройка.Путь);
	
	Возврат СтруктураХранения1С;
	
КонецФункции

Процедура ОпределитьВерсиюБЭД()

	ШаблонТекстВерсии = "Версия БЭД: %1";
	ТекстВерсии = СтрШаблон(ШаблонТекстВерсии, ОбновлениеИнформационнойБазыБЭД.ВерсияБиблиотеки());
	Элементы.ВерсияБЭД.Заголовок = ТекстВерсии;
	
КонецПроцедуры

#КонецОбласти

#Область СобытияЭлементовФормы

&НаКлиенте
Процедура СпособИнтеграцииПриИзменении(Элемент = Неопределено)
	
	// Получаем текущее значение интеграции
	Интеграция = ПолучитьИнтеграциюНаСервере(ВерсияНастроекОбработки);
	
	// Способ интеграции "Каталог"
	Если СпособИнтеграции = 1 Тогда
		Если СпособИнтеграции = 1 и Не ЗначениеЗаполнено(Интеграция.КаталогОбмена) Тогда
			КаталогОбмена = ВыбратьКаталог(КаталогОбмена);
		КонецЕсли;
		Интеграция.КаталогОбмена = КаталогОбмена;
		Интеграция.СпособИнтеграции = 1;  
		Если Не Интеграция.Свойство("ИнтерактивноОбновлятьСтатусыДО") Тогда 
			Интеграция.Вставить("ИнтерактивноОбновлятьСтатусыДО", Неопределено);
		КонецЕсли;
		Интеграция.ИнтерактивноОбновлятьСтатусыДО = Ложь;
		// Удалить++
		Если Не Интеграция.Свойство("РаботаПоУС") Тогда 
			Интеграция.Вставить("РаботаПоУС", Неопределено);
		КонецЕсли;
		Интеграция.РаботаПоУС = Ложь;
		// Удалить--
		
		// Сохраняем измененное значение интеграции
		СохранитьИнтеграциюНаСервере(Интеграция);	
	КонецЕсли;
	// Способ интеграции "Каталог"
	
	// Способ интеграции "API"
	Если СпособИнтеграции = 2 Тогда
		// Сохраняем измененное значение интеграции
		Интеграция.СпособИнтеграции = 2;
		СохранитьИнтеграциюНаСервере(Интеграция);
	КонецЕсли;
	// Способ интеграции "API"
	
	ОтобразитьСправкуОМетодеРаботы();
	
	ОбновитьВидимостьЭлементовФормы();
	
КонецПроцедуры

// Выбор каталога обмена
&НаКлиенте
Процедура КаталогОбменаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	// Диалог выбора
	КаталогОбмена	= ВыбратьКаталог(КаталогОбмена);
	// Сохраняем в настройки измененное значение
	КаталогОбменаПриИзменении(Элемент);
	
КонецПроцедуры

// При изменении каталога обмена (событие отрабатывает по нажатии клавиши Enter после изменения поля ввода)
// Сохраняет изменнное значение каталога в настройки
&НаКлиенте
Процедура КаталогОбменаПриИзменении(Элемент)
	
	Интеграция = ПолучитьИнтеграциюНаСервере(ВерсияНастроекОбработки);
	Интеграция.КаталогОбмена = КаталогОбмена;
	СохранитьИнтеграциюНаСервере(Интеграция);
	
КонецПроцедуры

&НаКлиенте
Процедура ИнтерактивноОбновлятьСтатусыДОПриИзменении(Элемент)
	
	Интеграция = ПолучитьИнтеграциюНаСервере(ВерсияНастроекОбработки);
	
	Если Не Интеграция.Свойство("ИнтерактивноОбновлятьСтатусыДО") Тогда 
		Интеграция.Вставить("ИнтерактивноОбновлятьСтатусыДО", Неопределено);
	КонецЕсли;
	
	Если ИнтерактивноОбновлятьСтатусыДО Тогда
		Интеграция.ИнтерактивноОбновлятьСтатусыДО = Истина;
	Иначе 
		Интеграция.ИнтерактивноОбновлятьСтатусыДО = Ложь;
	КонецЕсли;
	
	СохранитьИнтеграциюНаСервере(Интеграция);
	
КонецПроцедуры

// Удалить++
&НаКлиенте
Процедура РаботаПоУСПриИзменении(Элемент)
	
	Интеграция = ПолучитьИнтеграциюНаСервере(ВерсияНастроекОбработки);
	
	Если Не Интеграция.Свойство("РаботаПоУС") Тогда 
		Интеграция.Вставить("РаботаПоУС", Неопределено);
	КонецЕсли;
	
	Если РаботаемПоУС Тогда
		Интеграция.РаботаПоУС = Истина;
	Иначе 
		Интеграция.РаботаПоУС = Ложь;
	КонецЕсли;
	
	СохранитьИнтеграциюНаСервере(Интеграция);
	
КонецПроцедуры
// Удалить--

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	Если Параметры.ЭтоМастерНастроек И НомерШагаМастера = 1 И НЕ ЗначениеЗаполнено(КаталогОбмена) тогда
		Отказ = Истина;
		ОбщегоНазначенияКлиент.СообщитьПользователю("Необходимо заполнить каталог обмена");
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ПоказыватьСлужебныеРеквизитыПриИзмененииНаСервере()
	Организации = ПолучитьДоступныеОрганизации1С();
	
	Если Организации = Неопределено Тогда
		Возврат;	
	КонецЕсли;	
	
	ПорядковыйНомерГруппы = 1;
	
	Для Каждого Организация из Организации Цикл
		Элементы["AccessTokenОрганизации"+ПорядковыйНомерГруппы].Видимость = ПоказыватьСлужебныеРеквизиты;
		Элементы["RefreshTokenОрганизации"+ПорядковыйНомерГруппы].Видимость = ПоказыватьСлужебныеРеквизиты;
		
		ПорядковыйНомерГруппы = ПорядковыйНомерГруппы +1;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ПоказыватьСлужебныеРеквизитыПриИзменении(Элемент)
	ПоказыватьСлужебныеРеквизитыПриИзмененииНаСервере();
КонецПроцедуры

#КонецОбласти

#Область КнопкиАвторизации

&НаКлиенте
Процедура ОткрытьФормуАвторизации(Команда)
	
	ПорядковыйНомерГруппы = Число(Прав(Команда.Имя, СтрДлина(Команда.Имя) - СтрДлина("ОткрытьФормуАвторизации")));
	
	ПараметрыОткрытияФормы = Новый Структура;
	ПараметрыОткрытияФормы.Вставить("Организация", ЭтаФорма["Авторизация_Организация"+ПорядковыйНомерГруппы]);
	ПараметрыОткрытияФормы.Вставить("ПорядковыйНомерГруппы", ПорядковыйНомерГруппы);
	
	ОповещениеОЗакрытииФормыАвторизации = Новый ОписаниеОповещения("ПослеЗакрытияФормыАвторизации", ЭтотОбъект);
	ОткрытьФорму(ИмяОбработки + ".Форма.ФормаАвторизацииПользователя", ПараметрыОткрытияФормы, ЭтаФорма, , , , ОповещениеОЗакрытииФормыАвторизации, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);	
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗакрытияФормыАвторизации(Результат, ДопПараметры) Экспорт

	Если НЕ Результат = Неопределено Тогда
		
		Если Результат.АвторизацияУспешна = Истина Тогда
			
			ПорядковыйНомерГруппы = Результат.ПорядковыйНомерГруппы;
			
			ЭтаФорма["Авторизация_AccessTokenОрганизации"+ПорядковыйНомерГруппы] = Результат.AccessToken;
			ЭтаФорма["Авторизация_RefreshTokenОрганизации"+ПорядковыйНомерГруппы] = Результат.RefreshToken;
			
			ОбновитьПараметрыАвторизации(ПорядковыйНомерГруппы);
			
		КонецЕсли;	
		
	КонецЕсли;	
	
КонецПроцедуры

#КонецОбласти

#Область КнопкаПользовательскиеНастройкиВыгрузки

&НаКлиенте
Процедура КлиентскиеНастройки(Команда)
	
	ПараметрыОткрытияФормы = Новый Структура(); 
	ПараметрыОткрытияФормы.Вставить("ПрефиксКонфигурации", ПрефиксКонфигурации);
	
	Оповещение = Новый ОписаниеОповещения("ОбработкаЗакрытияФормыПользовательскихНастроекВыгрузки", ЭтотОбъект);
	
	ОткрытьФорму(ИмяОбработки + ".Форма.ФормаРаботыСКлиентскимиФайламиНастроек", ПараметрыОткрытияФормы, ЭтаФорма, , , , Оповещение, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаЗакрытияФормыПользовательскихНастроекВыгрузки(Результат, ДопПараметры) Экспорт
	
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	СохранитьКлиентскиеНастройкиРаботыСДокументами(Результат);
	
	// Необходимо обновить Кэш, чтобы настройки применились сразу, а не после перезапуска обработки.
	ОбновитьКэш();
	
КонецПроцедуры

#КонецОбласти

#Область КнопкаСкачатьАктуальнуюВерсиюОбработки

&НаКлиенте
Процедура СкачатьАктуальнуюВерсиюОбработки(Команда)
	
	ЗапуститьПриложение("https://platformaofd.ru/pdf/edo-files/ofd-edo.rar");
	
КонецПроцедуры

#КонецОбласти

#Область КнопкаОткрытьНастройкиСопоставленияКонтрагентов

&НаКлиенте
Процедура ОткрытьНастройкиСопоставленияКонтрагентов(Команда)
	ОткрытьФорму(ИмяОбработки + ".Форма.ФормаНастройкиПриоритетов",,, ЭтаФорма);	
КонецПроцедуры

#КонецОбласти

#Область МастерПервоначальнойНастройки

#Область ОтрисовкаЭлементовМастера

&НаКлиенте
Процедура ОтобразитьМастерНастроек()
	
	//Скрываем основные элементы для вывода мастера
	Этаформа.Элементы.ОсновнаяГруппа.Видимость = Ложь;
	ЭтаФорма.Элементы.МастерНастроек.Видимость = Истина; 
	ЭтаФорма.Элементы.ПараметрыАвторизацииИПодписания.Видимость = Ложь; 
	ЭтаФорма.Заголовок = "Мастер настройки";
	ЭтотОбъект.ПоказыватьСлужебныеРеквизиты = Истина;
	ОтобразитьСправкуОМетодеРаботы();
	ОтобразитьШагМастера();
	
КонецПроцедуры

&НаКлиенте
Процедура ОтобразитьШагМастера()
	
	Интеграция = ПолучитьИнтеграциюНаСервере(ВерсияНастроекОбработки);
	ДобавитьРеквизитыМастера();
	СпособИнтеграцииМастерПриИзменении(ЭтаФорма.Элементы.СпособИнтеграцииМастер);
	
	Если НомерШагаМастера = 1 тогда
		
		ТекстШагаМастера = "Произведите первоначальную настройку обработки." + Символы.ПС +  "Выберите способ интеграции:";
		Если СпособИнтеграции = 1 тогда
			ЭтаФорма.Элементы.КаталогОбменаМастер.Видимость = Истина; 
			ЭтаФорма.Элементы.МастерНастроекПродолжить.Заголовок = "Закончить";
		КонецЕсли; 
		
		ЭтаФорма.Элементы.ГруппаШаг2.Видимость = Ложь;
		ЭтаФорма.Элементы.МастерНастроекНазад.Видимость = Ложь; 
		ЭтаФорма.Элементы.ТекущийПользователь.Видимость = Ложь;
		
	КонецЕсли;
	
	Если НомерШагаМастера = 2 тогда
		
		//Скрываем предыдущий шаг
		ЭтаФорма.Элементы.ГруппаШаг1.Видимость = Ложь;
		ЭтаФорма.Элементы.СпособИнтеграцииМастер.Видимость = Ложь;
		ЭтаФорма.Элементы.ПолеСправкаОМетодеРаботыМастер.Видимость = Ложь;
		
		ЭтаФорма.Элементы.ГруппаШаг2.Видимость = Истина;
		ЭтаФорма.Элементы.ТекущийПользователь.Видимость = Истина;

		//To do: добавить возможность скрывать часть орагнизаций из списка
		Если СпособИнтеграции = 2 тогда  //API
			
			//ТекстШагаМастера = ПолучитьТекстВторогоШага();
			//ЭтаФорма.Элементы.ПолеТекстШага.АвтоМаксимальнаяВысота = Истина;
			//ЭтаФорма.Элементы.ПолеТекстШага.РастягиватьПоВертикали = Истина;
			ЭтаФорма.Элементы.ПолеТекстШага.Видимость = Ложь;
			ЭтаФорма.Элементы.ОписаниеШага2.Видимость = Истина;
			
		ИначеЕсли СпособИнтеграции = 1 тогда //Каталога
			
			ЭтаФорма.Элементы.КаталогОбменаМастер.Видимость = Истина;
			ЭтаФорма.Элементы.ПараметрыАвторизацииИПодписания.Видимость = Ложь;
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ДобавитьРеквизитыМастера()
	
	Если НомерШагаМастера = 1 тогда 
		
		ЭтаФорма.Элементы.МастерНастроекПродолжить.Заголовок = "Следующий шаг";
		СпособИнтеграции = 2; 
		
	ИначеЕсли НомерШагаМастера = 2 тогда 
		
		ЭтаФорма.Элементы.Переместить(ЭтаФорма.Элементы.ПараметрыАвторизацииИПодписания, ЭтаФорма.Элементы.ГруппаШаг2);
		ЭтаФорма.Элементы.Переместить(ЭтаФорма.Элементы.ПолеТекстШага, ЭтаФорма.Элементы.ПараметрыАвторизацииИПодписания, ЭтаФорма.Элементы.ГруппаОрганизация1ДанныеЭДО);
		ЭтаФорма.Элементы.ПараметрыАвторизацииИПодписания.Видимость = Истина;
		ЭтаФорма.Элементы.МастерНастроекПродолжить.Заголовок = "Закончить"; 
		
	КонецЕсли
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандМастера

&НаКлиенте
Процедура МастерНастроекПродолжить(Команда)
	
	Если НомерШагаМастера = 1 и НЕ СпособИнтеграции = 1 тогда
		НомерШагаМастера = НомерШагаМастера + 1;
		ОтобразитьШагМастера();
	ИначеЕсли НомерШагаМастера = 1 И СпособИнтеграции = 1 тогда 
		//СохранитьИнтеграциюНаСервере(Интеграция);
		ЭтаФорма.Закрыть(); 
	ИначеЕсли НомерШагаМастера = 2 тогда
		ЭтаФорма.Закрыть();
	КонецЕсли
	
КонецПроцедуры

&НаКлиенте
Процедура МастерНастроекНазад(Команда)
	
	Если НЕ НомерШагаМастера = 1 тогда
		НомерШагаМастера = НомерШагаМастера - 1;
		ОтобразитьШагМастера();
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовМастера

&НаКлиенте
Процедура СпособИнтеграцииМастерПриИзменении(Элемент)  
	
	Интеграция = ПолучитьИнтеграциюНаСервере(ВерсияНастроекОбработки);
	ОтобразитьСправкуОМетодеРаботы();
	
	Если СпособИнтеграции = 1 тогда
		ЭтаФорма.Элементы.КаталогОбменаМастер.Видимость = Истина;
		ЭтаФорма.Элементы.МастерНастроекПродолжить.Заголовок = "Закончить";
		Если СпособИнтеграции = 1 и Не ЗначениеЗаполнено(Интеграция.КаталогОбмена) Тогда
			КаталогОбмена = ВыбратьКаталог(КаталогОбмена);
		КонецЕсли;
		Интеграция.КаталогОбмена = КаталогОбмена;
		Интеграция.СпособИнтеграции = 1;
		СохранитьИнтеграциюНаСервере(Интеграция);
	ИначеЕсли СпособИнтеграции = 2 тогда 
		ЭтаФорма.Элементы.КаталогОбменаМастер.Видимость = Ложь; 
		ЭтаФорма.Элементы.МастерНастроекПродолжить.Заголовок = "Продолжить";
		// Сохраняем измененное значение интеграции
		Интеграция.СпособИнтеграции = 2;
		СохранитьИнтеграциюНаСервере(Интеграция);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОписаниеШага2Нажатие(Элемент)
	
	ЭтаФорма.Элементы.ОписаниеШага2.Видимость = Ложь;
	ЭтаФорма.Элементы.СвернутоеОписание.Видимость = Истина;
	
КонецПроцедуры 

&НаКлиенте
Процедура СвернутоеОписаниеНажатие(Элемент) 
	
	ЭтаФорма.Элементы.ОписаниеШага2.Видимость = Истина;
	ЭтаФорма.Элементы.СвернутоеОписание.Видимость = Ложь; 
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

 #Область НастройкиРазработчика
   
&НаСервере
Процедура ИспользоватьТестовыйКонтурПриИзмененииНаСервере()
	
	ХранилищеОбщихНастроек.Сохранить("ОФД_ЭДО_НастройкиОбработки",
									 "ЭтоТестовыйКонтур",
									 Объект.ЭтоТестоваяОбработка,
									 "Служебный параметр, определяющий соединение с тестовым контуром",
									 ПолучитьТекущегоПользователя());
КонецПроцедуры

&НаКлиенте
Процедура ИспользоватьТестовыйКонтурПриИзменении(Элемент)
	ИспользоватьТестовыйКонтурПриИзмененииНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура СкрытьНастройки(Команда)
	
	СкрытьНастройкиНаСервере(); 
	
КонецПроцедуры

&НаСервере
Процедура СкрытьНастройкиНаСервере(); 
	
	ЭтотОбъект.ПоказыватьНастройкиРазработчика = Ложь;    
	
	ХранилищеОбщихНастроек.Сохранить("ОФД_ЭДО_НастройкиОбработки",
									 "ПоказыватьНастройкиРазработчика",
									 ЭтотОбъект.ПоказыватьНастройкиРазработчика,
									 "Служебный параметр, определяющий доступность настроек для разработки",
									 ПолучитьТекущегоПользователя());
	
	Элементы.НастройкиРазработчика.Видимость = ЭтотОбъект.ПоказыватьНастройкиРазработчика;
	
КонецПроцедуры

 #КонецОбласти

#Область Криптография

&НаКлиенте
Функция ЗаполнитьСписокСертификатов(Менеджер)
	
	ТипХранилища = ТипХранилищаСертификатовКриптографии.ПерсональныеСертификаты;
	РасположениеХранилища = РасположениеХранилищаСертификатовКриптографии.ДанныеПользователяОС;
	
	Хранилище = Менеджер.ПолучитьХранилищеСертификатов(ТипХранилища,РасположениеХранилища);
	СертификатыХранилища = Хранилище.ПолучитьВсе();
	
	Сертификаты = Новый Соответствие;
	// Выбираем все сертификаты
	СертификатыХранилища = Хранилище.ПолучитьВсе();  	          
	ТекущаяДата = ТекущаяДата();
	
	Для Каждого ТекущийСертификат Из СертификатыХранилища Цикл
		Если ТекущийСертификат.ДатаОкончания <= КонецДня(ТекущаяДата) или Не ТекущийСертификат.ИспользоватьДляПодписи Тогда
			// Пропускаем истекшие сертификаты, если нужно
			Продолжить;
		КонецЕсли;
		
		//Если 	ТекущийСертификат.Субъект.Свойство("T") И
		//	ТекущийСертификат.Субъект.Свойство("CN") И
		Если ТекущийСертификат.Субъект.Свойство("SN") Тогда //И
			//	ТекущийСертификат.Субъект.Свойство("GN") Тогда
			
			Сертификаты.Вставить(ТекущийСертификат.Отпечаток, ТекущийСертификат);
		Иначе
			Продолжить;
		КонецЕсли;		
		
	КонецЦикла;
	
	Возврат Сертификаты;
	
КонецФункции

&НаКлиенте
Функция ПолучитьМенеджерКриптографии(ТипМенеджераКриптографии = 80) Экспорт 
	
	// Возврат Новый МенеджерКриптографии("", "", 75);      // Старый
	Возврат Новый МенеджерКриптографии("", "", ТипМенеджераКриптографии);  		// Новый	
	
КонецФункции

&НаКлиенте
Функция ПолучитьЭЦППоОтпечатку(Менеджер, Отпечаток) Экспорт
	
	Хранилище = Менеджер.ПолучитьХранилищеСертификатов(ТипХранилищаСертификатовКриптографии.ПерсональныеСертификаты);			
	Возврат Хранилище.НайтиПоОтпечатку(Отпечаток);  	
	
КонецФункции

&НаКлиенте
Процедура ПолучитьТокенАвторизацииПоПодписи(Команда)
	
	ПорядковыйНомерГруппы = Число(Прав(Команда.Имя, СтрДлина(Команда.Имя) - СтрДлина("ПолучитьТокенАвторизацииПоПодписи")));
	
	Если ЭтаФорма["СертификатОрганизации"+ПорядковыйНомерГруппы] = "" Тогда
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Перед попыткой обновления токена по сертификату, требуется выбрать сертификат.";
		Сообщение.Сообщить();
		Возврат;
	КонецЕсли;	
	
	ОтпечатокBase64 = ЭтаФорма["ОтпечатокСертификатаОрганизацииBase64"+ПорядковыйНомерГруппы];		
	ПарольДоступаКЗакрытомуКлючу = ЭтаФорма["ПарольДоступаКЗакрытомуКлючу"+ПорядковыйНомерГруппы];
	
	Отпечаток = Base64Значение(ОтпечатокBase64);
	ПарольСертификата = ПарольДоступаКЗакрытомуКлючу;
	
	Токен = ПолучитьТокенПоОтпечаткуСертификата(Отпечаток, ПарольСертификата);
	
	Если Токен = Неопределено ИЛИ НЕ ТипЗнч(Токен) = Тип("Строка") Тогда
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Не удалось получить токен авторизации по сертификату.";
		Сообщение.Сообщить();
	Иначе
		ЭтаФорма["Авторизация_AccessTokenОрганизации"+ПорядковыйНомерГруппы] = Токен;
		ЭтаФорма["Авторизация_RefreshTokenОрганизации"+ПорядковыйНомерГруппы] = "";
		ОбновитьПараметрыАвторизации(ПорядковыйНомерГруппы);
	КонецЕсли;	
	
КонецПроцедуры

&НаКлиенте
Функция ПолучитьТокенПоОтпечаткуСертификата(Отпечаток, ПарольДоступаКЗакрытомуКлючуСертификата = "") Экспорт
	
	СистемнаяИнформация = Новый СистемнаяИнформация;
	
	Менеджер = ПолучитьМенеджерКриптографии();
	Менеджер.ПарольДоступаКЗакрытомуКлючу = ПарольДоступаКЗакрытомуКлючуСертификата;
	ЭЦП = ПолучитьЭЦППоОтпечатку(Менеджер, Отпечаток);
	
	ПараметрыЗапроса = ПолучитьШаблонПараметровЗапроса(); 
	
	ЗаписьJSON = Новый ЗаписьJSON();
	
	ТекущаяДатаВUnixTime = Формат(УниверсальноеВремя(ТекущаяДата())- Дата(1970,1,1), "ЧГ=0"); 
	
	ЗаписьJSON.УстановитьСтроку();	    
	ЗаписьJSON.ЗаписатьНачалоОбъекта();
	ЗаписьJSON.ЗаписатьИмяСвойства("ts");
	ЗаписьJSON.ЗаписатьЗначение(ТекущаяДатаВUnixTime); 
	ЗаписьJSON.ЗаписатьИмяСвойства("nonce");
	ЗаписьJSON.ЗаписатьЗначение(Строка(Новый УникальныйИдентификатор()));  
	ЗаписьJSON.ЗаписатьКонецОбъекта();
	СтрокаJSON = ЗаписьJSON.Закрыть();
	
	Поток = Новый ПотокВПамяти;
	Текст = Новый ЗаписьТекста(Поток, КодировкаТекста.UTF8) ;
	Текст.Записать(СтрокаJSON);
	Текст.Закрыть();
	ДвоичныеДанные = Поток.ЗакрытьИПолучитьДвоичныеДанные();
	
	Отказ = Ложь;
	ОписаниеОшибки = "";
	Подпись = Менеджер.Подписать(ДвоичныеДанные, ЭЦП);
	РезультатПодписанияДвоичныеДанные = ПрисоединитьПодпись(Подпись, ДвоичныеДанные, Отказ, ОписаниеОшибки);
	
	ЭлектроннаяПодписьCMSBase64 = Base64Строка(РезультатПодписанияДвоичныеДанные);
	ЭлектроннаяПодписьCMSBase64 = СтрЗаменить(ЭлектроннаяПодписьCMSBase64, Символы.ПС, "");
	ЭлектроннаяПодписьCMSBase64 = СтрЗаменить(ЭлектроннаяПодписьCMSBase64, Символы.ВК, "");
	ЭлектроннаяПодписьCMSвDERвURL = КодироватьBase64СтрокуВСтрокуURLНаСервере(ЭлектроннаяПодписьCMSBase64);
	
	ПараметрыЗапроса.Параметры.Вставить("<Тело>", "grant_type=signature&signature="+ЭлектроннаяПодписьCMSвDERвURL);
	ПараметрыЗапроса.Параметры.Вставить("ИдентификаторКлиента", СистемнаяИнформация.ИдентификаторКлиента);
	
	РезультатЗапросаТокенаПоСертификату = API_ПолучитьТокенАвторизацииПоСертификату(ПараметрыЗапроса);
	
	Если НЕ РезультатЗапросаТокенаПоСертификату.Ошибка Тогда
		
		Возврат РезультатЗапросаТокенаПоСертификату.Результат.access_token;	
		
	Иначе	
		
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "При получении токена авторизации по сертификату произошла ошибка."
		+?(СтрНайти(РезультатЗапросаТокенаПоСертификату.Описание, "expired") = 0, "", Символы.ПС+"Идентификатор для получения токена был просрочен.")
		+?(СтрНайти(РезультатЗапросаТокенаПоСертификату.Описание, "No user by certificate or snils. Please ensure you use proper keys") = 0, "", 
		Символы.ПС+"Предосталенный сертификат не был зарегистрирован в личном кабинете абонента.")
		+Символы.ПС+"Описание ошибки:"+Символы.ПС+РезультатЗапросаТокенаПоСертификату.Описание;
		Сообщение.Сообщить();
		
		Возврат Неопределено;
		
	КонецЕсли;
	
КонецФункции

&НаСервереБезКонтекста
Функция КодироватьBase64СтрокуВСтрокуURLНаСервере(ЭлектроннаяПодписьBase64)
	
	Возврат КодироватьСтроку(ЭлектроннаяПодписьBase64, СпособКодированияСтроки.КодировкаURL);
	
КонецФункции

#Область ПолучениеПрисоединеннойПодписи
// Менеджер криптографии в 1С не умеет делать присоединённые подписи.
// Выхода два: подписывать через COM-объект КриптоПро или воспользоваться сторонним решением.
// Стороннее решение: https://infostart.ru/public/1493281/, за авторством Сивина Алексея.

&НаКлиенте
Функция РазмерКонтейтера(Элемент)
	Результат = Элемент.Длина + 2;
	
	Если Элемент.Длина<=127 Тогда
		
	ИначеЕсли Элемент.Длина<=255 Тогда
		Результат = Результат + 1;
	ИначеЕсли Элемент.Длина<=65535 Тогда
		Результат = Результат + 2;
	ИначеЕсли Элемент.Длина<=16777215 Тогда
		Результат = Результат + 3;
	ИначеЕсли Элемент.Длина<=4294967295 Тогда
		Результат = Результат + 4;
	ИначеЕсли Элемент.Длина<=1099511627776 Тогда
		Результат = Результат + 5;
	КонецЕсли;
	
	Возврат Результат;
КонецФункции

&НаКлиенте
Процедура ЗаписатьЭлемент(Элемент,Поток,ТолькоЗаголовок);
	ВремБуфер = Новый БуферДвоичныхДанных(8);
	
	ВремБуфер[0] = Элемент.ПервыйБайт;
	Поток.Записать(ВремБуфер,0,1);
	
	Если Элемент.Длина<=127 Тогда
		ВремБуфер[0] = Элемент.Длина;
		Поток.Записать(ВремБуфер,0,1);
	Иначе
		Если Элемент.Длина<=255 Тогда
			К = 1;
		ИначеЕсли Элемент.Длина<=65535 Тогда
			К = 2;
		ИначеЕсли Элемент.Длина<=16777215 Тогда
			К = 3;
		ИначеЕсли Элемент.Длина<=4294967295 Тогда
			К = 4;
		ИначеЕсли Элемент.Длина<=1099511627776 Тогда
			К = 5;
		КонецЕсли;
		ВремБуфер[0] = К+128;
		Поток.Записать(ВремБуфер,0,1);
		
		ВремБуфер.ЗаписатьЦелое64(0,Элемент.Длина,ПорядокБайтов.BigEndian);
		Поток.Записать(ВремБуфер,8-К,К);		
	КонецЕсли;
	
	Если ТолькоЗаголовок<>Истина Тогда
		Поток.Записать(Элемент.Буфер,0,Элемент.Буфер.Размер);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Функция ПрочитатьЭлемент(Буфер,Позиция,Отказ,ОписаниеОшибки)
	
	Результат = Новый Структура;
	
	Если Позиция>=Буфер.Размер Тогда
		Отказ = Истина;
		ОписаниеОшибки = "Ошибка чтения подписи В0001";
		Возврат Неопределено;
	КонецЕсли;
	
	Результат.Вставить("ПервыйБайт",Буфер[Позиция]); Позиция = Позиция + 1;
	
	Длина = 0;
	Если Позиция>=Буфер.Размер Тогда
		Отказ = Истина;
		ОписаниеОшибки = "Ошибка чтения подписи В0002";
		Возврат Неопределено;
	КонецЕсли;
	
	Байт = Буфер[Позиция]; Позиция = Позиция + 1;
	
	Если Байт<=127 Тогда
		Длина = Байт;
	ИначеЕсли Байт=128 Тогда
		Отказ = Истина;
		ОписаниеОшибки = "Ошибка чтения подписи В0003";
		Возврат Неопределено;
	Иначе
		К = Байт-128;
		
		ВремБуфер = Новый БуферДвоичныхДанных(8);
		ВремБуфер.ЗаписатьЦелое64(0,0);
		
		М = Новый Массив;
		Для х=1 По К Цикл
			
			Если Позиция>=Буфер.Размер Тогда
				Отказ = Истина;
				ОписаниеОшибки = "Ошибка чтения подписи В0004";
				Возврат Неопределено;
			КонецЕсли;
			
			ВремБуфер[7-К+х] = Буфер[Позиция];
			Позиция = Позиция + 1;
		КонецЦикла;
		
		Длина = ВремБуфер.ПрочитатьЦелое64(0,ПорядокБайтов.BigEndian);
	КонецЕсли;
	
	Если (Позиция+Длина)>Буфер.Размер Тогда
		Отказ = Истина;
		ОписаниеОшибки = "Ошибка чтения подписи В0005";
		Возврат Неопределено;
	КонецЕсли;
	
	Результат.Вставить("Длина",Длина);
	Результат.Вставить("Буфер",Буфер.Прочитать(Позиция,Длина));
	Позиция = Позиция + Длина;
	
	Возврат Результат;
КонецФункции

&НаКлиенте
Функция ПрисоединитьПодпись(Подпись,ДвоичныеДанные,Отказ,ОписаниеОшибки) Экспорт
	
	//Разбираем
	ЧтениеДанных = Новый ЧтениеДанных(Подпись);
	Буфер = ЧтениеДанных.ПрочитатьВБуферДвоичныхДанных();
	
	ПозицияА = 0;
	А1 = ПрочитатьЭлемент(Буфер,ПозицияА,Отказ,ОписаниеОшибки);
	Если Отказ Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Если А1.ПервыйБайт<>48 Тогда //SEQUENCE
		Отказ = Истина;
		ОписаниеОшибки = "Ошибка чтения подписи А0001";
		Возврат Неопределено;
	КонецЕсли;
	
	Если ПозицияА<>Буфер.Размер Тогда
		Отказ = Истина;
		ОписаниеОшибки = "Ошибка чтения подписи А0002";
		Возврат Неопределено;
	КонецЕсли;
	
	ПозицияБ = 0;
	Б1 = ПрочитатьЭлемент(А1.Буфер,ПозицияБ,Отказ,ОписаниеОшибки);
	Если Отказ Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Если Б1.ПервыйБайт<>6 Тогда //OBJECT IDENTIFIER
		Отказ = Истина;
		ОписаниеОшибки = "Ошибка чтения подписи А0003";
		Возврат Неопределено;
	КонецЕсли;
	
	Если ПолучитьBase64СтрокуИзБуфераДвоичныхДанных(Б1.Буфер)<>"KoZIhvcNAQcC" Тогда //1.2.840.113549.1.7.2
		Отказ = Истина;
		ОписаниеОшибки = "Ошибка чтения подписи А0004";
		Возврат Неопределено;
	КонецЕсли;
	
	Б2 = ПрочитатьЭлемент(А1.Буфер,ПозицияБ,Отказ,ОписаниеОшибки);
	Если Отказ Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Если ПозицияБ<>А1.Буфер.Размер Тогда
		Отказ = Истина;
		ОписаниеОшибки = "Ошибка чтения подписи А0005";
		Возврат Неопределено;
	КонецЕсли;
	
	ПозицияВ = 0;
	В1 = ПрочитатьЭлемент(Б2.Буфер,ПозицияВ,Отказ,ОписаниеОшибки);
	Если Отказ Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Если В1.ПервыйБайт<>48 Тогда //SEQUENCE
		Отказ = Истина;
		ОписаниеОшибки = "Ошибка чтения подписи А0006";
		Возврат Неопределено;
	КонецЕсли;
	
	Если ПозицияВ<>Б2.Буфер.Размер Тогда
		Отказ = Истина;
		ОписаниеОшибки = "Ошибка чтения подписи А0007";
		Возврат Неопределено;
	КонецЕсли;
	
	ПозицияГ = 0;
	Г1 = ПрочитатьЭлемент(В1.Буфер,ПозицияГ,Отказ,ОписаниеОшибки);
	Если Отказ Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Если Г1.ПервыйБайт<>2 Тогда //INTEGER
		Отказ = Истина;
		ОписаниеОшибки = "Ошибка чтения подписи А0008";
		Возврат Неопределено;
	КонецЕсли;
	
	Г2 = ПрочитатьЭлемент(В1.Буфер,ПозицияГ,Отказ,ОписаниеОшибки);
	Если Отказ Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Если Г2.ПервыйБайт<>49 Тогда //SET
		Отказ = Истина;
		ОписаниеОшибки = "Ошибка чтения подписи А0009";
		Возврат Неопределено;
	КонецЕсли;
	
	Г3 = ПрочитатьЭлемент(В1.Буфер,ПозицияГ,Отказ,ОписаниеОшибки);
	Если Отказ Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Если Г3.ПервыйБайт<>48 Тогда //SEQUENCE
		Отказ = Истина;
		ОписаниеОшибки = "Ошибка чтения подписи А0010";
		Возврат Неопределено;
	КонецЕсли;
	
	ПозицияД = 0;
	Д1 = ПрочитатьЭлемент(Г3.Буфер,ПозицияД,Отказ,ОписаниеОшибки);
	Если Отказ Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Если Д1.ПервыйБайт<>6 Тогда //OBJECT IDENTIFIER
		Отказ = Истина;
		ОписаниеОшибки = "Ошибка чтения подписи А0011";
		Возврат Неопределено;
	КонецЕсли;
	
	Если ПолучитьBase64СтрокуИзБуфераДвоичныхДанных(Д1.Буфер)<>"KoZIhvcNAQcB" Тогда //1.2.840.113549.1.7.1
		Отказ = Истина;
		ОписаниеОшибки = "Ошибка чтения подписи А0012";
		Возврат Неопределено;
	КонецЕсли;
	
	Если ПозицияД<>Г3.Буфер.Размер Тогда
		Отказ = Истина;
		ОписаниеОшибки = "Ошибка чтения подписи А0013";
		Возврат Неопределено;
	КонецЕсли;
	
	Г4 = ПрочитатьЭлемент(В1.Буфер,ПозицияГ,Отказ,ОписаниеОшибки);
	Если Отказ Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Г5 = ПрочитатьЭлемент(В1.Буфер,ПозицияГ,Отказ,ОписаниеОшибки);
	Если Отказ Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Если ПозицияГ<>В1.Буфер.Размер Тогда
		Отказ = Истина;
		ОписаниеОшибки = "Ошибка чтения подписи А0014";
		Возврат Неопределено;
	КонецЕсли;
	
	//Собираем
	
	//Создаем новые элементы Д2 И Е1
	ЧТ = Новый ЧтениеДанных(ДвоичныеДанные);
	Е1 = Новый Структура;
	Е1.Вставить("ПервыйБайт",4);
	Е1.Вставить("Буфер", ЧТ.ПрочитатьВБуферДвоичныхДанных());	
	Е1.Вставить("Длина",Е1.Буфер.Размер);
	
	Д2 = Новый Структура;
	Д2.Вставить("ПервыйБайт",160);
	Д2.Вставить("Длина",РазмерКонтейтера(Е1));
	
	Г3.Длина = РазмерКонтейтера(Д1)+РазмерКонтейтера(Д2);
	В1.Длина = РазмерКонтейтера(Г1)+РазмерКонтейтера(Г2)+РазмерКонтейтера(Г3)+РазмерКонтейтера(Г4)+РазмерКонтейтера(Г5);
	Б2.Длина = РазмерКонтейтера(В1);
	А1.Длина = РазмерКонтейтера(Б1)+РазмерКонтейтера(Б2);
	
	Поток = Новый ПотокВПамяти();
	
	ЗаписатьЭлемент(А1,Поток,Истина);
	ЗаписатьЭлемент(Б1,Поток,Ложь);
	ЗаписатьЭлемент(Б2,Поток,Истина);
	ЗаписатьЭлемент(В1,Поток,Истина);
	ЗаписатьЭлемент(Г1,Поток,Ложь);
	ЗаписатьЭлемент(Г2,Поток,Ложь);
	ЗаписатьЭлемент(Г3,Поток,Истина);
	ЗаписатьЭлемент(Д1,Поток,Ложь);
	ЗаписатьЭлемент(Д2,Поток,Истина);
	ЗаписатьЭлемент(Е1,Поток,Ложь);
	ЗаписатьЭлемент(Г4,Поток,Ложь);
	ЗаписатьЭлемент(Г5,Поток,Ложь);
	
	Возврат Поток.ЗакрытьИПолучитьДвоичныеДанные();
КонецФункции

#КонецОбласти

#КонецОбласти

#Область ЭлементыФормы_ПараметрыАвторизацииИПодписания

&НаКлиенте
Процедура ОтобразитьОрганизацииИСертификатыПриОткрытии(Интеграция)
	
	ОбработаноОрганизаций = 0;
	ОтобразитьОрганизацииИСертификатыПриОткрытииНаСервере(ОбработаноОрганизаций);
	
	Если ОбработаноОрганизаций = 0 Тогда
		Возврат;
	КонецЕсли;
	
	Счетчик = 1;	
	Пока НЕ Счетчик = ОбработаноОрганизаций Цикл
		
		//Если ИспользоватьПодписание Тогда
		ЗаполнитьСписокСертификатовВСписке(Счетчик);	
		//КонецЕсли;
		
		Если Интеграция.Свойство("ПараметрыАвторизацииИПодписания") Тогда
			Организация = ЭтаФорма["Авторизация_Организация"+Счетчик];
			ПараметрыАвторизацииИПодписанияОрганизации = Интеграция.ПараметрыАвторизацииИПодписания.Получить(Организация);
			Если НЕ ПараметрыАвторизацииИПодписанияОрганизации = Неопределено Тогда
				Если ПараметрыАвторизацииИПодписанияОрганизации.Свойство("AccessToken") Тогда
					ЭтаФорма["Авторизация_AccessTokenОрганизации"+Счетчик] = ПараметрыАвторизацииИПодписанияОрганизации.AccessToken;
				КонецЕсли;
				Если ПараметрыАвторизацииИПодписанияОрганизации.Свойство("RefreshToken") Тогда
					ЭтаФорма["Авторизация_RefreshTokenОрганизации"+Счетчик] = ПараметрыАвторизацииИПодписанияОрганизации.RefreshToken;
				КонецЕсли;	
				Если ПараметрыАвторизацииИПодписанияОрганизации.Свойство("ПараметрыПодписания") 
					И ПараметрыАвторизацииИПодписанияОрганизации.ПараметрыПодписания.Свойство("ОтпечатокСертификатаBase64")
					И НЕ ЭтаФорма["СертификатОрганизации"+Счетчик] = "Сертификаты не обнаружены" Тогда
					ЭтаФорма["СертификатОрганизации"+Счетчик] = ПараметрыАвторизацииИПодписанияОрганизации.ПараметрыПодписания.ОтпечатокСертификатаBase64;
					Если ПараметрыАвторизацииИПодписанияОрганизации.ПараметрыПодписания.Свойство("ПарольДоступаКЗакрытомуКлючу") Тогда 
						ЭтаФорма["ПарольДоступаКЗакрытомуКлючу"+Счетчик] = ПараметрыАвторизацииИПодписанияОрганизации.ПараметрыПодписания.ПарольДоступаКЗакрытомуКлючу;
					КонецЕсли;	
					Если ПараметрыАвторизацииИПодписанияОрганизации.ПараметрыПодписания.Свойство("ТипСубъекта") 
						И ПараметрыАвторизацииИПодписанияОрганизации.ПараметрыПодписания.ТипСубъекта = "ФЛ" Тогда
						ЭтаФорма["ТипСертификатаОрганизации"+Счетчик] = "ФЛ";	
						Если ПараметрыАвторизацииИПодписанияОрганизации.ПараметрыПодписания.Свойство("МчдGUID") Тогда	
							ЭтаФорма["GUIDДоверенности"+Счетчик] = ПараметрыАвторизацииИПодписанияОрганизации.ПараметрыПодписания.МчдGUID;
						КонецЕсли;
						Если ПараметрыАвторизацииИПодписанияОрганизации.ПараметрыПодписания.Свойство("ДатаНачалаДействияМЧД") Тогда	
							ЭтаФорма["ДатаНачалаДействияМЧД"+Счетчик] = ПараметрыАвторизацииИПодписанияОрганизации.ПараметрыПодписания.ДатаНачалаДействияМЧД;
						КонецЕсли;
						Если ПараметрыАвторизацииИПодписанияОрганизации.ПараметрыПодписания.Свойство("ДолжностьФизлица") Тогда	
							ЭтаФорма["ДолжностьФизлица"+Счетчик] = ПараметрыАвторизацииИПодписанияОрганизации.ПараметрыПодписания.ДолжностьФизлица;
						КонецЕсли;
					Иначе
						ЭтаФорма["ТипСертификатаОрганизации"+Счетчик] = "ЮЛ/ИП";
					КонецЕсли;
				КонецЕсли;
				Если НЕ ЭтаФорма["СертификатОрганизации"+Счетчик] = "Сертификаты не обнаружены" Тогда
					СертификатВСпискеПриИзменении(Элементы["СертификатОрганизации"+Счетчик]);
					Если ЭтаФорма["ПриРаботеСОрганизациейИспользуетсяПодписание"+Счетчик] = Истина Тогда
						Если ЗначениеЗаполнено(ЭтаФорма["Авторизация_RefreshTokenОрганизации"+Счетчик]) Тогда
							ЭтаФорма["АвторизацияПоСертификату"+Счетчик] = Ложь;
						Иначе
							ЭтаФорма["АвторизацияПоСертификату"+Счетчик] = Истина;
						КонецЕсли;
					Иначе
						ЭтаФорма["АвторизацияПоСертификату"+Счетчик] = Ложь;
					КонецЕсли;
				Иначе
					ЭтаФорма["АвторизацияПоСертификату"+Счетчик] = Ложь;
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;	
		
		Счетчик = Счетчик+1;
		
	КонецЦикла;
	
КонецПроцедуры	

&НаСервере
Процедура ОтобразитьОрганизацииИСертификатыПриОткрытииНаСервере(ПорядковыйНомерГруппы)
	
	Организации = ПолучитьДоступныеОрганизации1С();
	
	Если Организации = Неопределено Тогда
		Возврат;	
	КонецЕсли;	
	
	ПорядковыйНомерГруппы = 1;
	
	Для Каждого Организация из Организации Цикл
		
		// Реквизиты
		МассивРеквизитов = Новый Массив;
		
		МассивТипов = Новый Массив;
		МассивТипов.Добавить(Тип("СправочникСсылка.Организации"));
		ОписаниеТипов = Новый ОписаниеТипов(МассивТипов);
		МассивРеквизитов.Добавить(Новый РеквизитФормы("Авторизация_Организация"+ПорядковыйНомерГруппы, ОписаниеТипов, , ""));
		
		МассивТипов = Новый Массив;
		МассивТипов.Добавить(Тип("Строка"));
		ОписаниеТипов = Новый ОписаниеТипов(МассивТипов);
		МассивРеквизитов.Добавить(Новый РеквизитФормы("ИНН_Организации"+ПорядковыйНомерГруппы, ОписаниеТипов, , ""));
		
		МассивТипов = Новый Массив;
		МассивТипов.Добавить(Тип("Строка"));
		ОписаниеТипов = Новый ОписаниеТипов(МассивТипов);
		МассивРеквизитов.Добавить(Новый РеквизитФормы("КПП_Организации"+ПорядковыйНомерГруппы, ОписаниеТипов, , ""));
		
		МассивТипов = Новый Массив;
		МассивТипов.Добавить(Тип("Булево"));
		ОписаниеТипов = Новый ОписаниеТипов(МассивТипов);
		МассивРеквизитов.Добавить(Новый РеквизитФормы("ПриРаботеСОрганизациейИспользуетсяПодписание"+ПорядковыйНомерГруппы, ОписаниеТипов, , ""));
		
		МассивТипов = Новый Массив;
		МассивТипов.Добавить(Тип("Строка"));
		ОписаниеТипов = Новый ОписаниеТипов(МассивТипов);
		МассивРеквизитов.Добавить(Новый РеквизитФормы("СертификатОрганизации"+ПорядковыйНомерГруппы, ОписаниеТипов, , ""));
		
		МассивТипов = Новый Массив;
		МассивТипов.Добавить(Тип("Строка"));
		ОписаниеТипов = Новый ОписаниеТипов(МассивТипов);
		МассивРеквизитов.Добавить(Новый РеквизитФормы("ТипСертификатаОрганизации"+ПорядковыйНомерГруппы, ОписаниеТипов, , ""));
		
		МассивТипов = Новый Массив;
		МассивТипов.Добавить(Тип("Строка"));
		ОписаниеТипов = Новый ОписаниеТипов(МассивТипов);
		МассивРеквизитов.Добавить(Новый РеквизитФормы("ОтпечатокСертификатаОрганизацииBase64"+ПорядковыйНомерГруппы, ОписаниеТипов, , ""));
		
		МассивТипов = Новый Массив;
		МассивТипов.Добавить(Тип("Строка"));
		ОписаниеТипов = Новый ОписаниеТипов(МассивТипов);
		МассивРеквизитов.Добавить(Новый РеквизитФормы("ПарольДоступаКЗакрытомуКлючу"+ПорядковыйНомерГруппы, ОписаниеТипов, , ""));
		
		МассивТипов = Новый Массив;
		МассивТипов.Добавить(Тип("Строка"));
		ОписаниеТипов = Новый ОписаниеТипов(МассивТипов);
		МассивРеквизитов.Добавить(Новый РеквизитФормы("GUIDДоверенности"+ПорядковыйНомерГруппы, ОписаниеТипов, , ""));
		
		МассивТипов = Новый Массив;
		МассивТипов.Добавить(Тип("Строка"));
		ОписаниеТипов = Новый ОписаниеТипов(МассивТипов);
		МассивРеквизитов.Добавить(Новый РеквизитФормы("ДатаНачалаДействияМЧД"+ПорядковыйНомерГруппы, ОписаниеТипов, , ""));
		
		МассивТипов = Новый Массив;
		МассивТипов.Добавить(Тип("Строка"));
		ОписаниеТипов = Новый ОписаниеТипов(МассивТипов);
		МассивРеквизитов.Добавить(Новый РеквизитФормы("ДолжностьФизлица"+ПорядковыйНомерГруппы, ОписаниеТипов, , ""));
		
		МассивТипов = Новый Массив;
		МассивТипов.Добавить(Тип("Булево"));
		ОписаниеТипов = Новый ОписаниеТипов(МассивТипов);
		МассивРеквизитов.Добавить(Новый РеквизитФормы("АвторизацияПоСертификату"+ПорядковыйНомерГруппы, ОписаниеТипов, , ""));
		
		МассивТипов = Новый Массив;
		МассивТипов.Добавить(Тип("Строка"));
		ОписаниеТипов = Новый ОписаниеТипов(МассивТипов);
		МассивРеквизитов.Добавить(Новый РеквизитФормы("Авторизация_AccessTokenОрганизации"+ПорядковыйНомерГруппы, ОписаниеТипов, , ""));
		
		МассивТипов = Новый Массив;
		МассивТипов.Добавить(Тип("Строка"));
		ОписаниеТипов = Новый ОписаниеТипов(МассивТипов);
		МассивРеквизитов.Добавить(Новый РеквизитФормы("Авторизация_RefreshTokenОрганизации"+ПорядковыйНомерГруппы, ОписаниеТипов, , ""));
		
		// Фиксация новых реквизитов формы.
		ИзменитьРеквизиты(МассивРеквизитов); 
		
		ЭтаФорма["Авторизация_Организация"+ПорядковыйНомерГруппы]	= Организация.Ссылка;
		ЭтаФорма["ИНН_Организации"+ПорядковыйНомерГруппы]			= Организация.ИНН;
		ЭтаФорма["КПП_Организации"+ПорядковыйНомерГруппы]			= Организация.КПП;
		
		// Элементы
		ГруппаОрганизацияДанныеЭДО = Элементы.Добавить("ГруппаОрганизация"+ПорядковыйНомерГруппы+"ДанныеЭДО", Тип("ГруппаФормы"), Элементы["ПараметрыАвторизацииИПодписания"]);
		ГруппаОрганизацияДанныеЭДО.Вид = ВидГруппыФормы.ОбычнаяГруппа;
		ГруппаОрганизацияДанныеЭДО.Отображение = ОтображениеОбычнойГруппы.Нет;
		ГруппаОрганизацияДанныеЭДО.ОтображатьЗаголовок = Истина;
		ГруппаОрганизацияДанныеЭДО.Заголовок = Организация.Ссылка;
		ГруппаОрганизацияДанныеЭДО.Группировка = ГруппировкаПодчиненныхЭлементовФормы.Вертикальная;
		ГруппаОрганизацияДанныеЭДО.Видимость = Истина;
		
		ГруппаОрганизацияАвторизация = Элементы.Добавить("ГруппаОрганизация"+ПорядковыйНомерГруппы+"Авторизация", Тип("ГруппаФормы"), Элементы["ГруппаОрганизация"+ПорядковыйНомерГруппы+"ДанныеЭДО"]);
		ГруппаОрганизацияАвторизация.Вид = ВидГруппыФормы.ОбычнаяГруппа;
		ГруппаОрганизацияАвторизация.Отображение = ОтображениеОбычнойГруппы.Нет;
		ГруппаОрганизацияАвторизация.ОтображатьЗаголовок = Ложь;
		ГруппаОрганизацияАвторизация.Группировка = ГруппировкаПодчиненныхЭлементовФормы.Вертикальная;
		ГруппаОрганизацияАвторизация.Видимость = Истина;
		
		ГруппаОрганизацияДанныеСертификата = Элементы.Добавить("ГруппаОрганизация"+ПорядковыйНомерГруппы+"ДанныеСертификата", Тип("ГруппаФормы"), Элементы["ГруппаОрганизация"+ПорядковыйНомерГруппы+"ДанныеЭДО"]);
		ГруппаОрганизацияДанныеСертификата.Вид = ВидГруппыФормы.ОбычнаяГруппа;
		ГруппаОрганизацияДанныеСертификата.Отображение = ОтображениеОбычнойГруппы.Нет;
		ГруппаОрганизацияДанныеСертификата.ОтображатьЗаголовок = Ложь;
		ГруппаОрганизацияДанныеСертификата.Группировка = ГруппировкаПодчиненныхЭлементовФормы.ГоризонтальнаяВсегда;
		ГруппаОрганизацияДанныеСертификата.Видимость = Истина;
		
		ГруппаОрганизацияКнопки = Элементы.Добавить("ГруппаОрганизация"+ПорядковыйНомерГруппы+"Кнопки", Тип("ГруппаФормы"), Элементы["ГруппаОрганизация"+ПорядковыйНомерГруппы+"ДанныеЭДО"]);
		ГруппаОрганизацияКнопки.Вид = ВидГруппыФормы.ОбычнаяГруппа;
		ГруппаОрганизацияКнопки.Отображение = ОтображениеОбычнойГруппы.Нет;
		ГруппаОрганизацияКнопки.ОтображатьЗаголовок = Ложь;
		ГруппаОрганизацияКнопки.Группировка = ГруппировкаПодчиненныхЭлементовФормы.ГоризонтальнаяВсегда;
		ГруппаОрганизацияКнопки.Видимость = Истина;
		ГруппаОрганизацияКнопки.ГоризонтальноеПоложениеПодчиненных = ГоризонтальноеПоложениеЭлемента.Право;
		ГруппаОрганизацияКнопки.РастягиватьПоГоризонтали = Истина;
		
		ПолеAccessTokenОрганизации = Элементы.Добавить("AccessTokenОрганизации"+ПорядковыйНомерГруппы, Тип("ПолеФормы"), ГруппаОрганизацияАвторизация); 
		ПолеAccessTokenОрганизации.Вид = ВидПоляФормы.ПолеВвода;
		ПолеAccessTokenОрганизации.Заголовок = "Токен";
		ЭтаФорма["Авторизация_AccessTokenОрганизации"+ПорядковыйНомерГруппы] = "";
		ПолеAccessTokenОрганизации.ПутьКДанным = "Авторизация_AccessTokenОрганизации"+ПорядковыйНомерГруппы;
		ПолеAccessTokenОрганизации.УстановитьДействие("ПриИзменении", "AccessТокенВСпискеПриИзменении");
		ПолеAccessTokenОрганизации.ТолькоПросмотр = Истина; 
		ПолеAccessTokenОрганизации.МаксимальнаяШирина = 0;
		ПолеAccessTokenОрганизации.АвтоМаксимальнаяШирина = Ложь;
		ПолеAccessTokenОрганизации.РастягиватьПоГоризонтали = Истина;
		//ПолеAccessTokenОрганизации.Видимость = ПоказыватьСлужебныеРеквизиты;
		
		ПолеRefreshTokenОрганизации = Элементы.Добавить("RefreshTokenОрганизации"+ПорядковыйНомерГруппы, Тип("ПолеФормы"), ГруппаОрганизацияАвторизация); 
		ПолеRefreshTokenОрганизации.Вид = ВидПоляФормы.ПолеВвода;
		ПолеRefreshTokenОрганизации.Заголовок = "Refresh токен";
		ЭтаФорма["Авторизация_RefreshTokenОрганизации"+ПорядковыйНомерГруппы] = "";
		ПолеRefreshTokenОрганизации.ПутьКДанным = "Авторизация_RefreshTokenОрганизации"+ПорядковыйНомерГруппы;
		ПолеRefreshTokenОрганизации.УстановитьДействие("ПриИзменении", "RefreshТокенВСпискеПриИзменении");
		ПолеRefreshTokenОрганизации.ТолькоПросмотр = Истина;
		ПолеRefreshTokenОрганизации.МаксимальнаяШирина = 0;
		ПолеRefreshTokenОрганизации.АвтоМаксимальнаяШирина = Ложь;
		ПолеRefreshTokenОрганизации.РастягиватьПоГоризонтали = Истина;
		//ПолеRefreshTokenОрганизации.Видимость = ПоказыватьСлужебныеРеквизиты;
		
		ПолеСертификатОрганизации = Элементы.Добавить("СертификатОрганизации"+ПорядковыйНомерГруппы, Тип("ПолеФормы"), ГруппаОрганизацияДанныеСертификата); 
		ПолеСертификатОрганизации.Вид = ВидПоляФормы.ПолеВвода;
		ПолеСертификатОрганизации.Заголовок = "Сертификат";
		ЭтаФорма["СертификатОрганизации"+ПорядковыйНомерГруппы] = "";
		ПолеСертификатОрганизации.ПутьКДанным = "СертификатОрганизации"+ПорядковыйНомерГруппы;
		ПолеСертификатОрганизации.КнопкаВыпадающегоСписка = Истина;
		ПолеСертификатОрганизации.КнопкаОчистки = Истина;
		ПолеСертификатОрганизации.Доступность = Ложь;
		ПолеСертификатОрганизации.УстановитьДействие("ПриИзменении", "СертификатВСпискеПриИзменении");
		ПолеСертификатОрганизации.МаксимальнаяШирина = 0;
		ПолеСертификатОрганизации.АвтоМаксимальнаяШирина = Ложь;
		ПолеСертификатОрганизации.РастягиватьПоГоризонтали = Истина;
		
		ПолеПарольДоступаКЗакрытомуКлючу = Элементы.Добавить("ПарольДоступаКЗакрытомуКлючу"+ПорядковыйНомерГруппы, Тип("ПолеФормы"), ГруппаОрганизацияДанныеСертификата); 
		ПолеПарольДоступаКЗакрытомуКлючу.Вид = ВидПоляФормы.ПолеВвода;
		ПолеПарольДоступаКЗакрытомуКлючу.Заголовок = "Пароль";
		ЭтаФорма["ПарольДоступаКЗакрытомуКлючу"+ПорядковыйНомерГруппы] = "";
		ПолеПарольДоступаКЗакрытомуКлючу.ПутьКДанным = "ПарольДоступаКЗакрытомуКлючу"+ПорядковыйНомерГруппы;
		ПолеПарольДоступаКЗакрытомуКлючу.РежимПароля = Истина;
		ПолеПарольДоступаКЗакрытомуКлючу.УстановитьДействие("ПриИзменении", "ПарольДоступаКЗакрытомуКлючуВСпискеПриИзменении");
		ПолеПарольДоступаКЗакрытомуКлючу.МаксимальнаяШирина = 0;
		ПолеПарольДоступаКЗакрытомуКлючу.АвтоМаксимальнаяШирина = Ложь;
		ПолеПарольДоступаКЗакрытомуКлючу.РастягиватьПоГоризонтали = Истина;
		
		ПолеАвторизацияПоСертификатуОрганизации = Элементы.Добавить("АвторизацияПоСертификату"+ПорядковыйНомерГруппы, Тип("ПолеФормы"), ГруппаОрганизацияКнопки); 
		ПолеАвторизацияПоСертификатуОрганизации.Вид = ВидПоляФормы.ПолеФлажка;
		ПолеАвторизацияПоСертификатуОрганизации.Заголовок = "Авторизация по сертификату";
		ПолеАвторизацияПоСертификатуОрганизации.ПутьКДанным = "АвторизацияПоСертификату"+ПорядковыйНомерГруппы;
		ПолеАвторизацияПоСертификатуОрганизации.УстановитьДействие("ПриИзменении", "АвторизацияПоСертификатуВСпискеПриИзменении");
		ПолеАвторизацияПоСертификатуОрганизации.ГоризонтальноеПоложениеВГруппе = ГоризонтальноеПоложениеЭлемента.Лево;
		
		// Добавляем команду открытия формы авторизации.
		Команда = ЭтаФорма.Команды.Добавить("ОткрытьФормуАвторизации"+ПорядковыйНомерГруппы);
		Команда.Действие = "ОткрытьФормуАвторизации";
		Команда.Заголовок = "Авторизоваться по логину";
		Команда.Картинка = БиблиотекаКартинок.ПользовательИнтеграцииСистемыВзаимодействия;
		Команда.Отображение = ОтображениеКнопки.КартинкаИТекст;
		
		// Добавляем кнопку открытия формы авторизации.
		Элемент = ЭтаФорма.Элементы.Добавить("КнопкаОткрытьФормуАвторизации"+ПорядковыйНомерГруппы, Тип("КнопкаФормы"), ГруппаОрганизацияКнопки);
		Элемент.Вид = ВидКнопкиФормы.ОбычнаяКнопка;
		Элемент.ИмяКоманды = "ОткрытьФормуАвторизации"+ПорядковыйНомерГруппы;
		Элемент.ЦветФона = ЦветаСтиля.ЦветВажного;
		Элемент.Ширина = 25;
		Элемент.РастягиватьПоГоризонтали = Ложь;
		Элемент.ГоризонтальноеПоложениеВГруппе = ГоризонтальноеПоложениеЭлемента.Право;
		
		// Добавляем команды запроса токена по сертификату.
		Команда = ЭтаФорма.Команды.Добавить("ПолучитьТокенАвторизацииПоПодписи"+ПорядковыйНомерГруппы);
		Команда.Действие = "ПолучитьТокенАвторизацииПоПодписи";
		Команда.Заголовок = "Авторизоваться по сертификату";
		Команда.Картинка = БиблиотекаКартинок.ПользовательСистемыВзаимодействия;
		Команда.Отображение = ОтображениеКнопки.КартинкаИТекст;
		
		// Добавляем кнопку запроса токена по сертификату.
		Элемент = ЭтаФорма.Элементы.Добавить("КнопкаПолучитьТокенАвторизацииПоПодписи"+ПорядковыйНомерГруппы, Тип("КнопкаФормы"), ГруппаОрганизацияКнопки);
		Элемент.Вид = ВидКнопкиФормы.ОбычнаяКнопка;
		Элемент.ИмяКоманды = "ПолучитьТокенАвторизацииПоПодписи"+ПорядковыйНомерГруппы;
		Элемент.ЦветФона = ЦветаСтиля.ЦветВажного;
		Элемент.Ширина = 25;
		Элемент.РастягиватьПоГоризонтали = Ложь;
		Элемент.ГоризонтальноеПоложениеВГруппе = ГоризонтальноеПоложениеЭлемента.Право;
		
		ГруппаОрганизацияДанныеМЧД = Элементы.Добавить("ГруппаОрганизация"+ПорядковыйНомерГруппы+"ДанныеМЧД", Тип("ГруппаФормы"), Элементы["ПараметрыАвторизацииИПодписания"]);
		ГруппаОрганизацияДанныеМЧД.Вид = ВидГруппыФормы.ОбычнаяГруппа;
		ГруппаОрганизацияДанныеМЧД.Отображение = ОтображениеОбычнойГруппы.Нет;
		ГруппаОрганизацияДанныеМЧД.ОтображатьЗаголовок = Ложь;
		ГруппаОрганизацияДанныеМЧД.Заголовок = Организация.Ссылка;
		ГруппаОрганизацияДанныеМЧД.Группировка = ГруппировкаПодчиненныхЭлементовФормы.ГоризонтальнаяВсегда;
		ГруппаОрганизацияДанныеМЧД.Видимость = Ложь;
		
		НадписьСертификатФизлица = ЭтаФорма.Элементы.Добавить("НадписьСертификатФизлица"+ПорядковыйНомерГруппы, Тип("ДекорацияФормы"), ГруппаОрганизацияДанныеМЧД);
		НадписьСертификатФизлица.Вид = ВидДекорацииФормы.Надпись;
		НадписьСертификатФизлица.Заголовок = "Выбран сертификат физического лица.";
		
		ПолеGUIDДоверенности = Элементы.Добавить("GUIDДоверенности"+ПорядковыйНомерГруппы, Тип("ПолеФормы"), ГруппаОрганизацияДанныеМЧД); 
		ПолеGUIDДоверенности.Вид = ВидПоляФормы.ПолеВвода;
		ПолеGUIDДоверенности.Заголовок = "Идентификатор доверенности";
		ЭтаФорма["GUIDДоверенности"+ПорядковыйНомерГруппы] = "";
		ПолеGUIDДоверенности.ПутьКДанным = "GUIDДоверенности"+ПорядковыйНомерГруппы;
		ПолеGUIDДоверенности.Маска = "NNNNNNNN-NNNN-NNNN-NNNN-NNNNNNNNNNNN";
		ПолеGUIDДоверенности.УстановитьДействие("ПриИзменении", "GUIDДоверенностиВСпискеПриИзменении");
		
		ДатаНачалаДействияМЧД = Элементы.Добавить("ДатаНачалаДействияМЧД"+ПорядковыйНомерГруппы, Тип("ПолеФормы"), ГруппаОрганизацияДанныеМЧД); 
		ДатаНачалаДействияМЧД.Вид = ВидПоляФормы.ПолеВвода;
		ДатаНачалаДействияМЧД.Заголовок = "дата выдачи";
		ЭтаФорма["ДатаНачалаДействияМЧД"+ПорядковыйНомерГруппы] = "";
		ДатаНачалаДействияМЧД.ПутьКДанным = "ДатаНачалаДействияМЧД"+ПорядковыйНомерГруппы;
		ДатаНачалаДействияМЧД.ТолькоПросмотр = Истина;
		
		ПолеДолжностьФизлица = Элементы.Добавить("ДолжностьФизлица"+ПорядковыйНомерГруппы, Тип("ПолеФормы"), ГруппаОрганизацияДанныеМЧД); 
		ПолеДолжностьФизлица.Вид = ВидПоляФормы.ПолеВвода;
		ПолеДолжностьФизлица.Заголовок = "Должность";
		ЭтаФорма["ДолжностьФизлица"+ПорядковыйНомерГруппы] = "";
		ПолеДолжностьФизлица.ПутьКДанным = "ДолжностьФизлица"+ПорядковыйНомерГруппы;
		ПолеДолжностьФизлица.УстановитьДействие("ПриИзменении", "ДолжностьФизлицаПриИзменении");
		
		ПорядковыйНомерГруппы = ПорядковыйНомерГруппы + 1;
		
	КонецЦикла;	
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьСписокСертификатовВСписке(ПорядковыйНомерГруппы)
	
	Элемент = Элементы["СертификатОрганизации"+ПорядковыйНомерГруппы];
	
	Попытка
		Менеджер = ПолучитьМенеджерКриптографии();			
	Исключение
		ЭтаФорма["СертификатОрганизации"+ПорядковыйНомерГруппы] = "Сертификаты не обнаружены";
		Сообщить("Подключение " + Элемент.ВыделенныйТекст + " не удалось.");
		Возврат ;
	КонецПопытки;
	
	Элементы["СертификатОрганизации"+ПорядковыйНомерГруппы].СписокВыбора.Очистить();
	
	СписокДоступныхСертификатов = ЗаполнитьСписокСертификатов(Менеджер);
	
	Если СписокДоступныхСертификатов.Количество() <> 0 Тогда
		
		КоличествоДоступныхСертификатовОрганизации = 0;
		
		Для Каждого ТекущийСертификат Из СписокДоступныхСертификатов Цикл
			
			Сертификат_ИНН = "";
			
			Если ТекущийСертификат.Значение.Субъект.Свойство("OID1_2_643_100_4") Тогда
				Сертификат_ИНН = ТекущийСертификат.Значение.Субъект.OID1_2_643_100_4;
			ИначеЕсли ТекущийСертификат.Значение.Субъект.Свойство("OID1_2_643_3_131_1_1") Тогда
				Сертификат_ИНН = ТекущийСертификат.Значение.Субъект.OID1_2_643_3_131_1_1;
			ИначеЕсли ТекущийСертификат.Значение.Субъект.Свойство("INNLE") Тогда
				Сертификат_ИНН = ТекущийСертификат.Значение.Субъект.INNLE;
			ИначеЕсли ТекущийСертификат.Значение.Субъект.Свойство("ИННЮЛ") Тогда
				Сертификат_ИНН = ТекущийСертификат.Значение.Субъект.ИННЮЛ;
			ИначеЕсли ТекущийСертификат.Значение.Субъект.Свойство("ИНН_ЮЛ") Тогда
				Сертификат_ИНН = ТекущийСертификат.Значение.Субъект.ИНН_ЮЛ;
			ИначеЕсли ТекущийСертификат.Значение.Субъект.Свойство("ИНН") Тогда
				Сертификат_ИНН = ТекущийСертификат.Значение.Субъект.ИНН;
			ИначеЕсли ТекущийСертификат.Значение.Субъект.Свойство("ИННОрганизации") Тогда
				Сертификат_ИНН = ТекущийСертификат.Значение.Субъект.ИННОрганизации;
			ИначеЕсли ТекущийСертификат.Значение.Субъект.Свойство("ИНН_Организации") Тогда
				Сертификат_ИНН = ТекущийСертификат.Значение.Субъект.ИНН_Организации;	
			КонецЕсли;	
			
			Если Сертификат_ИНН = "" Тогда
				Продолжить;
			КонецЕсли;
			
			Если СтрДлина(Сертификат_ИНН) = 12 И Лев(Сертификат_ИНН, 2) = "00" Тогда
				Сертификат_ИНН = Прав(Сертификат_ИНН, 10);	
			КонецЕсли;	
			
			ЭтоСертификатЮЛ = Ложь;
			ЭтоСертификатИП = Ложь;
			ЭтоСертификатФЛ = Ложь;
			
			Если НЕ ЭтаФорма["ИНН_Организации"+ПорядковыйНомерГруппы] = "" Тогда
				
				СубъектСодержитОГРНИП = Ложь;
				
				Если ТекущийСертификат.Значение.Субъект.Свойство("OID1_2_643_100_5") Тогда
					СубъектСодержитОГРНИП = Истина;
				ИначеЕсли ТекущийСертификат.Значение.Субъект.Свойство("OID_1_2_643_100_1") Тогда
					СубъектСодержитОГРНИП = Истина;	
				ИначеЕсли ТекущийСертификат.Значение.Субъект.Свойство("ОГРН") Тогда
					СубъектСодержитОГРНИП = Истина;
				ИначеЕсли ТекущийСертификат.Значение.Субъект.Свойство("ОГРНИП") Тогда
					СубъектСодержитОГРНИП = Истина;	
				ИначеЕсли ТекущийСертификат.Значение.Субъект.Свойство("OGRN") Тогда
					СубъектСодержитОГРНИП = Истина;
				ИначеЕсли ТекущийСертификат.Значение.Субъект.Свойство("OGRNIP") Тогда
					СубъектСодержитОГРНИП = Истина;	
				КонецЕсли;	
				
				Если СтрНайти(Сертификат_ИНН, ЭтаФорма["ИНН_Организации"+ПорядковыйНомерГруппы])>0 Тогда
					// Это сертификат ЮЛ или ИП.
					Если СтрДлина(Сертификат_ИНН) = 10 Тогда
						// Если ИНН 10 символов - ЮЛ.
						ЭтоСертификатЮЛ = Истина;
					ИначеЕсли СтрДлина(Сертификат_ИНН) = 12 И СубъектСодержитОГРНИП Тогда	
						// Если ИНН 12 символов и есть ОГРН ИП, то сертификат ИП.
						ЭтоСертификатИП = Истина;
					КонецЕсли;	
				Иначе
					// Если в структуре субъекта нет ОГРН ИП, это сертификат ФЛ.
					Если СтрДлина(Сертификат_ИНН) = 12 И НЕ Лев(Сертификат_ИНН, 2) = "00" И НЕ СубъектСодержитОГРНИП Тогда
						ЭтоСертификатФЛ = Истина;
					ИначеЕсли СтрДлина(Сертификат_ИНН) = 12 И НЕ Лев(Сертификат_ИНН, 2) = "00" И СубъектСодержитОГРНИП Тогда
						// Если ИНН 12 символов и есть ОГРН ИП, то сертификат ИП.
						// Даже если ИП сам по себе не является "организацией-продавцом".
						ЭтоСертификатИП = Истина;	
					КонецЕсли;	
				КонецЕсли;	
				
			КонецЕсли;	
			
			Если ЭтоСертификатЮЛ ИЛИ ЭтоСертификатИП Тогда 
				Если НЕ ЭтаФорма["ИНН_Организации"+ПорядковыйНомерГруппы] = "" И СтрНайти(Сертификат_ИНН, ЭтаФорма["ИНН_Организации"+ПорядковыйНомерГруппы])>0 Тогда
					Представление = ?(ТекущийСертификат.Значение.Субъект.Свойство("T"), ТекущийСертификат.Значение.Субъект.T+ " ", "ИП ") + 
					?(ТекущийСертификат.Значение.Субъект.Свойство("CN"), ТекущийСертификат.Значение.Субъект.CN + " / ", " / ") + 
					ТекущийСертификат.Значение.Субъект.SN + " " + 
					?(ТекущийСертификат.Значение.Субъект.Свойство("GN"), ТекущийСертификат.Значение.Субъект.GN, "") + 
					" действует до " + Формат(ТекущийСертификат.Значение.ДатаОкончания, "ДФ=dd.MM.yyyy");
					Элементы["СертификатОрганизации"+ПорядковыйНомерГруппы].СписокВыбора.Добавить(Base64Строка(ТекущийСертификат.Значение.Отпечаток), Представление);
					КоличествоДоступныхСертификатовОрганизации = КоличествоДоступныхСертификатовОрганизации+1;
				КонецЕсли;
			ИначеЕсли ЭтоСертификатФЛ Тогда
				Представление = "Физическое лицо " + 
				ТекущийСертификат.Значение.Субъект.CN +   
				" действует до " + Формат(ТекущийСертификат.Значение.ДатаОкончания, "ДФ=dd.MM.yyyy");
				Элементы["СертификатОрганизации"+ПорядковыйНомерГруппы].СписокВыбора.Добавить(Base64Строка(ТекущийСертификат.Значение.Отпечаток), Представление);
				КоличествоДоступныхСертификатовОрганизации = КоличествоДоступныхСертификатовОрганизации+1;
			КонецЕсли;
			
		КонецЦикла;
		
		Если КоличествоДоступныхСертификатовОрганизации = 0 Тогда
			Элементы["СертификатОрганизации"+ПорядковыйНомерГруппы].Доступность = Ложь;
			ЭтаФорма["СертификатОрганизации"+ПорядковыйНомерГруппы] = "Сертификаты не обнаружены";
			Элементы["ПарольДоступаКЗакрытомуКлючу"+ПорядковыйНомерГруппы].Доступность = Ложь;
			Элементы["КнопкаПолучитьТокенАвторизацииПоПодписи"+ПорядковыйНомерГруппы].Доступность = Ложь;
		Иначе
			Элементы["СертификатОрганизации"+ПорядковыйНомерГруппы].Доступность = Истина;
			Элементы["ПарольДоступаКЗакрытомуКлючу"+ПорядковыйНомерГруппы].Доступность = Истина;
			Элементы["КнопкаПолучитьТокенАвторизацииПоПодписи"+ПорядковыйНомерГруппы].Доступность = Истина;
		КонецЕсли;	
		
	Иначе
		//Сообщить("Персональные сертификаты отсутствуют в менеджере криптографии.");			
	КонецЕсли; 		
	
КонецПроцедуры

&НаКлиенте
Процедура СертификатВСпискеПриИзменении(Элемент)
	
	Интеграция = ПолучитьИнтеграциюНаСервере(ВерсияНастроекОбработки);
	
	ЭтоСертификатФЛ = Ложь;
	
	ПорядковыйНомерГруппы = Число(Прав(Элемент.Имя, СтрДлина(Элемент.Имя) - СтрДлина("СертификатОрганизации")));
	
	Если ЭтаФорма["СертификатОрганизации"+ПорядковыйНомерГруппы] = "" ИЛИ ЭтаФорма["СертификатОрганизации"+ПорядковыйНомерГруппы] = "Сертификаты не обнаружены" Тогда
		ЭтаФорма.Элементы["ГруппаОрганизация"+ПорядковыйНомерГруппы+"ДанныеМЧД"].Видимость = Ложь;
		ЭтаФорма["ОтпечатокСертификатаОрганизацииBase64"+ПорядковыйНомерГруппы] = "";
		ЭтаФорма["GUIDДоверенности"+ПорядковыйНомерГруппы] = "";
		ЭтаФорма["ПарольДоступаКЗакрытомуКлючу"+ПорядковыйНомерГруппы] = "";
		//ЭтаФорма["Авторизация_ТокенОрганизации"+ПорядковыйНомерГруппы] = "";
		ОбновитьПараметрыАвторизации(ПорядковыйНомерГруппы);
		Возврат;
	КонецЕсли;	
	
	Этаформа["ОтпечатокСертификатаОрганизацииBase64"+ПорядковыйНомерГруппы] = ЭтаФорма["СертификатОрганизации"+ПорядковыйНомерГруппы];
	
	Менеджер = ПолучитьМенеджерКриптографии();
	
	Сертификат  = ПолучитьЭЦППоОтпечатку(Менеджер, Base64Значение(Этаформа["ОтпечатокСертификатаОрганизацииBase64"+ПорядковыйНомерГруппы]));
	
	Если НЕ Сертификат = Неопределено Тогда
		
		Сертификат_ИНН = "";
		
		Если Сертификат.Субъект.Свойство("OID1_2_643_100_4") Тогда
			Сертификат_ИНН = Сертификат.Субъект.OID1_2_643_100_4;
		ИначеЕсли Сертификат.Субъект.Свойство("OID1_2_643_3_131_1_1") Тогда
			Сертификат_ИНН = Сертификат.Субъект.OID1_2_643_3_131_1_1;
		ИначеЕсли Сертификат.Субъект.Свойство("INNLE") Тогда
			Сертификат_ИНН = Сертификат.Субъект.INNLE;
		ИначеЕсли Сертификат.Субъект.Свойство("ИННЮЛ") Тогда
			Сертификат_ИНН = Сертификат.Субъект.ИННЮЛ;
		ИначеЕсли Сертификат.Субъект.Свойство("ИНН_ЮЛ") Тогда
			Сертификат_ИНН = Сертификат.Субъект.ИНН_ЮЛ;
		ИначеЕсли Сертификат.Субъект.Свойство("ИНН") Тогда
			Сертификат_ИНН = Сертификат.Субъект.ИНН;
		ИначеЕсли Сертификат.Субъект.Свойство("ИННОрганизации") Тогда
			Сертификат_ИНН = Сертификат.Субъект.ИННОрганизации;
		ИначеЕсли Сертификат.Субъект.Свойство("ИНН_Организации") Тогда
			Сертификат_ИНН = Сертификат.Субъект.ИНН_Организации;	
		КонецЕсли;
		
		СубъектСодержитОГРНИП = Ложь;
		
		Если Сертификат.Субъект.Свойство("OID1_2_643_100_5") Тогда
			СубъектСодержитОГРНИП = Истина;
		ИначеЕсли Сертификат.Субъект.Свойство("OID_1_2_643_100_1") Тогда
			СубъектСодержитОГРНИП = Истина;	
		ИначеЕсли Сертификат.Субъект.Свойство("ОГРН") Тогда
			СубъектСодержитОГРНИП = Истина;
		ИначеЕсли Сертификат.Субъект.Свойство("ОГРНИП") Тогда
			СубъектСодержитОГРНИП = Истина;	
		ИначеЕсли Сертификат.Субъект.Свойство("OGRN") Тогда
			СубъектСодержитОГРНИП = Истина;
		ИначеЕсли Сертификат.Субъект.Свойство("OGRNIP") Тогда
			СубъектСодержитОГРНИП = Истина;	
		КонецЕсли;
		
		Если НЕ СтрНайти(Сертификат_ИНН, ЭтаФорма["ИНН_Организации"+ПорядковыйНомерГруппы])>0 И СтрДлина(Сертификат_ИНН) = 12 И НЕ Лев(Сертификат_ИНН, 2) = "00" И НЕ СубъектСодержитОГРНИП Тогда
			// Это сертификат ФЛ.
			ЭтоСертификатФЛ = Истина;
		КонецЕсли;  
		ЭтаФорма.Элементы["GUIDДоверенности"+ПорядковыйНомерГруппы].Доступность = ЭтоСертификатФЛ;
		СертификатСтрока = ?(ЭтоСертификатФЛ, "Физическое лицо", ?(Сертификат.Субъект.Свойство("T"), Сертификат.Субъект.T, "ИП")) + " " + Сертификат.Субъект.CN + " / " + Сертификат.Субъект.SN + " " + Сертификат.Субъект.GN;		
		
	Иначе
		
		ЭтаФорма["ПриРаботеСОрганизациейИспользуетсяПодписание"+ПорядковыйНомерГруппы] = Ложь;	
		
	КонецЕсли;	
	
	Организация = ЭтаФорма["Авторизация_Организация"+ПорядковыйНомерГруппы];
	ПараметрыАвторизацииИПодписанияОрганизации = Интеграция.ПараметрыАвторизацииИПодписания.Получить(Организация);
	
	Если НЕ ПараметрыАвторизацииИПодписанияОрганизации = Неопределено И ПараметрыАвторизацииИПодписанияОрганизации.ПараметрыПодписания.Свойство("ОтпечатокСертификатаBase64") И НЕ Этаформа["ОтпечатокСертификатаОрганизацииBase64"+ПорядковыйНомерГруппы] = ПараметрыАвторизацииИПодписанияОрганизации.ПараметрыПодписания.ОтпечатокСертификатаBase64	Тогда
		ЭтаФорма["GUIDДоверенности"+ПорядковыйНомерГруппы] = "";
		ЭтаФорма["ПарольДоступаКЗакрытомуКлючу"+ПорядковыйНомерГруппы] = "";
		ЭтаФорма["ПриРаботеСОрганизациейИспользуетсяПодписание"+ПорядковыйНомерГруппы] = Ложь;
	КонецЕсли;	
	
	ЭтаФорма["СертификатОрганизации"+ПорядковыйНомерГруппы] = СертификатСтрока;
	ЭтаФорма["ТипСертификатаОрганизации"+ПорядковыйНомерГруппы] = ?(ЭтоСертификатФЛ, "ФЛ", "ЮЛ/ИП");
	ЭтаФорма["ПриРаботеСОрганизациейИспользуетсяПодписание"+ПорядковыйНомерГруппы] = Истина;
	Элементы["ГруппаОрганизация"+ПорядковыйНомерГруппы+"ДанныеМЧД"].Видимость = ?(ЭтоСертификатФЛ, Истина, Ложь);
	
	Если ЭтоСертификатФЛ тогда
	ПереместитьЭлементФормы("ГруппаОрганизация"+ПорядковыйНомерГруппы+"ДанныеМЧД", "ГруппаОрганизация"+ПорядковыйНомерГруппы+"ДанныеЭДО", "ГруппаОрганизация"+ПорядковыйНомерГруппы+"Кнопки");
	КонецЕсли;

	ОбновитьПараметрыАвторизации(ПорядковыйНомерГруппы);
	ОбновитьВидимостьЭлементовФормы();
	
КонецПроцедуры

&НаСервере
Процедура ПереместитьЭлементФормы(ПеремещаемыйЭлемент, КудаПереместить, Порядок)
	
	Если НЕ Порядок = "" тогда
		ЭтаФорма.Элементы.Переместить(ЭтаФорма.Элементы[ПеремещаемыйЭлемент], ЭтаФорма.Элементы[КудаПереместить], ЭтаФорма.Элементы[Порядок]);
	Иначе
		ЭтаФорма.Элементы.Переместить(ЭтаФорма.Элементы[ПеремещаемыйЭлемент], ЭтаФорма.Элементы[КудаПереместить]);
	КонецЕсли
	
КонецПроцедуры

&НаКлиенте
Процедура GUIDДоверенностиВСпискеПриИзменении(Элемент)
	
	ПорядковыйНомерГруппы = Число(Прав(Элемент.Имя, СтрДлина(Элемент.Имя) - СтрДлина("GUIDДоверенности")));
	ИдентификаторОрганизации = "";
	ДатаВыдачиДоверенности = "";
	
	ОрганизацияГруппы = ЭтаФорма["Авторизация_Организация"+ПорядковыйНомерГруппы];
	ИННОрганизацииГруппы = ЭтаФорма["ИНН_Организации"+ПорядковыйНомерГруппы];
	КППОрганизацииГруппы = ЭтаФорма["КПП_Организации"+ПорядковыйНомерГруппы];
	GUIDДоверенностиГруппы = ЭтаФорма["GUIDДоверенности"+ПорядковыйНомерГруппы];
	ИдентификаторОрганизации = ПолучитьИдентификаторЭДОИз1СПоСсылке(ЭтаФорма["Авторизация_Организация"+ПорядковыйНомерГруппы]);
	
	Если НЕ ЗначениеЗаполнено(ЭтаФорма["Авторизация_AccessTokenОрганизации"+ПорядковыйНомерГруппы]) Тогда
		Возврат
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(ИдентификаторОрганизации) Тогда		
		ПараметрыЗапроса = ПолучитьШаблонПараметровЗапроса();
		ПараметрыЗапроса.Параметры.Вставить("<inn>", ИННОрганизацииГруппы);
		Если ЗначениеЗаполнено(КППОрганизацииГруппы) Тогда
			ПараметрыЗапроса.Параметры.Вставить("<kpp>", КППОрганизацииГруппы);
		КонецЕсли;	
		ИнформацияОбАбоненте = ВыполнитьЗапросAPI("API_ИнформацияОбАбоненте", ПараметрыЗапроса, ПорядковыйНомерГруппы);		
		Если Не ИнформацияОбАбоненте.Ошибка Тогда
			Если ТипЗнч(ИнформацияОбАбоненте.Результат) = Тип("Массив") и ИнформацияОбАбоненте.Результат.Количество() <> 0 Тогда
				Для Каждого ЭлементРезультата из ИнформацияОбАбоненте.Результат Цикл
					Если Лев(ЭлементРезультата.gid, 3) = "2VO" Тогда
						ИдентификаторОрганизации = ЭлементРезультата.gid;
					КонецЕсли;
				КонецЦикла;		
			КонецЕсли;
		Иначе
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = Сообщение.Текст = "Не удалось получить информацию об абоненте организации "+ОрганизацияГруппы+" для получения идентификатора абонента."+Символы.ПС+"Описание ошибки:";
			Сообщение.Сообщить();
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = ИнформацияОбАбоненте.Описание;
			Сообщение.Сообщить();
		КонецЕсли;			
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(ИдентификаторОрганизации) Тогда
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = Сообщение.Текст = "Не удалось получить информацию об абоненте организации "+ОрганизацияГруппы+" для получения идентификатора абонента."
		+Символы.ПС+"Получение инфомации по МЧД возможно только при наличии идентификатора абонента ЭДО.";
		Сообщение.Сообщить();
		ЭтаФорма["ДатаНачалаДействияМЧД"+ПорядковыйНомерГруппы] = "";
		Возврат;
	КонецЕсли;	
	
	ПараметрыЗапросаДанныхАбонента = ПолучитьШаблонПараметровЗапроса();
	ПараметрыЗапросаДанныхАбонента.Параметры.Вставить("<gid>", ИдентификаторОрганизации);
	РезультатЗапросаДанныхАбонента = ВыполнитьЗапросAPI("API_ИнформацияОбАбоненте", ПараметрыЗапросаДанныхАбонента, ПорядковыйНомерГруппы);
	Если РезультатЗапросаДанныхАбонента.Ошибка = Истина Тогда
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Не удалось получить информацию об абоненте организации "+ОрганизацияГруппы+" с идентификатором "+ИдентификаторОрганизации+".";
		Сообщение.Сообщить();
		ЭтаФорма["ДатаНачалаДействияМЧД"+ПорядковыйНомерГруппы] = "";
		Возврат;
	ИначеЕсли НЕ ЗначениеЗаполнено(РезультатЗапросаДанныхАбонента.Результат) Тогда
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Не удалось получить информацию об абоненте организации "+ОрганизацияГруппы+" с идентификатором "+ИдентификаторОрганизации+".";
		Сообщение.Сообщить();
		ЭтаФорма["ДатаНачалаДействияМЧД"+ПорядковыйНомерГруппы] = "";
		Возврат;
	ИначеЕсли РезультатЗапросаДанныхАбонента.Результат.Количество() = 0 Тогда
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Не удалось получить информацию об абоненте организации "+ОрганизацияГруппы+" с идентификатором "+ИдентификаторОрганизации+".";
		Сообщение.Сообщить();
		ЭтаФорма["ДатаНачалаДействияМЧД"+ПорядковыйНомерГруппы] = "";
		Возврат;
	КонецЕсли;
	ИдентификаторАбонентаОрганизации = Формат(РезультатЗапросаДанныхАбонента.Результат[0].id, "ЧГ=0");
	ПараметрыЗапросаДанныхМЧД = ПолучитьШаблонПараметровЗапроса();
	ПараметрыЗапросаДанныхМЧД.Параметры.Вставить("<МчдGUID>",		ЭтаФорма["GUIDДоверенности"+ПорядковыйНомерГруппы]);
	ПараметрыЗапросаДанныхМЧД.Параметры.Вставить("<issuer-inn>",	ИННОрганизацииГруппы);
	ПараметрыЗапросаДанныхМЧД.Параметры.Вставить("<subscriber-id>",	ИдентификаторАбонентаОрганизации);
	Интеграция = ПолучитьИнтеграциюНаСервере(ВерсияНастроекОбработки);
	
	СтруктураДанныхФЛ = ПолучитьИННФЛ(Интеграция.ПараметрыАвторизацииИПодписания[ОрганизацияГруппы].ПараметрыПодписания.Субъект);
	ИННДоверенногоЛица = СтруктураДанныхФЛ.ИННФЛ;
	ПараметрыЗапросаДанныхМЧД.Параметры.Вставить("<&attorney-inn>", ИННДоверенногоЛица);
		
	РезультатЗапросаДанныхМЧД = ВыполнитьЗапросAPI("API_ПолучитьИнформациюПоМЧД", ПараметрыЗапросаДанныхМЧД, ПорядковыйНомерГруппы);
		
	Если РезультатЗапросаДанныхМЧД.Ошибка = Истина Тогда
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Не удалось определить дату выдачи МЧД от организации "+ОрганизацияГруппы+" для подписи физического лица."
		+Символы.ПС+"Указанный номер доверенности: "+GUIDДоверенностиГруппы+".";
		Сообщение.Сообщить();
		ЭтаФорма["ДатаНачалаДействияМЧД"+ПорядковыйНомерГруппы] = "";
		Возврат;
	КонецЕсли;
	ДатаВыдачиДоверенности = РезультатЗапросаДанныхМЧД.Результат.content.документ.довер.свДов.датаВыдДовер;
	
	ЭтаФорма["ДатаНачалаДействияМЧД"+ПорядковыйНомерГруппы] = ДатаВыдачиДоверенности;
	
	ОбновитьПараметрыАвторизации(ПорядковыйНомерГруппы);
	
КонецПроцедуры

Функция ПолучитьИННФЛ(СтруктураСубъекта);
	
	СтруктураВозврата = Новый Структура;
	СтруктураВозврата.Вставить("ИННФЛ", "");
	
	Если СтруктураСубъекта.Свойство("OID1_2_643_3_131_1_1") тогда
		СтруктураВозврата.ИННФЛ = СтруктураСубъекта.OID1_2_643_3_131_1_1;
	КонецЕсли;
	
	Возврат СтруктураВозврата;
	
КонецФункции

&НаКлиенте
Процедура ДолжностьФизлицаПриИзменении(Элемент)
	
	ПорядковыйНомерГруппы = Число(Прав(Элемент.Имя, СтрДлина(Элемент.Имя) - СтрДлина("ДолжностьФизлица")));
	
	ОбновитьПараметрыАвторизации(ПорядковыйНомерГруппы);
	
КонецПроцедуры

&НаКлиенте
Процедура AccessТокенВСпискеПриИзменении(Элемент)
	
	ПорядковыйНомерГруппы = Число(Прав(Элемент.Имя, СтрДлина(Элемент.Имя) - СтрДлина("AccessTokenОрганизации")));
	
	ОбновитьПараметрыАвторизации(ПорядковыйНомерГруппы);
	
КонецПроцедуры

&НаКлиенте
Процедура RefreshТокенВСпискеПриИзменении(Элемент)
	
	ПорядковыйНомерГруппы = Число(Прав(Элемент.Имя, СтрДлина(Элемент.Имя) - СтрДлина("RefreshTokenОрганизации")));
	
	ОбновитьПараметрыАвторизации(ПорядковыйНомерГруппы);
	
КонецПроцедуры

&НаКлиенте
Процедура ПарольДоступаКЗакрытомуКлючуВСпискеПриИзменении(Элемент)
	
	ПорядковыйНомерГруппы = Число(Прав(Элемент.Имя, СтрДлина(Элемент.Имя) - СтрДлина("ПарольДоступаКЗакрытомуКлючу")));
	
	ОбновитьПараметрыАвторизации(ПорядковыйНомерГруппы);
	
КонецПроцедуры

&НаКлиенте
Процедура АвторизацияПоСертификатуВСпискеПриИзменении(Элемент)
		
	ОбновитьВидимостьЭлементовФормы();	
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьПараметрыАвторизации(ПорядковыйНомерГруппы = Неопределено)
	
	Если НЕ ПорядковыйНомерГруппы = Неопределено Тогда 
		
		ИспользоватьПодписание = ЭтаФорма["ПриРаботеСОрганизациейИспользуетсяПодписание"+ПорядковыйНомерГруппы];
		
		Если ИспользоватьПодписание Тогда
			Менеджер = ПолучитьМенеджерКриптографии(); 
		КонецЕсли;
		
		Организация = ЭтаФорма["Авторизация_Организация"+ПорядковыйНомерГруппы];
		
		ПараметрыАвторизацииИПодписанияОрганизации = Новый Структура;	
		ПараметрыАвторизацииИПодписанияОрганизации.Вставить("AccessToken", ЭтаФорма["Авторизация_AccessTokenОрганизации"+ПорядковыйНомерГруппы]);
		ПараметрыАвторизацииИПодписанияОрганизации.Вставить("RefreshToken", ЭтаФорма["Авторизация_RefreshTokenОрганизации"+ПорядковыйНомерГруппы]);
		ПараметрыАвторизацииИПодписанияОрганизации.Вставить("ИспользуетсяПодписание", ЭтаФорма["ПриРаботеСОрганизациейИспользуетсяПодписание"+ПорядковыйНомерГруппы]);
		
		ПараметрыПодписания = Новый Структура;
		
		
		Если ИспользоватьПодписание И НЕ ЭтаФорма["ОтпечатокСертификатаОрганизацииBase64"+ПорядковыйНомерГруппы] = "" Тогда  
			
			ПараметрыПодписания.Вставить("ОтпечатокСертификатаBase64", ЭтаФорма["ОтпечатокСертификатаОрганизацииBase64"+ПорядковыйНомерГруппы]);
			ПараметрыПодписания.Вставить("ПарольДоступаКЗакрытомуКлючу", ЭтаФорма["ПарольДоступаКЗакрытомуКлючу"+ПорядковыйНомерГруппы]);
			Сертификат  = ПолучитьЭЦППоОтпечатку(Менеджер, Base64Значение(Этаформа["ОтпечатокСертификатаОрганизацииBase64"+ПорядковыйНомерГруппы]));
			
			Если НЕ Сертификат = Неопределено Тогда
				
				ПараметрыПодписания.Вставить("Субъект", Сертификат.Субъект);
				
				ЭтоСертификатЮЛ = Ложь;
				ЭтоСертификатИП = Ложь;
				ЭтоСертификатФЛ = Ложь;
				
				Сертификат_ИНН = "";
				
				Если Сертификат.Субъект.Свойство("OID1_2_643_100_4") Тогда
					Сертификат_ИНН = Сертификат.Субъект.OID1_2_643_100_4;
				ИначеЕсли Сертификат.Субъект.Свойство("OID1_2_643_3_131_1_1") Тогда
					Сертификат_ИНН = Сертификат.Субъект.OID1_2_643_3_131_1_1;
				ИначеЕсли Сертификат.Субъект.Свойство("INNLE") Тогда
					Сертификат_ИНН = Сертификат.Субъект.INNLE;
				ИначеЕсли Сертификат.Субъект.Свойство("ИННЮЛ") Тогда
					Сертификат_ИНН = Сертификат.Субъект.ИННЮЛ;
				ИначеЕсли Сертификат.Субъект.Свойство("ИНН_ЮЛ") Тогда
					Сертификат_ИНН = Сертификат.Субъект.ИНН_ЮЛ;
				ИначеЕсли Сертификат.Субъект.Свойство("ИНН") Тогда
					Сертификат_ИНН = Сертификат.Субъект.ИНН;
				ИначеЕсли Сертификат.Субъект.Свойство("ИННОрганизации") Тогда
					Сертификат_ИНН = Сертификат.Субъект.ИННОрганизации;
				ИначеЕсли Сертификат.Субъект.Свойство("ИНН_Организации") Тогда
					Сертификат_ИНН = Сертификат.Субъект.ИНН_Организации;	
				КонецЕсли;
				
				СубъектСодержитОГРНИП = Ложь;
				
				Если Сертификат.Субъект.Свойство("OID1_2_643_100_5") Тогда
					СубъектСодержитОГРНИП = Истина;
				ИначеЕсли Сертификат.Субъект.Свойство("OID_1_2_643_100_1") Тогда
					СубъектСодержитОГРНИП = Истина;	
				ИначеЕсли Сертификат.Субъект.Свойство("ОГРН") Тогда
					СубъектСодержитОГРНИП = Истина;
				ИначеЕсли Сертификат.Субъект.Свойство("ОГРНИП") Тогда
					СубъектСодержитОГРНИП = Истина;	
				ИначеЕсли Сертификат.Субъект.Свойство("OGRN") Тогда
					СубъектСодержитОГРНИП = Истина;
				ИначеЕсли Сертификат.Субъект.Свойство("OGRNIP") Тогда
					СубъектСодержитОГРНИП = Истина;	
				КонецЕсли;
				
				Если СтрДлина(Сертификат_ИНН) = 12 И Лев(Сертификат_ИНН, 2) = "00" Тогда
					Сертификат_ИНН = Прав(Сертификат_ИНН, 10);	
				КонецЕсли;
				
				Если СтрНайти(Сертификат_ИНН, ЭтаФорма["ИНН_Организации"+ПорядковыйНомерГруппы])>0 Тогда
					// Это сертификат ЮЛ или ИП.
					Если СтрДлина(ЭтаФорма["ИНН_Организации"+ПорядковыйНомерГруппы]) = 10 Тогда
						// Если ИНН 10 символов - ЮЛ.
						ЭтоСертификатЮЛ = Истина;
					ИначеЕсли СтрДлина(Сертификат_ИНН) = 12 И СубъектСодержитОГРНИП Тогда	
						// Если ИНН 12 символов и есть ОГРН ИП, то сертификат ИП.
						ЭтоСертификатИП = Истина;
					КонецЕсли;	
				Иначе
					// Если в структуре субъекта нет ОГРН ИП, это сертификат ФЛ.
					Если СтрДлина(Сертификат_ИНН) = 12 И НЕ Лев(Сертификат_ИНН, 2) = "00" И НЕ СубъектСодержитОГРНИП Тогда
						ЭтоСертификатФЛ = Истина;
					ИначеЕсли СтрДлина(Сертификат_ИНН) = 12 И НЕ Лев(Сертификат_ИНН, 2) = "00" И СубъектСодержитОГРНИП Тогда
						// Если ИНН 12 символов и есть ОГРН ИП, то сертификат ИП.
						// Даже если ИП сам по себе не является "организацией-продавцом".
						ЭтоСертификатИП = Истина;	
					КонецЕсли;
				КонецЕсли;	
				
				Если ЭтоСертификатЮЛ Тогда
					ПараметрыПодписания.Вставить("ТипСубъекта", "ЮЛ");
				ИначеЕсли ЭтоСертификатИП Тогда                       
					ПараметрыПодписания.Вставить("ТипСубъекта", "ИП");
				ИначеЕсли ЭтоСертификатФЛ Тогда                       
					ПараметрыПодписания.Вставить("ТипСубъекта", "ФЛ");
				КонецЕсли;	
				
				Если ЭтоСертификатФЛ Тогда 
					ПараметрыПодписания.Вставить("МчдGUID", ЭтаФорма["GUIDДоверенности"+ПорядковыйНомерГруппы]);
					ПараметрыПодписания.Вставить("ДатаНачалаДействияМЧД", ЭтаФорма["ДатаНачалаДействияМЧД"+ПорядковыйНомерГруппы]);
					ПараметрыПодписания.Вставить("ДолжностьФизлица", ЭтаФорма["ДолжностьФизлица"+ПорядковыйНомерГруппы]);
				Иначе	                                                                                        
					ПараметрыПодписания.Вставить("МчдGUID", Неопределено);
					ПараметрыПодписания.Вставить("ДатаНачалаДействияМЧД", Неопределено);
					ПараметрыПодписания.Вставить("ДолжностьФизлица", Неопределено);
				КонецЕсли;	
				
			КонецЕсли;
			
		КонецЕсли;
		
		
		ПараметрыАвторизацииИПодписанияОрганизации.Вставить("ПараметрыПодписания", ПараметрыПодписания);
		
		ОбновитьПараметрыАвторизацииИПодписанияОрганизации(Организация, ПараметрыАвторизацииИПодписанияОрганизации);		
		
	Иначе	
		
		Счетчик = 1;	
		Пока НЕ Счетчик = ОбработаноОрганизаций Цикл
			
			ИспользоватьПодписание = ЭтаФорма["ПриРаботеСОрганизациейИспользуетсяПодписание"+Счетчик];
			
			Если ИспользоватьПодписание Тогда
				Менеджер = ПолучитьМенеджерКриптографии();
			Иначе
				Менеджер = Неопределено;
			КонецЕсли;
			
			Организация = ЭтаФорма["Авторизация_Организация"+Счетчик];
			
			ПараметрыАвторизацииИПодписанияОрганизации = Новый Структура;	
			ПараметрыАвторизацииИПодписанияОрганизации.Вставить("AccessToken", ЭтаФорма["Авторизация_AccessTokenОрганизации"+Счетчик]);
			ПараметрыАвторизацииИПодписанияОрганизации.Вставить("RefreshToken", ЭтаФорма["Авторизация_RefreshTokenОрганизации"+Счетчик]);
			ПараметрыАвторизацииИПодписанияОрганизации.Вставить("ИспользуетсяПодписание", ЭтаФорма["ПриРаботеСОрганизациейИспользуетсяПодписание"+Счетчик]);
			
			ПараметрыПодписания = Новый Структура;
			
			
			Если ИспользоватьПодписание И НЕ ЭтаФорма["ОтпечатокСертификатаОрганизацииBase64"+Счетчик] = "" Тогда  
				
				ПараметрыПодписания.Вставить("ОтпечатокСертификатаBase64", ЭтаФорма["ОтпечатокСертификатаОрганизацииBase64"+Счетчик]);
				ПараметрыПодписания.Вставить("ПарольДоступаКЗакрытомуКлючу", ЭтаФорма["ПарольДоступаКЗакрытомуКлючу"+Счетчик]);
				Сертификат  = ПолучитьЭЦППоОтпечатку(Менеджер, Base64Значение(Этаформа["ОтпечатокСертификатаОрганизацииBase64"+Счетчик]));
				
				Если НЕ Сертификат = Неопределено Тогда 
					
					ПараметрыПодписания.Вставить("Субъект", Сертификат.Субъект);  
					
					ЭтоСертификатЮЛ = Ложь;
					ЭтоСертификатИП = Ложь;
					ЭтоСертификатФЛ = Ложь;
					
					Сертификат_ИНН = "";
					
					Если Сертификат.Субъект.Свойство("OID1_2_643_100_4") Тогда
						Сертификат_ИНН = Сертификат.Субъект.OID1_2_643_100_4;
					ИначеЕсли Сертификат.Субъект.Свойство("OID1_2_643_3_131_1_1") Тогда
						Сертификат_ИНН = Сертификат.Субъект.OID1_2_643_3_131_1_1;
					ИначеЕсли Сертификат.Субъект.Свойство("INNLE") Тогда
						Сертификат_ИНН = Сертификат.Субъект.INNLE;
					ИначеЕсли Сертификат.Субъект.Свойство("ИННЮЛ") Тогда
						Сертификат_ИНН = Сертификат.Субъект.ИННЮЛ;
					ИначеЕсли Сертификат.Субъект.Свойство("ИНН_ЮЛ") Тогда
						Сертификат_ИНН = Сертификат.Субъект.ИНН_ЮЛ;
					ИначеЕсли Сертификат.Субъект.Свойство("ИНН") Тогда
						Сертификат_ИНН = Сертификат.Субъект.ИНН;
					ИначеЕсли Сертификат.Субъект.Свойство("ИННОрганизации") Тогда
						Сертификат_ИНН = Сертификат.Субъект.ИННОрганизации;
					ИначеЕсли Сертификат.Субъект.Свойство("ИНН_Организации") Тогда
						Сертификат_ИНН = Сертификат.Субъект.ИНН_Организации;	
					КонецЕсли;
					
					СубъектСодержитОГРНИП = Ложь;
					
					Если Сертификат.Субъект.Свойство("OID1_2_643_100_5") Тогда
						СубъектСодержитОГРНИП = Истина;
					ИначеЕсли Сертификат.Субъект.Свойство("OID_1_2_643_100_1") Тогда
						СубъектСодержитОГРНИП = Истина;	
					ИначеЕсли Сертификат.Субъект.Свойство("ОГРН") Тогда
						СубъектСодержитОГРНИП = Истина;
					ИначеЕсли Сертификат.Субъект.Свойство("ОГРНИП") Тогда
						СубъектСодержитОГРНИП = Истина;	
					ИначеЕсли Сертификат.Субъект.Свойство("OGRN") Тогда
						СубъектСодержитОГРНИП = Истина;
					ИначеЕсли Сертификат.Субъект.Свойство("OGRNIP") Тогда
						СубъектСодержитОГРНИП = Истина;	
					КонецЕсли;
					
					Если СтрДлина(Сертификат_ИНН) = 12 И Лев(Сертификат_ИНН, 2) = "00" Тогда
						Сертификат_ИНН = Прав(Сертификат_ИНН, 10);	
					КонецЕсли;
					
					Если СтрНайти(Сертификат_ИНН, ЭтаФорма["ИНН_Организации"+Счетчик])>0 Тогда
						// Это сертификат ЮЛ или ИП.
						Если СтрДлина(ЭтаФорма["ИНН_Организации"+ПорядковыйНомерГруппы]) = 10 Тогда
							// Если ИНН 10 символов - ЮЛ.
							ЭтоСертификатЮЛ = Истина;
						ИначеЕсли СтрДлина(Сертификат_ИНН) = 12 И СубъектСодержитОГРНИП Тогда	
							// Если ИНН 12 символов и есть ОГРН ИП, то сертификат ИП.
							ЭтоСертификатИП = Истина;
						КонецЕсли;	
					Иначе
						// Если в структуре субъекта нет ОГРН ИП, это сертификат ФЛ.
						Если СтрДлина(Сертификат_ИНН) = 12 И НЕ Лев(Сертификат_ИНН, 2) = "00" И НЕ СубъектСодержитОГРНИП Тогда
							ЭтоСертификатФЛ = Истина;
						ИначеЕсли СтрДлина(Сертификат_ИНН) = 12 И НЕ Лев(Сертификат_ИНН, 2) = "00" И СубъектСодержитОГРНИП Тогда
							// Если ИНН 12 символов и есть ОГРН ИП, то сертификат ИП.
							// Даже если ИП сам по себе не является "организацией-продавцом".
							ЭтоСертификатИП = Истина;	
						КонецЕсли;
					КонецЕсли;
					
					Если ЭтоСертификатЮЛ Тогда
						ПараметрыПодписания.Вставить("ТипСубъекта", "ЮЛ");
					ИначеЕсли ЭтоСертификатИП Тогда                       
						ПараметрыПодписания.Вставить("ТипСубъекта", "ИП");
					ИначеЕсли ЭтоСертификатФЛ Тогда                       
						ПараметрыПодписания.Вставить("ТипСубъекта", "ФЛ");
					КонецЕсли;	
					
					Если ЭтоСертификатФЛ Тогда 
						ПараметрыПодписания.Вставить("МчдGUID", ЭтаФорма["GUIDДоверенности"+Счетчик]);
						ПараметрыПодписания.Вставить("ДатаНачалаДействияМЧД", ЭтаФорма["ДатаНачалаДействияМЧД"+Счетчик]);
						ПараметрыПодписания.Вставить("ДолжностьФизлица", ЭтаФорма["ДолжностьФизлица"+Счетчик]);
					Иначе	                                                                                        
						ПараметрыПодписания.Вставить("МчдGUID", Неопределено);
						ПараметрыПодписания.Вставить("ДатаНачалаДействияМЧД", Неопределено);
						ПараметрыПодписания.Вставить("ДолжностьФизлица", Неопределено);
					КонецЕсли;
					
				КонецЕсли; 
				
			КонецЕсли;
			
			
			ПараметрыАвторизацииИПодписанияОрганизации.Вставить("ПараметрыПодписания", ПараметрыПодписания);
			
			ОбновитьПараметрыАвторизацииИПодписанияОрганизации(Организация, ПараметрыАвторизацииИПодписанияОрганизации);
			
			Счетчик = Счетчик+1;
			
		КонецЦикла;	
		
	КонецЕсли;	
	
КонецПроцедуры  

&НаКлиенте
Процедура ОбновитьПараметрыАвторизацииИПодписанияОрганизации(Организация, ПараметрыАвторизацииИПодписанияОрганизации)
	
	Интеграция = ПолучитьИнтеграциюНаСервере(ВерсияНастроекОбработки);
	
	Если НЕ Интеграция.Свойство("ПараметрыАвторизацииИПодписания") Тогда
		Интеграция.Вставить("ПараметрыАвторизацииИПодписания", Новый Соответствие);
	КонецЕсли;
	
	Интеграция.ПараметрыАвторизацииИПодписания.Вставить(Организация, ПараметрыАвторизацииИПодписанияОрганизации);	
	
	СохранитьИнтеграциюНаСервере(Интеграция);
	
КонецПроцедуры	

#КонецОбласти

#Область ИнтеграцияAPI

&НаКлиенте
Функция ПолучитьЗаголовки()
	
	Заголовки = Новый Соответствие;
	//Заголовки.Вставить("accept", "application/json;charset=UTF-8");
	Заголовки.Вставить("accept", "*/*");
	
	Возврат Заголовки;
	
КонецФункции

&НаКлиенте
Функция ПолучитьСоединение_Устаревшее() // Удалить
	
	СертификатКлиентаWin 	= Новый СертификатКлиентаWindows(СпособВыбораСертификатаWindows.Выбирать);
	СертификатУЦWin 		= Неопределено; //Новый СертификатыУдостоверяющихЦентровWindows();
	
	ssl = Новый ЗащищенноеСоединениеOpenSSL(СертификатКлиентаWin, СертификатУЦWin); 		
	
	Если Объект.ЭтоТестоваяОбработка Тогда		
		// Тест
		Соединение  =  Новый HTTPСоединение("edo-test.platformaofd.ru", //сервер
		443, 	//порт
		,		//логин
		,		//пароль
		,		//прокси
		20,		//таймаут
		ssl,);	//защищенное HTTPS соединение 			
	Иначе	
		// Бой
		Соединение  =  Новый HTTPСоединение("edo.platformaofd.ru", //сервер
		443,	//порт
		,		//логин
		,		//пароль
		,		//прокси
		20,		//таймаут
		ssl,);	//защищенное HTTPS соединение
	КонецЕсли;
	
	Возврат Соединение;
	
КонецФункции

&НаКлиенте
Функция ПолучитьСоединение()
	
	СертификатКлиентаWin 	= Новый СертификатКлиентаWindows(СпособВыбораСертификатаWindows.Выбирать);
	СертификатУЦWin 		= Неопределено; //Новый СертификатыУдостоверяющихЦентровWindows();
	
	ssl = Новый ЗащищенноеСоединениеOpenSSL(СертификатКлиентаWin, СертификатУЦWin); 		
	
	Если Объект.ЭтоТестоваяОбработка Тогда		
		// Тест
		Соединение  =  Новый HTTPСоединение("api-test.platformaofd.ru", //сервер
		443, 	//порт
		,		//логин
		,		//пароль
		,		//прокси
		20,		//таймаут
		ssl,);	//защищенное HTTPS соединение 			
	Иначе	
		// Бой
		Соединение  =  Новый HTTPСоединение("api.platformaofd.ru", //сервер
		443,	//порт
		,		//логин
		,		//пароль
		,		//прокси
		20,		//таймаут
		ssl,);	//защищенное HTTPS соединение
	КонецЕсли;
	
	Возврат Соединение;
	
КонецФункции

// Функция подготавливает шаблон параметров запроса
&НаКлиенте
Функция ПолучитьШаблонПараметровЗапроса() Экспорт
	
	Структура = Новый Структура;
	
	Структура.Вставить("Соединение", 	ПолучитьСоединение());
	Структура.Вставить("Заголовки", 	ПолучитьЗаголовки());
	Структура.Вставить("Параметры", 	Новый Соответствие);
	
	Возврат Структура;
	
КонецФункции

// Функция заполняет параметры запроса в строке запроса
&НаКлиенте
Функция ЗаполнитьПараметрыВЗапросе(СтрокаЗапроса, Параметры) Экспорт
	
	Для Каждого Параметр из Параметры Цикл
		
		СтрокаЗапроса = СтрЗаменить(СтрокаЗапроса, Параметр.Ключ, Параметр.Значение);
		
	КонецЦикла;	
	
	Возврат СтрокаЗапроса;
	
КонецФункции

// Функция подготавливает шаблон структуры ответа
&НаКлиенте
Функция ПолучитьШаблонСтруктурыОтвета()
	
	Структура = Новый Структура();
	
	Структура.Вставить("Результат", 	Неопределено);
	Структура.Вставить("Ошибка", 		Ложь);
	Структура.Вставить("Описание", 		""); 
	Структура.Вставить("КодСостояния",	"");
	
	Возврат Структура;
	
КонецФункции // ПолучитьШаблонСтруктурыОтвета()

// Функция обрабатывает ответ запроса по коду состояния
&НаКлиенте
Функция ОбработатьОтвет(Ответ, СтруктураОтвета, ЭтоФайл = Ложь) Экспорт 
	
	СтруктураОтвета.КодСостояния = Ответ.КодСостояния;
	ОтветОбработан = Ложь;
	Тело = Ответ.ПолучитьТелоКакСтроку();	
	
	ТекущаяДата = Строка(ТекущаяДата());
	
	Если СтруктураОтвета.КодСостояния = 200 Тогда
		
		Если Тело = "[]" или Тело = "" Тогда
			СтруктураОтвета.Описание 		= ТекущаяДата + " Пустой ответ.";
		Иначе 
			Если НЕ ЭтоФайл Тогда
				ЧтениеJSON = Новый ЧтениеJSON();
				ЧтениеJSON.УстановитьСтроку(Тело);
				СтруктураОтвета.Результат = ПрочитатьJSON(ЧтениеJSON);			
				ЧтениеJSON.Закрыть(); 
			Иначе
				ДвоичныеДанныеФайла = Ответ.ПолучитьТелоКакДвоичныеДанные();
				СтруктураОтвета.Результат = ДвоичныеДанныеФайла;
				СтруктураОтвета.Вставить("Тип", Ответ.Заголовки.Получить("Content-Type"));
			КонецЕсли;	
		КонецЕсли;
		
		Возврат СтруктураОтвета;
		
	КонецЕсли;
	
	
	Если СтруктураОтвета.КодСостояния = 201 Тогда 
		
		Если Тело = "[]" Тогда
			СтруктураОтвета.Описание 		= ТекущаяДата + " Вроде норм, но че-то непонятно.";
			СтруктураОтвета.КодСостояния 	= 0;
		Иначе 
			ЧтениеJSON = Новый ЧтениеJSON();
			ЧтениеJSON.УстановитьСтроку(Тело);
			СтруктураОтвета.Результат = ПрочитатьJSON(ЧтениеJSON);			
			ЧтениеJSON.Закрыть();  
		КонецЕсли;
		
		Возврат СтруктураОтвета;	
		
	КонецЕсли;
	
	
	Если СтруктураОтвета.КодСостояния = 400 Тогда
		СтруктураОтвета.Ошибка 		= Истина;
		СтруктураОтвета.Описание 	= ТекущаяДата + " Error 400. Ошибка выгружаемых данных." + ?(ЗначениеЗаполнено(Тело), " ("+Тело+")", ""); 	
		Возврат СтруктураОтвета; 	
	КонецЕсли;
	
	Если СтруктураОтвета.КодСостояния = 401 Тогда
		СтруктураОтвета.Ошибка 		= Истина;
		СтруктураОтвета.Описание 	= ТекущаяДата + " Error 401. Ошибка авторизации. Проверье авторизацию в разделе настройки и повторите запрос позднее." + ?(ЗначениеЗаполнено(Тело), " ("+Тело+")", "");		
		Возврат СтруктураОтвета;	
	КонецЕсли;	
	
	Если СтруктураОтвета.КодСостояния = 403 Тогда
		СтруктураОтвета.Ошибка 		= Истина;
		СтруктураОтвета.Описание 	= ТекущаяДата +" Error 403." + ?(ЗначениеЗаполнено(Тело), " ("+Тело+")", "");	
		Возврат СтруктураОтвета; 
	КонецЕсли; 	
	
	Если СтруктураОтвета.КодСостояния = 404 Тогда
		СтруктураОтвета.Ошибка 		= Истина;
		СтруктураОтвета.Описание 	= ТекущаяДата +" Error 404." + ?(ЗначениеЗаполнено(Тело), " ("+Тело+")", "");		
		Возврат СтруктураОтвета;		
	КонецЕсли;
	
	Если СтруктураОтвета.КодСостояния = 500 Тогда
		СтруктураОтвета.Ошибка 		= Истина;
		СтруктураОтвета.Описание 	= ТекущаяДата +" Error 500. Сервис недоступен. Повторите запрос позднее." + ?(ЗначениеЗаполнено(Тело), " ("+Тело+")", ""); 		
		Возврат СтруктураОтвета; 		
	КонецЕсли;
	
	Если СтруктураОтвета.КодСостояния = 204 Тогда
		СтруктураОтвета.Ошибка 		= Ложь;
		СтруктураОтвета.Описание 	= ТекущаяДата +" Успешно."; 		
		Возврат СтруктураОтвета; 		
	КонецЕсли;
	
	СтруктураОтвета.Ошибка 		= Истина;
	СтруктураОтвета.Описание 	= ТекущаяДата + " Error " + СтруктураОтвета.КодСостояния + ". Неизвестная ошибка сервиса." + ?(ЗначениеЗаполнено(Тело), " ("+Тело+")", "");      			
	Возврат СтруктураОтвета;
	
КонецФункции

// security/.../oauth/token
&НаКлиенте
Функция API_ПолучитьТокенАвторизацииПоСертификату(Знач ПараметрыЗапроса) Экспорт
	
	ЗаголовкиЗапроса = Новый Соответствие;
	ЗаголовкиЗапроса.Вставить("Content-Type", "application/x-www-form-urlencoded");
	ЗаголовкиЗапроса.Вставить("x-client-id", ПараметрыЗапроса.Параметры.Получить("ИдентификаторКлиента"));
	ЗаголовкиЗапроса.Вставить("Content-Encoding", "utf-8");
	ПараметрыЗапроса.Заголовки = ЗаголовкиЗапроса;
	
	СтрокаЗапроса = "/edm-security/public/api/v3/oauth/token";
	
	СтруктураОтвета = ПолучитьШаблонСтруктурыОтвета();
	
	Запрос = Новый HTTPЗапрос(СтрокаЗапроса, ПараметрыЗапроса.Заголовки); 
	Запрос.УстановитьТелоИзСтроки(ПараметрыЗапроса.Параметры["<Тело>"], КодировкаТекста.UTF8, ИспользованиеByteOrderMark.НеИспользовать);
	
	Ответ = ПараметрыЗапроса.Соединение.ВызватьHTTPМетод("POST", Запрос);
	СтруктураОтвета = ОбработатьОтвет(Ответ, СтруктураОтвета);
	
	Возврат СтруктураОтвета;
	
КонецФункции

&НаКлиенте
Функция ВыполнитьЗапросAPI(ИмяФункцииЗапроса, ВходящиеПараметрыЗапроса, ПорядковыйНомерГруппы) Экспорт
	
	РезультатЗапроса = ПолучитьШаблонСтруктурыОтвета();
	РезультатЗапроса.Ошибка = Истина;
	
	ПараметрыЗапроса = СкопироватьКоллекцию(ВходящиеПараметрыЗапроса);
	
	ПараметрыЗапроса.Заголовки.Вставить("Authorization", "Bearer "+ ЭтаФорма["Авторизация_AccessTokenОрганизации"+ПорядковыйНомерГруппы]);
	
	Выполнить("РезультатЗапроса = "+ИмяФункцииЗапроса+"(ПараметрыЗапроса);");
	
	Если РезультатЗапроса.КодСостояния = 401 ИЛИ РезультатЗапроса.КодСостояния = 500 Тогда
		
		// Ошибка авторизации.
		// Попытка обновить токен по сертификату.
		Если ЭтаФорма["ПриРаботеСОрганизациейИспользуетсяПодписание"+ПорядковыйНомерГруппы] = Истина И НЕ ЗначениеЗаполнено(ЭтаФорма["Авторизация_RefreshTokenОрганизации"+ПорядковыйНомерГруппы]) Тогда
			
			Если ПараметрыЗапроса.Свойство("Заголовки") И НЕ ПараметрыЗапроса.Заголовки.Получить("Authorization") = Неопределено Тогда	
				НовыйТокен = ПолучитьТокенПоОтпечаткуСертификата(Base64Значение(ЭтаФорма["ОтпечатокСертификатаОрганизацииBase64"+ПорядковыйНомерГруппы]), ЭтаФорма["ПарольДоступаКЗакрытомуКлючу"+ПорядковыйНомерГруппы]);
				Если НЕ НовыйТокен = Неопределено Тогда
					ПараметрыЗапроса = СкопироватьКоллекцию(ВходящиеПараметрыЗапроса);
					ПараметрыЗапроса.Заголовки.Вставить("Authorization", "Bearer "+ НовыйТокен);
					Выполнить("РезультатЗапроса = "+ИмяФункцииЗапроса+"(ПараметрыЗапроса);");
					Если РезультатЗапроса.КодСостояния = 200 Тогда
						ЭтаФорма["Авторизация_AccessTokenОрганизации"+ПорядковыйНомерГруппы] = НовыйТокен;
						ЭтаФорма["Авторизация_RefreshTokenОрганизации"+ПорядковыйНомерГруппы] = "";
						ОбновитьПараметрыАвторизации(ПорядковыйНомерГруппы);
					КонецЕсли;	
				КонецЕсли;	
			КонецЕсли;
			
		ИначеЕсли ЗначениеЗаполнено(ЭтаФорма["Авторизация_AccessTokenОрганизации"+ПорядковыйНомерГруппы]) И ЗначениеЗаполнено(ЭтаФорма["Авторизация_RefreshTokenОрганизации"+ПорядковыйНомерГруппы]) Тогда 	
			
			Если ПараметрыЗапроса.Свойство("Заголовки") И НЕ ПараметрыЗапроса.Заголовки.Получить("Authorization") = Неопределено Тогда
				RefreshToken = ЭтаФорма["Авторизация_RefreshTokenОрганизации"+ПорядковыйНомерГруппы];
				FreshTokens = RefreshTokens(RefreshToken);
				Если НЕ FreshTokens = Неопределено Тогда
					НовыйAccessToken = FreshTokens.access_token;
					НовыйRefreshToken = FreshTokens.refresh_token;
					ЭтаФорма["Авторизация_AccessTokenОрганизации"+ПорядковыйНомерГруппы] = НовыйAccessToken;
					ЭтаФорма["Авторизация_RefreshTokenОрганизации"+ПорядковыйНомерГруппы] = НовыйRefreshToken;
					ОбновитьПараметрыАвторизации(ПорядковыйНомерГруппы);
					Выполнить("РезультатЗапроса = "+ИмяФункцииЗапроса+"(ПараметрыЗапроса);");
				КонецЕсли;
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли;	
	
	Возврат РезультатЗапроса;
	
КонецФункции

&НаКлиенте
Функция API_ИнформацияОбАбоненте(Знач ПараметрыЗапроса) Экспорт
	
	СтрокаЗапроса = "/edm-subscriber/public/api/v3/subscribers";
	
	Счетчик = 1;
	Для Каждого ПараметрЗапроса из ПараметрыЗапроса.Параметры Цикл
		Если НЕ СтрНайти(СтрокаЗапроса, ПараметрЗапроса.Ключ) = 0 Тогда
			Продолжить;
		КонецЕсли;
		Если НЕ ПараметрЗапроса.Значение = Неопределено И НЕ ПараметрЗапроса.Значение = Null И НЕ ПараметрЗапроса.Значение = "null" И НЕ ПараметрЗапроса.Значение = "Null" Тогда
			СтрокаЗапроса = СтрокаЗапроса + ?(Счетчик = 1, "?", ?(Счетчик = ПараметрыЗапроса.Количество(), "", "&")) + СтрЗаменить(СтрЗаменить(ПараметрЗапроса.Ключ, ">", ""), "<", "") + "=" +ПараметрЗапроса.Ключ;
		КонецЕсли;	
		Счетчик = Счетчик+1;
	КонецЦикла;
	
	СтрокаЗапроса = ЗаполнитьПараметрыВЗапросе(СтрокаЗапроса, ПараметрыЗапроса.Параметры);
	
	СтруктураОтвета = ПолучитьШаблонСтруктурыОтвета();
	
	Запрос = Новый HTTPЗапрос(СтрокаЗапроса, ПараметрыЗапроса.Заголовки);    	
	
	Ответ = ПараметрыЗапроса.Соединение.Получить(Запрос);
	СтруктураОтвета = ОбработатьОтвет(Ответ, СтруктураОтвета);
	
	Возврат СтруктураОтвета;     
	
КонецФункции

&НаКлиенте
Функция API_ПолучитьИнформациюПоМЧД(Знач ПараметрыЗапроса) Экспорт
	
	ПараметрыЗапроса.Соединение = ПолучитьСоединение();
	
	//СтрокаЗапроса = "public/api/v2/epoa/node/<МчдGUID>";
	СтрокаЗапроса = "epoa-service/public/api/v2/epoa/node/<МчдGUID>";
	
	Счетчик = 1;
	Для Каждого ПараметрЗапроса из ПараметрыЗапроса.Параметры Цикл
		Если НЕ СтрНайти(СтрокаЗапроса, ПараметрЗапроса.Ключ) = 0 Тогда
			Продолжить;
		КонецЕсли;	
		Если НЕ ПараметрЗапроса.Значение = Неопределено И НЕ ПараметрЗапроса.Значение = Null И НЕ ПараметрЗапроса.Значение = "null" И НЕ ПараметрЗапроса.Значение = "Null" Тогда
			СтрокаЗапроса = СтрокаЗапроса + ?(Счетчик = 1, "?", ?(Счетчик = ПараметрыЗапроса.Количество(), "", "&")) + СтрЗаменить(СтрЗаменить(ПараметрЗапроса.Ключ, ">", ""), "<", "") + "=" +ПараметрЗапроса.Ключ;
		КонецЕсли;	
		Счетчик = Счетчик+1;
	КонецЦикла;
	
	СтрокаЗапроса = ЗаполнитьПараметрыВЗапросе(СтрокаЗапроса, ПараметрыЗапроса.Параметры);
	
	СтруктураОтвета = ПолучитьШаблонСтруктурыОтвета();
	
	Запрос = Новый HTTPЗапрос(СтрокаЗапроса, ПараметрыЗапроса.Заголовки);    	
	
	Ответ = ПараметрыЗапроса.Соединение.Получить(Запрос);
	СтруктураОтвета = ОбработатьОтвет(Ответ, СтруктураОтвета);
	
	Возврат СтруктураОтвета;
	
КонецФункции

#КонецОбласти

#Область KeycloakВзаимодействие

&НаКлиенте
Функция RefreshTokens(RefreshToken)
	
	scope = "openid+groups+organization%3Aorg+upid+organization%3Aorg.write+profile+email";
	
	СтрокаПараметров = "grant_type=refresh_token&client_id=1c-sso&refresh_token="+RefreshToken+"&scope="+scope;
		
	headers = Новый Соответствие;
	headers.Вставить("Content-Type", "application/x-www-form-urlencoded");
	
	HTTPСоединение = Новый HTTPСоединение(""+ВедущийФрагментАдресаKeycloak+".platformaofd.ru", 443 ,,,, 15, Новый ЗащищенноеСоединениеOpenSSL);
	СтрокаЗапроса = "realms/"+realmФрагментАдресаKeycloak+"/protocol/openid-connect/token";
	
	Запрос = Новый HTTPЗапрос(СтрокаЗапроса, headers);
	
	Запрос.УстановитьТелоИзСтроки(СтрокаПараметров, КодировкаТекста.UTF8, ИспользованиеByteOrderMark.НеИспользовать);
	
	HTTPОтвет = HTTPСоединение.ОтправитьДляОбработки(Запрос);
	
	Если HTTPОтвет.КодСостояния = 200 Тогда
		Ответ = HTTPОтвет.ПолучитьТелоКакСтроку();
		Ответ = СтрЗаменить(Ответ, "not-before-policy", "not_before_policy");
		ЧтениеJSON = новый ЧтениеJSON();
		ЧтениеJSON.УстановитьСтроку(Ответ);
		Tokens = ПрочитатьJSON(ЧтениеJSON, Ложь);
		Возврат Tokens;
	 Иначе
		Сообщить("Произошла ошибка при попытке обновления токена," + "Токен не получен" +
				Символы.ПС + "Статус ответа сервера: " + HTTPОтвет.КодСостояния);
		Возврат Неопределено;
	КонецЕсли;
	
КонецФункции

#КонецОбласти

#Область Интеграция1С

&НаСервере
Функция ПолучитьДоступныеОрганизации1С()
	
	ЗапросОрганизаций = Новый Запрос;
	ЗапросОрганизаций.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	Организации.Ссылка,
	|	Организации.ПометкаУдаления,
	|	Организации.Предопределенный,
	|	Организации.ИНН,
	|	Организации.КПП
	|ИЗ
	|	Справочник.Организации КАК Организации
	|ГДЕ
	|	Организации.ПометкаУдаления = ЛОЖЬ";
	
	Результат = ЗапросОрганизаций.Выполнить();
	
	Если НЕ Результат.Пустой() Тогда
		Результат = Результат.Выбрать();
		МассивОрганизаций = Новый Массив;
		Пока Результат.Следующий() Цикл
			ДанныеПоОрганизации = Новый Структура;
			ДанныеПоОрганизации.Вставить("Ссылка", Результат.Ссылка);
			ДанныеПоОрганизации.Вставить("ИНН", Результат.ИНН);
			ДанныеПоОрганизации.Вставить("КПП", Результат.КПП);
			МассивОрганизаций.Добавить(ДанныеПоОрганизации);	
		КонецЦикла;
		Возврат МассивОрганизаций; 
	Иначе	
		Возврат Неопределено;
	КонецЕсли;
	
КонецФункции

&НаСервере
Функция ПолучитьИдентификаторЭДОИз1СПоСсылке(Ссылка, СвойствоИдентификаторУчастника = Неопределено) Экспорт
	
	Если СвойствоИдентификаторУчастника = Неопределено Тогда
		СтруктураХранения1С = ПолучитьСтруктуруХранения1С();
		СвойствоИдентификатор = СтруктураХранения1С.СвойствоИдентификаторУчастника;
	КонецЕсли;
	
	Если СвойствоИдентификатор = Неопределено Тогда
		Сообщение = Новый СообщениеПользователю();
		Сообщение.Текст = "Не удалось определить дополнительное свойство для хранения идентификатора участника ЭДО. Отправка невозморжна.";
		Сообщение.Сообщить();
		Возврат Неопределено;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
	|	ДополнительныеСведения.Значение КАК Идентификатор
	|ИЗ
	|	РегистрСведений."+СтруктураХранения1С.НаименованиеРегистра+ " КАК ДополнительныеСведения
	|ГДЕ
	|	ДополнительныеСведения.Свойство.Наименование = &НаименованиеСвойства
	|	И ДополнительныеСведения.Объект = &Ссылка";	
	Запрос.УстановитьПараметр("НаименованиеСвойства", СвойствоИдентификатор.Наименование);
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	Результат = Запрос.Выполнить();
	Если НЕ Результат.Пустой() Тогда
		Результат = Результат.Выбрать();
		Результат.Следующий();
		Возврат СокрЛП(Результат.Идентификатор);
	Иначе
		Возврат "";
	КонецЕсли;	
	
КонецФункции

&НаКлиенте
Процедура НастройкиШаблонов(Команда) 
	ПараметрыОткрытияФормы = Новый Структура;
	
	ОткрытьФорму(ИмяОбработки + ".Форма.ФормаРаботыСШаблонамиПакетов", ПараметрыОткрытияФормы, ЭтаФорма, , , , , РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

#КонецОбласти
