
#Область СобытияФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	Если Параметры.Свойство("ЭкземплярДокумента") Тогда
		
		ЭкземплярДокумента = Параметры.ЭкземплярДокумента;
		ОтобразитьПредставлениеТипаДокумента();
		
		ДоступныеКомандыПечати = ПолучитьКомандыПечатиПоОбъекту(ЭкземплярДокумента.Метаданные());
		КомандыПечати.Загрузить(ДоступныеКомандыПечати.Скопировать(, "Представление, МенеджерПечати, Идентификатор, ДополнительныеПараметры")); 
		
		Для Каждого КомандаПечати из КомандыПечати Цикл 
			Элементы.СписокПФИдентификатор.СписокВыбора.Добавить(КомандаПечати.Идентификатор, КомандаПечати.Представление);
		КонецЦикла;	
		
	КонецЕсли;	
		
	ДобавитьУсловноеОформлениеТекстаДляСпискаВыбора(Элементы.СписокПФИдентификатор);
	
КонецПроцедуры

&НаКлиенте
Процедура СписокПФИдентификаторПриИзменении(Элемент)
	
	ИдентификаторДобавленнойПФ = Элементы.СписокПФ.ТекущиеДанные.Идентификатор;
	
	ОтборКомандПечати = Новый Структура;
	ОтборКомандПечати.Вставить("Идентификатор", ИдентификаторДобавленнойПФ);
	
	СтрокиПФ = СписокПФ.НайтиСтроки(ОтборКомандПечати);
	
	Если СтрокиПФ.Количество() = 1 Тогда 
		
		СтрокаКомандыПечати = КомандыПечати.НайтиСтроки(ОтборКомандПечати)[0];
			
		Элементы.СписокПФ.ТекущиеДанные.Представление			= СтрокаКомандыПечати.Представление;
		Элементы.СписокПФ.ТекущиеДанные.МенеджерПечати			= СтрокаКомандыПечати.МенеджерПечати;
		Элементы.СписокПФ.ТекущиеДанные.ДополнительныеПараметры	= СтрокаКомандыПечати.ДополнительныеПараметры;
		
	ИначеЕсли СтрокиПФ.Количество() = 2 Тогда 
		
		СписокПФ.Удалить(СписокПФ.НайтиПоИдентификатору(Элементы.СписокПФ.ТекущаяСтрока));
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область КнопкаПодтвердитьВыбор

&НаКлиенте
Процедура ПодтвердитьВыбор(Команда)

	ЭтаФорма.Закрыть(СписокПФ);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыФункции

&НаСервере
Процедура ОтобразитьПредставлениеТипаДокумента()
	
	ДокументПечати = Метаданные.НайтиПоТипу(ТипЗнч(ЭкземплярДокумента)).Синоним;
	
КонецПроцедуры

// Добавит правила условного оформления для всех значений списка выбора элемента
// для отображения вместо значений текст из представления из списка выбора элемента
// Параметры:
//  Элемент - ПолеФормы - Элемент управления
//       для которого следует установить правила оформления на основании выбранного (установленного) значения
//
&НаСервере
Процедура ДобавитьУсловноеОформлениеТекстаДляСпискаВыбора(Элемент, Отказ = Ложь)
	
	Перем Форма;
	
	Форма = ПолучитьФормуЧерезЭлементУправления(Элемент, Отказ);        
	
	Для Каждого ЭлементСпискаВыбора Из Элемент.СписокВыбора  Цикл
		
		// Новое правило оформления 
		ЭлементУсловногоОформления = Форма.УсловноеОформление.Элементы.Добавить();
		ЭлементУсловногоОформления.Оформление.УстановитьЗначениеПараметра("Текст", ЭлементСпискаВыбора.Представление);
		
		// Условие    
		ЭлементУсловия  				= ЭлементУсловногоОформления.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		ЭлементУсловия.ЛевоеЗначение 	= Новый ПолеКомпоновкиДанных(Элемент.ПутьКДанным);   
		ЭлементУсловия.ВидСравнения		= ВидСравненияКомпоновкиДанных.Равно;  
		ЭлементУсловия.ПравоеЗначение	= ЭлементСпискаВыбора.Значение;
		
		// Поле                                                 
		ОформляемоеПоле 				= ЭлементУсловногоОформления.Поля.Элементы.Добавить();
		ОформляемоеПоле.Поле 			= Новый ПолеКомпоновкиДанных(Элемент.Имя);   
	КонецЦикла;                                                               
	
КонецПроцедуры // УстановитьУсловноеОформлениеДляСпискаВыбораЭлементаУправления()

// Вернет управляемую форму на которой размещен элемент управления
// Параметры:
//  Элемент - ПолеФормы - Элемент управления
//  Отказ - Булево - будет содержать признак отказа выполнения метода
// Возвращаемое значение:
//  - УправляемаяФорма - 
&НаСервере
Функция ПолучитьФормуЧерезЭлементУправления(Элемент, Отказ = Ложь)     
	
	Перем Родитель; 
	Родитель = Элемент.Родитель;
	
	Пока ТипЗнч(Родитель) <> Тип("УправляемаяФорма") Цикл
		
		Родитель = Родитель.Родитель;
		
	КонецЦикла;
	
	Возврат Родитель;     
	
КонецФункции // ПолучитьФормуЧерезЭлементУправления()

&НаСервере
Функция УказаннаяФормаВПФСоответствуетДокументу(ВПФ, ЭкземплярДокумента)
	
	УказаннаяФормаСоответствуетДокументу = Ложь;
	Для Каждого Назначение из ВПФ.Назначение Цикл
		Если Назначение.ОбъектНазначения.Имя = ЭкземплярДокумента.Метаданные().Имя Тогда
			УказаннаяФормаСоответствуетДокументу = Истина;
			Прервать;
		КонецЕсли;	
	КонецЦикла;
	Возврат УказаннаяФормаСоответствуетДокументу;
	
КонецФункции

&НаСервере
Функция ПолучитьКомандыПечатиПоОбъекту(Метаданные) Экспорт

	мДанные = Новый Массив;	
	мДанные.Добавить(Метаданные);
	
	НайденныеКомандыПечати = УправлениеПечатью.КомандыПечатиФормы("ФормаЭлемента", мДанные);
	
	Возврат НайденныеКомандыПечати;

КонецФункции

#КонецОбласти