 
 #Область ОбработчикиСобытийШапкиФормы
 
 &НаСервере
 Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	 
	 ЭтотОбъект.ИмяОбработки = РеквизитФормыВЗначение("Объект").Метаданные().ПолноеИмя();
	 
	 Если Параметры.Свойство(Организация) тогда
		 ЭтотОбъект.Организация = Параметры.Организация;
	 КонецЕсли; 
	 
	 КэшированныеРеквизиты = ХранилищеОбщихНастроек.Загрузить("ОФД_ЭДО_НастройкиОбработки",
	 "ДанныеФормыСпискаШаблонов",
	 "Содержит сохраняемые реквизиты",
	 ПолучитьТекущегоПользователя()); 
	 
	 Если НЕ КэшированныеРеквизиты = Неопределено тогда
		 
		 ЭтотОбъект.Организация = КэшированныеРеквизиты.Организация;
		 
	 КонецЕсли;
	 
	 ОбновитьСписокШаблоновСервер();
	 
 КонецПроцедуры
 
 &НаКлиенте
 Процедура ОрганизацияПриИзменении(Элемент)
	 
	 ОбновитьСписокШаблоновСервер();
	 
 КонецПроцедуры  
 
 &НаКлиенте
 Процедура СписокШаблоновПриАктивизацииСтроки(Элемент)
	 ЭтотОбъект.Элементы.СписокШаблоновГрупповоеСозданиеШаблоновНаОсновании.Доступность = Истина;
	 ЭтотОбъект.ТекущаяСтрокаТаблицы = Элементы.СписокШаблонов.ТекущаяСтрока;
 КонецПроцедуры
 
 
 #КонецОбласти
 
 #Область ОбработчикиКомандФормы
 
 &НаКлиенте
 Процедура ГрупповоеСозданиеШаблоновНаОсновании(Команда)
	 
	 ВыбранныйШаблон = Элементы.СписокШаблонов.ВыделенныеСтроки[0];
	 
	 ПараметрыОткрытияФормы = Новый Структура;
	 ПараметрыОткрытияФормы.Вставить("ЭтоНовый", Истина);
	 ПараметрыОткрытияФормы.Вставить("ЭтоМассовоеСоздание", Истина);
	 ПараметрыОткрытияФормы.Вставить("Контрагент", "");
	 ПараметрыОткрытияФормы.Вставить("Организация", ЭтотОбъект.Организация);
	 
	 ОповещениОЗакрытии = Новый ОписаниеОповещения("ПослеЗакрытияФормыМассовогоСоздания", ЭтаФорма);
	 
	 ОткрытьФорму(ИмяОбработки + ".Форма.ФормаШаблонаПакета", ПараметрыОткрытияФормы, ЭтаФорма, , , ,ОповещениОЗакрытии, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	 
	 
 КонецПроцедуры
 
 &НаКлиенте
 Процедура СоздатьНовыйШаблон(Команда)
	 
	 ПараметрыОткрытияФормы = Новый Структура;
	 ПараметрыОткрытияФормы.Вставить("ЭтоНовый", Истина);
	 ПараметрыОткрытияФормы.Вставить("Контрагент");
	 ПараметрыОткрытияФормы.Вставить("Организация", ЭтотОбъект.Организация);
	 
	 ОповещениеОЗакрытии = Новый ОписаниеОповещения("ПослеЗакрытияФормыШаблона", ЭтаФорма);
	 
	 ОткрытьФорму(ИмяОбработки + ".Форма.ФормаШаблонаПакета", ПараметрыОткрытияФормы, ЭтаФорма, , , ,ОповещениеОЗакрытии , РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	 
 КонецПроцедуры
 
 &НаКлиенте
 Процедура СозданиеШаблонаКопированием(Команда)
	 
	 ПараметрыОткрытияФормы = Новый Структура;
	 ДопПараметры = Новый Структура;
	 
	 ОписаниеОповещения = Новый ОписаниеОповещения("ПослеЗакрытияФормыШаблона", ЭтотОбъект, ДопПараметры);
	 
	 ПараметрыОткрытияФормы.Вставить("ЭтоНовый", Ложь);
	 ПараметрыОткрытияФормы.Вставить("Контрагент", );
	 ПараметрыОткрытияФормы.Вставить("Организация", ЭтотОбъект.Организация);
	 ПараметрыОткрытияФормы.Вставить("Наименование");
	 ПараметрыОткрытияФормы.Вставить("ЭтоКопирование", Истина);
	 
	 ЗаполнитьЗначенияСвойств(ПараметрыОткрытияФормы, Элементы.СписокШаблонов.ТекущиеДанные);
	 
	 ОткрытьФорму(ИмяОбработки + ".Форма.ФормаШаблонаПакета", ПараметрыОткрытияФормы, ЭтаФорма, , , ,ОписаниеОповещения, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	 
 КонецПроцедуры
 
 
 #КонецОбласти
 
 
 #Область СлужебныеПроцедурыИФункции 
 
 &НаКлиенте
 Процедура СписокШаблоновВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	 
	 ПараметрыОткрытияФормы = Новый Структура;
	 ДопПараметры = Новый Структура;
	 
	 ОписаниеОповещения = Новый ОписаниеОповещения("ПослеЗакрытияФормыШаблона", ЭтотОбъект, ДопПараметры);
	 
	 ПараметрыОткрытияФормы.Вставить("ЭтоНовый", Ложь);
	 ПараметрыОткрытияФормы.Вставить("Контрагент", );
	 ПараметрыОткрытияФормы.Вставить("Организация", ЭтотОбъект.Организация);
	 ПараметрыОткрытияФормы.Вставить("Наименование");
	 
	 ЗаполнитьЗначенияСвойств(ПараметрыОткрытияФормы, Элементы.СписокШаблонов.ТекущиеДанные);
	 
	 ОткрытьФорму(ИмяОбработки + ".Форма.ФормаШаблонаПакета", ПараметрыОткрытияФормы, ЭтаФорма, , , ,ОписаниеОповещения, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	 
 КонецПроцедуры
 
 &НаКлиенте
 Процедура СписокШаблоновПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	 Отказ = Истина;	 
 КонецПроцедуры
 
 Процедура ПослеЗакрытияФормыШаблона(ПараметрыЗакрытия, ДопПараметрыЗакрытия) Экспорт
	 
	 ОбновитьСписокШаблоновСервер();
	 ЭтотОбъект.ТекущаяСтрокаТаблицы = 0;
	 
 КонецПроцедуры
 
 Процедура ПослеЗакрытияФормыМассовогоСоздания(ПараметрыЗакрытия, ДопПараметрыЗакрытия) Экспорт
	 
 КонецПроцедуры
 
 Процедура ОбновитьСписокШаблоновСервер()
	 
	 ЭтотОбъект.СписокШаблонов.Очистить();
	 
	 ВсеШаблоны = ХранилищеОбщихНастроек.Загрузить("ОФД_ЭДО_НастройкиОбработки",
	 "СписокШаблоновПакетов",
	 "Содержит список шаблонов пакетов ЭД",
	 ПолучитьТекущегоПользователя()); 
	 
	 СтруктураПоиска = Новый Структура;
	 СтруктураПоиска.Вставить("Организация", ЭтотОбъект.Организация);
	 
	 Если НЕ ТипЗнч(ВсеШаблоны) = Тип("Неопределено") тогда
		 ШаблоныПоОрганизации = ВсеШаблоны.НайтиСтроки(СтруктураПоиска);
	 Иначе
		 ИнициализироватьСписокШаблонов();
		 
		 ВсеШаблоны = ХранилищеОбщихНастроек.Загрузить("ОФД_ЭДО_НастройкиОбработки",
		 "СписокШаблоновПакетов",
		 "Содержит список шаблонов пакетов ЭД",
		 ПолучитьТекущегоПользователя());
		 
		 ШаблоныПоОрганизации = ВсеШаблоны.НайтиСтроки(СтруктураПоиска);
	 КонецЕсли;
	 
	 Для каждого Строка из ШаблоныПоОрганизации цикл
		 
		 НСтр = ЭтотОбъект.СписокШаблонов.Добавить();
		 НСтр.Контрагент = Строка.Контрагент;
		 НСтр.ИНН = Строка.Контрагент.ИНН;
		 НСтр.КПП = Строка.Контрагент.КПП;
		 Попытка
			 НСтр.Наименование = Строка.Наименование;
		 Исключение 
			 НСтр.Наименование = Строка.ИДШаблона;
		 КонецПопытки;
	 КонецЦикла;
	 
	 
 КонецПроцедуры 
 
 Процедура ИнициализироватьСписокШаблонов()
	 
	 ВсеНастройки = Новый ТаблицаЗначений;
	 ВсеНастройки.Колонки.Добавить("Организация");
	 ВсеНастройки.Колонки.Добавить("Контрагент");
	 ВсеНастройки.Колонки.Добавить("Наименование");
	 
	 ХранилищеОбщихНастроек.Сохранить("ОФД_ЭДО_НастройкиОбработки",
	 "СписокШаблоновПакетов",
	 ВсеНастройки,
	 "Содержит шаблоны пакетов ЭД",
	 ПолучитьТекущегоПользователя());
	 
 КонецПроцедуры
 
 &НаСервереБезКонтекста
 Функция ПолучитьТекущегоПользователя()
	 
	 Возврат Неопределено;
	 
	 Если НЕ Метаданные.ОбщиеМодули.Найти("ПользователиИнформационнойБазы") = Неопределено Тогда
		 ТекущийПользователь = ПользователиИнформационнойБазы.ТекущийПользователь();
	 Иначе
		 ТекущийПользователь = ПользователиКлиентСервер.ТекущийПользователь();
	 КонецЕсли;	
	 
	 Возврат ТекущийПользователь;
	 
 КонецФункции
 
 &НаКлиенте
 Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	 
	 ПередЗакрытиемСервер();
	 
 КонецПроцедуры 
 
 &НаСервере
 Процедура ПередЗакрытиемСервер()
	 
	 СтруктураФормы = Новый Структура;
	 
	 СтруктураФормы.Вставить("Организация",ЭтотОбъект.Организация);
	 
	 ХранилищеОбщихНастроек.Сохранить("ОФД_ЭДО_НастройкиОбработки",
	 "ДанныеФормыСпискаШаблонов",
	 СтруктураФормы,
	 "Содержит сохраняемые реквизиты",
	 ПолучитьТекущегоПользователя());
	 
	 
 КонецПроцедуры
 
 &НаКлиенте
 Процедура СписокШаблоновПередУдалением(Элемент, Отказ)
	 
	 СтруктураПоиска = Новый Структура;
	 
	 СтруктураПоиска = Новый Структура;
	 СтруктураПоиска.Вставить("Организация", ЭтотОбъект.Организация); 
	 СтруктураПоиска.Вставить("Наименование", Элементы.СписокШаблонов.ТекущиеДанные.Наименование); 
	 
	 УдалитьШаблоныСервер(СтруктураПоиска);
	 
 КонецПроцедуры  
 
 Процедура УдалитьШаблоныСервер(СтруктураПоиска)
	 
	 ВсеШаблоны = ХранилищеОбщихНастроек.Загрузить("ОФД_ЭДО_НастройкиОбработки",
	 "СписокШаблоновПакетов",
	 "Содержит список шаблонов пакетов ЭД",
	 ПолучитьТекущегоПользователя());
	 
	 НайденныеШаблоны = ВсеШаблоны.НайтиСтроки(СтруктураПоиска);	
	 
	 Для каждого Строка из НайденныеШаблоны цикл
		 ВсеШаблоны.Удалить(Строка);
	 КонецЦикла;
	 
	 ХранилищеОбщихНастроек.Сохранить("ОФД_ЭДО_НастройкиОбработки",
	 "СписокШаблоновПакетов",
	 ВсеШаблоны,
	 "Содержит список шаблонов пакетов ЭД",
	 ПолучитьТекущегоПользователя());
	 
	 
 КонецПроцедуры
 
 #КонецОбласти